{
    "DailyTips_DataBase": {
        "General": {
            "tips": [
                {
                    "title": "Trust Your Gut Feelings",
                    "tip": "If something feels off about a person or situation, listen to that inner voice. Your intuition is your best protector in dating."
                },
                {
                    "title": "Don't Settle for Breadcrumbing",
                    "tip": "If someone only reaches out sporadically with minimal effort, they're not truly interested. You deserve consistent communication and genuine effort."
                },
                {
                    "title": "Keep Your Independence",
                    "tip": "Maintain your hobbies, friendships, and personal goals while dating. A healthy relationship adds to your life, not replaces it."
                },
                {
                    "title": "Watch Actions, Not Words",
                    "tip": "Pay attention to how someone treats you through their actions. Consistency between words and behavior shows genuine interest and respect."
                },
                {
                    "title": "Set Clear Boundaries Early",
                    "tip": "Communicate your boundaries from the start. The right person will respect them; the wrong person will try to test them."
                },
                {
                    "title": "Don't Rush Physical Intimacy",
                    "tip": "Take your time getting to know someone before becoming physically intimate. Moving at your own pace helps you make clear-headed decisions."
                },
                {
                    "title": "Notice How They Handle Conflict",
                    "tip": "The first disagreement reveals character. Look for someone who communicates respectfully and works toward solutions, not someone who gaslights or stonewalls."
                },
                {
                    "title": "You're Not Responsible for Fixing Anyone",
                    "tip": "Enter relationships with emotionally available people. You're a partner, not a therapist or rehabilitation project."
                },
                {
                    "title": "Keep Your Financial Independence",
                    "tip": "Maintain your own bank account and financial stability. Financial independence gives you freedom and security in any relationship."
                },
                {
                    "title": "Know Your Non-Negotiables",
                    "tip": "Before dating seriously, identify your deal-breakers regarding values, lifestyle, and future goals. Don't compromise on what truly matters to you."
                }
            ]
        }
    }
}
