{
    "DailyTips_DataBase": {
        "General": {
            "tips": [
                {
                    "title": "Trust Your Gut Feelings",
                    "tip": "If something feels off about a person or situation, listen to that inner voice. Your intuition is your best protector in dating."
                },
                {
                    "title": "Don't Settle for Breadcrumbing",
                    "tip": "If someone only reaches out sporadically with minimal effort, they're not truly interested. You deserve consistent communication and genuine effort."
                },
                {
                    "title": "Keep Your Independence",
                    "tip": "Maintain your hobbies, friendships, and personal goals while dating. A healthy relationship adds to your life, not replaces it."
                },
                {
                    "title": "Watch Actions, Not Words",
                    "tip": "Pay attention to how someone treats you through their actions. Consistency between words and behavior shows genuine interest and respect."
                },
                {
                    "title": "Set Clear Boundaries Early",
                    "tip": "Communicate your boundaries from the start. The right person will respect them; the wrong person will try to test them."
                },
                {
                    "title": "Don't Rush Physical Intimacy",
                    "tip": "Take your time getting to know someone before becoming physically intimate. Moving at your own pace helps you make clear-headed decisions."
                },
                {
                    "title": "Notice How They Handle Conflict",
                    "tip": "The first disagreement reveals character. Look for someone who communicates respectfully and works toward solutions, not someone who gaslights or stonewalls."
                },
                {
                    "title": "You're Not Responsible for Fixing Anyone",
                    "tip": "Enter relationships with emotionally available people. You're a partner, not a therapist or rehabilitation project."
                },
                {
                    "title": "Keep Your Financial Independence",
                    "tip": "Maintain your own bank account and financial stability. Financial independence gives you freedom and security in any relationship."
                },
                {
                    "title": "Know Your Non-Negotiables",
                    "tip": "Before dating seriously, identify your deal-breakers regarding values, lifestyle, and future goals. Don't compromise on what truly matters to you."
                },

                {
    "title": "Date with Purpose, Not Desperation",
    "tip": "Know what you're looking for in a partner before you start dating. Desperation attracts the wrong people; clarity attracts the right ones."
},
{
    "title": "Your Past Doesn't Define Your Worth",
    "tip": "Previous heartbreaks or mistakes don't make you less deserving of love. Every experience taught you something valuable about what you need."
},
{
    "title": "Don't Ignore Love Bombing",
    "tip": "Excessive attention, gifts, and promises early on can be manipulation tactics. Healthy love grows steadily, not explosively."
},
{
    "title": "Meet His Friends and Family",
    "tip": "How someone interacts with their inner circle reveals their true character. If they're hiding you or you from them, that's a red flag."
},
{
    "title": "Don't Be the Only One Initiating",
    "tip": "If you're always the one texting first, planning dates, or making effort, they're showing you their level of interest. Believe it."
},
{
    "title": "Protect Your Energy",
    "tip": "Dating shouldn't drain you emotionally. If someone consistently leaves you feeling anxious or exhausted, that's your sign to walk away."
},
{
    "title": "Never Chase Someone's Potential",
    "tip": "Date who someone is today, not who they could become. You deserve someone who's already working on themselves."
},
{
    "title": "Your Standards Aren't Too High",
    "tip": "Wanting respect, honesty, and emotional maturity isn't asking too much. Don't let anyone convince you to lower your standards."
},
{
    "title": "Take Your Time Before Saying 'I Love You'",
    "tip": "Real love develops over time through consistent actions and shared experiences. Don't rush into declarations you're not sure about."
},
{
    "title": "Notice How They Treat Service Workers",
    "tip": "Someone's behavior toward waiters, drivers, and staff shows their true character and how they'll eventually treat you."
},
{
    "title": "Don't Share Everything on Social Media",
    "tip": "Keep your relationship private in the beginning. Not everything needs to be posted; protect your peace and privacy."
},
{
    "title": "Check Their Relationship History",
    "tip": "Pay attention to patterns in their past relationships. If they blame all their exes, you'll likely become the next villain in their story."
},
{
    "title": "You Can't Love Someone Into Changing",
    "tip": "Love doesn't fix character flaws or bad behavior. People only change when they want to, not because you love them enough."
},
{
    "title": "Don't Accept Excuses for Disrespect",
    "tip": "Stress, busy schedules, or bad days don't justify mistreatment. Someone who truly values you will still treat you with respect."
},
{
    "title": "Have Your Own Life Outside the Relationship",
    "tip": "Continue pursuing your career, hobbies, and friendships. A partner should complement your life, not consume it entirely."
},
{
    "title": "Listen When Friends Voice Concerns",
    "tip": "Your friends see things you might miss when you're emotionally invested. Take their concerns seriously; they want what's best for you."
},
{
    "title": "Don't Make Excuses for Red Flags",
    "tip": "When you spot concerning behavior, don't rationalize it away. Trust patterns, not apologies or promises to change."
},
{
    "title": "Know the Difference Between Alone and Lonely",
    "tip": "Being single is better than being in a relationship that makes you feel lonely. Don't settle just to avoid being alone."
},
{
    "title": "Your Career Matters Just as Much",
    "tip": "Never diminish your professional ambitions for someone who doesn't support them. The right partner will celebrate your success."
},
{
    "title": "Don't Accept Situationships",
    "tip": "If someone wants the benefits of a relationship without the commitment, they're wasting your time. Know your worth and walk away."
},
{
    "title": "Pay Attention to Their Relationship with Their Mother",
    "tip": "How a man treats his mother often indicates how he'll treat you. Look for respect, not codependency or disrespect."
},
{
    "title": "Don't Be Afraid to Walk Away",
    "tip": "Leaving takes courage, but staying in the wrong relationship takes more from you. Your future self will thank you for leaving."
},
{
    "title": "Actions Speak Louder Than Apologies",
    "tip": "Anyone can say sorry; look for changed behavior. Repeated apologies without improvement are just manipulation."
},
{
    "title": "You Deserve Effort, Not Just Interest",
    "tip": "Being interested is easy; making consistent effort shows genuine care. Don't settle for someone who's just keeping you around."
},
{
    "title": "Don't Lose Yourself to Please Someone",
    "tip": "Changing core parts of yourself to make someone happy always backfires. The right person loves you as you are."
},
{
    "title": "Trust Takes Time to Build",
    "tip": "Don't give your full trust immediately. Let someone earn it through consistent, trustworthy behavior over time."
},
{
    "title": "Notice How They Handle Your Success",
    "tip": "A secure partner celebrates your wins. Jealousy, minimizing, or competing with your success are massive red flags."
},
{
    "title": "Your Emotions Are Valid",
    "tip": "If someone dismisses your feelings or calls you too sensitive, they're gaslighting you. Your emotions deserve acknowledgment."
},
{
    "title": "Don't Rush Into Living Together",
    "tip": "Moving in together is a major step. Take your time, discuss expectations, and make sure you're doing it for the right reasons."
},
{
    "title": "Watch How They Handle Rejection",
    "tip": "Someone who can't accept no gracefully or becomes aggressive when rejected is showing dangerous behavior. Trust that instinct."
},
{
    "title": "Keep Your Own Money Separate Initially",
    "tip": "Until you're married or seriously committed, maintain financial independence. Protect yourself and your future."
},
{
    "title": "Don't Accept Being Someone's Secret",
    "tip": "If they won't introduce you to important people in their life or post about you, they're keeping options open. You deserve to be chosen proudly."
},
{
    "title": "Your Needs Matter Just as Much",
    "tip": "A relationship should be balanced. If you're always accommodating their needs while yours are ignored, that's not partnership."
},
{
    "title": "Don't Compete with Other Women",
    "tip": "If someone makes you feel like you're competing for their attention, they're playing games. A committed person makes their choice clear."
},
{
    "title": "Take Note of Consistent Small Gestures",
    "tip": "Grand romantic gestures are nice, but daily small acts of thoughtfulness show genuine care and long-term potential."
},
{
    "title": "You're Not Responsible for Their Happiness",
    "tip": "A partner should add to your happiness, not depend on you entirely for theirs. That's codependency, not love."
},
{
    "title": "Don't Ignore Sexual Incompatibility",
    "tip": "Physical intimacy matters in relationships. If you're fundamentally incompatible, it will cause issues long-term. Be honest about your needs."
},
{
    "title": "Set Boundaries Around Technology",
    "tip": "Discuss expectations about phone use, social media, and privacy early. Healthy relationships require trust and transparency."
},
{
    "title": "Don't Make Someone Your Entire World",
    "tip": "Maintain diverse connections and interests. Depending entirely on one person for fulfillment creates unhealthy pressure."
},
{
    "title": "Notice Their Consistency in Communication",
    "tip": "Someone genuinely interested will stay in touch regularly. Ghosting and reappearing shows disrespect for your time and feelings."
},
{
    "title": "Don't Accept Vague Future Plans",
    "tip": "If someone avoids discussing the future or keeps things ambiguous, they're not serious. You deserve clarity and commitment."
},
{
    "title": "Your Past Relationships Taught You Lessons",
    "tip": "Reflect on what previous relationships taught you about your needs and boundaries. Use that wisdom to make better choices."
},
{
    "title": "Don't Tolerate Controlling Behavior",
    "tip": "Dictating who you see, what you wear, or where you go isn't love—it's control. Healthy love trusts and supports freedom."
},
{
    "title": "Take Time to Heal Between Relationships",
    "tip": "Jumping from one relationship to another prevents healing. Give yourself space to process, grow, and rediscover yourself."
},
{
    "title": "Your Intuition About People Is Usually Right",
    "tip": "That uneasy feeling about someone isn't paranoia; it's your subconscious picking up on inconsistencies. Listen to it."
},
{
    "title": "Don't Accept Crumbs of Affection",
    "tip": "Inconsistent attention and minimal effort aren't love. You deserve someone who shows up fully and consistently."
},
{
    "title": "Build Your Own Financial Security",
    "tip": "Never depend entirely on a partner financially. Having your own money means having choices and freedom."
},
{
    "title": "Notice Who Shows Up During Hard Times",
    "tip": "Anyone can be present during good times. True character shows when things get difficult. Pay attention to who stays."
},
{
    "title": "Don't Compromise Your Values for Love",
    "tip": "Your core values define who you are. Someone who asks you to compromise them doesn't truly love you."
},
{
    "title": "You're Allowed to Change Your Mind",
    "tip": "What you wanted last year might not be what you need now. It's okay to evolve and adjust your relationship goals."
},

                {
    "title": "Don't Ignore Substance Abuse Issues",
    "tip": "Addiction problems don't magically disappear with love. If someone isn't actively working on recovery, protect yourself and walk away."
},
{
    "title": "Your Body Autonomy Is Non-Negotiable",
    "tip": "You're never obligated to do anything physically you're uncomfortable with. Anyone who pressures you doesn't respect you."
},
{
    "title": "Look for Emotional Intelligence",
    "tip": "Someone who can identify, express, and manage their emotions makes a better long-term partner than someone emotionally unavailable."
},
{
    "title": "Don't Be Someone's Therapist",
    "tip": "Supporting a partner is different from being their unpaid therapist. Encourage professional help; you can't fix their mental health issues."
},
{
    "title": "Notice Their Relationship with Money",
    "tip": "Financial irresponsibility, lying about money, or extreme cheapness are warning signs. Money habits reveal character and future compatibility."
},
{
    "title": "You Don't Owe Anyone a Second Chance",
    "tip": "Forgiveness is a choice, not an obligation. If someone showed you who they are, believe them the first time."
},
{
    "title": "Don't Make Life Decisions Based Solely on Romance",
    "tip": "Major choices like moving cities or changing careers should align with your goals, not just to be closer to someone."
},
{
    "title": "Pay Attention to How They Handle Stress",
    "tip": "Life brings stress; notice if they become abusive, withdraw completely, or communicate and cope healthily during tough times."
},
{
    "title": "Your Sexual Pleasure Matters Equally",
    "tip": "Intimacy should be mutual and satisfying. A partner who only cares about their own pleasure is selfish everywhere else too."
},
{
    "title": "Don't Dismiss Your Deal-Breakers",
    "tip": "If kids, marriage, religion, or location are must-haves for you, don't stay with someone incompatible hoping they'll change their mind."
},
{
    "title": "Watch How They Talk About Exes",
    "tip": "Constant badmouthing or overly friendly relationships with all exes both raise questions. Look for healthy boundaries and respect."
},
{
    "title": "You're Not Obligated to Forgive Cheating",
    "tip": "Staying after infidelity is a personal choice, not a requirement. Leaving doesn't make you weak; it shows you value yourself."
},
{
    "title": "Don't Accept Being Plan B",
    "tip": "If someone only reaches out when their first choice isn't available, you're a backup option. You deserve to be someone's priority."
},
{
    "title": "Notice Patterns of Accountability",
    "tip": "Someone who never takes responsibility and always blames others will eventually blame you for everything too."
},
{
    "title": "Your Mental Health Comes First",
    "tip": "If a relationship triggers anxiety, depression, or constant stress, it's harming you. Prioritize your mental wellbeing over staying."
},
{
    "title": "Don't Let Them Isolate You",
    "tip": "A partner who gradually separates you from friends and family is exhibiting abusive behavior. Maintain your support system."
},
{
    "title": "Notice How They Celebrate Your Achievements",
    "tip": "Do they genuinely celebrate your promotions and wins, or do they minimize them? Support should go both ways."
},
{
    "title": "You Can Leave Even If They're Not Abusive",
    "tip": "Not feeling fulfilled or happy is reason enough to leave. You don't need dramatic justification to end a relationship."
},
{
    "title": "Don't Accept Future Faking",
    "tip": "If someone makes grand promises about the future but takes no real steps toward them, they're manipulating you with false hope."
},
{
    "title": "Build Your Own Career and Identity",
    "tip": "Never sacrifice your professional growth or personal identity for a relationship. The right person will support both."
},
{
    "title": "Notice Their Hygiene and Self-Care",
    "tip": "Basic cleanliness and self-care show self-respect. If someone can't maintain basic hygiene, it reflects deeper issues."
},
{
    "title": "Don't Accept Hot and Cold Behavior",
    "tip": "Someone who's loving one day and distant the next is creating emotional instability. Consistency is essential for healthy attachment."
},
{
    "title": "Your Friendships Matter",
    "tip": "A good partner respects and encourages your friendships. Jealousy of your platonic relationships is a major red flag."
},
{
    "title": "Don't Rush Past Awkward Conversations",
    "tip": "Discussing STI testing, exclusivity, and sexual history might be uncomfortable, but these conversations protect your health and emotional wellbeing."
},
{
    "title": "Notice Their Work Ethic and Ambition",
    "tip": "You don't need someone wealthy, but ambition and work ethic matter. Chronic laziness or lack of goals will frustrate you long-term."
},
{
    "title": "You're Allowed to Have Male Friends",
    "tip": "A secure partner trusts you and doesn't demand you end all friendships with men. Extreme jealousy is controlling, not caring."
},
{
    "title": "Don't Accept Weaponized Incompetence",
    "tip": "If they pretend they can't do basic tasks so you'll do everything, that's manipulation. Adult partners share responsibilities equally."
},
{
    "title": "Notice How They Handle Your Boundaries",
    "tip": "Testing, pushing, or ignoring your boundaries shows fundamental disrespect. The right person honors your limits immediately."
},
{
    "title": "Your Hobbies and Passions Matter",
    "tip": "Don't abandon activities you love for someone. A supportive partner encourages your interests, even if they don't share them."
},
{
    "title": "Don't Accept Being Compared to Others",
    "tip": "Constant comparisons to exes, friends, or strangers are disrespectful. You deserve someone who appreciates your uniqueness."
},
{
    "title": "Watch for Signs of Financial Abuse",
    "tip": "Controlling access to money, hiding finances, or sabotaging your job are abuse tactics. Financial freedom is crucial."
},
{
    "title": "You Don't Need to Justify Your Feelings",
    "tip": "Your emotions are valid even if someone disagrees with them. Don't let anyone convince you that what you feel is wrong."
},
{
    "title": "Don't Accept Stonewalling During Arguments",
    "tip": "Walking away mid-conflict without resolution or giving silent treatment is emotional manipulation. Healthy couples communicate through disagreements."
},
{
    "title": "Notice Their Relationship with Alcohol",
    "tip": "Needing alcohol to have fun, socialize, or cope with stress indicates dependency issues that will affect your relationship."
},
{
    "title": "Your Comfort Level with PDA Matters",
    "tip": "Whether you love or hate public displays of affection, your comfort should be respected. Compatibility in this area prevents resentment."
},
{
    "title": "Don't Accept Passive Aggressive Behavior",
    "tip": "Indirect communication, backhanded compliments, and subtle digs are toxic. Demand direct, honest communication."
},
{
    "title": "Build Emergency Savings Independently",
    "tip": "Always maintain a financial safety net separate from your partner. This gives you options if you ever need to leave quickly."
},
{
    "title": "Notice Their Relationship with Technology",
    "tip": "Excessive phone use, secretive behavior with devices, or refusing to disconnect during quality time shows misplaced priorities."
},
{
    "title": "Don't Settle for Lack of Ambition",
    "tip": "If you're growth-oriented and they're content with stagnation, this fundamental difference will create ongoing friction."
},
{
    "title": "Your Political and Social Values Matter",
    "tip": "Core beliefs about equality, justice, and human rights aren't minor differences. Fundamental value misalignment causes lasting conflict."
},
{
    "title": "Don't Accept Being Kept at Arm's Length",
    "tip": "If someone won't let you get emotionally close or share vulnerably, they're emotionally unavailable. You can't build intimacy with walls."
},
{
    "title": "Notice Their Parenting Views If Kids Matter",
    "tip": "Disagreements about discipline, education, and parenting philosophy will cause major problems. Align on these values before committing."
},
{
    "title": "You're Allowed to Date Multiple People Initially",
    "tip": "Until you have an exclusivity conversation, dating others helps you make informed choices. Don't put all eggs in one basket prematurely."
},
{
    "title": "Don't Accept Being Rushed Into Commitment",
    "tip": "Love bombing and pushing for quick commitment are manipulation tactics. Healthy relationships develop at a comfortable pace."
},
{
    "title": "Notice How They Handle Your Period",
    "tip": "Someone who treats menstruation as disgusting or refuses to acknowledge normal biological functions lacks maturity and empathy."
},
{
    "title": "Your Religious or Spiritual Beliefs Matter",
    "tip": "If faith is important to you, dating someone who mocks or disrespects your beliefs will create ongoing pain and conflict."
},
{
    "title": "Don't Accept Triangulation Tactics",
    "tip": "Using other people to make you jealous or communicate for them instead of directly talking to you is manipulative game-playing."
},
{
    "title": "Build Confidence Outside of Relationships",
    "tip": "Your self-worth shouldn't depend on having a partner. Work on loving yourself independently; it makes you a better partner."
},
{
    "title": "Notice Their Response to Your Achievements",
    "tip": "Genuine partners feel pride in your successes. Downplaying, competing with, or resenting your wins reveals insecurity and toxicity."
},
{
    "title": "You Deserve Enthusiastic Consent Always",
    "tip": "Consent should be clear, enthusiastic, and ongoing. Anything less than yes means no, and you should never feel pressured."
},

{
    "title": "Don't Apologize for Having Standards",
    "tip": "Knowing what you want and refusing to settle isn't being picky—it's being smart. Never let anyone shame you for having boundaries."
},
{
    "title": "Notice Their Relationship with Their Siblings",
    "tip": "How someone treats their siblings reveals how they handle long-term relationships. Look for respect, not rivalry or indifference."
},
{
    "title": "You're Not Responsible for Their Trauma",
    "tip": "While you can be supportive, healing their past wounds isn't your job. They need to do their own emotional work."
},
{
    "title": "Don't Accept Being Hidden on Social Media",
    "tip": "If they refuse to acknowledge your relationship online while posting everything else, they're keeping their options open or hiding you."
},
{
    "title": "Watch How They Treat Animals",
    "tip": "Cruelty or indifference toward animals often signals a lack of empathy that will eventually extend to how they treat you."
},
{
    "title": "Your Education and Intelligence Matter",
    "tip": "Never dumb yourself down to make someone comfortable. A secure partner appreciates and celebrates your intelligence."
},
{
    "title": "Don't Accept Last-Minute Plans Only",
    "tip": "If they only reach out for spontaneous hangouts and never plan ahead, you're convenient, not a priority."
},
{
    "title": "Notice Their Punctuality and Reliability",
    "tip": "Chronic lateness and broken promises show disrespect for your time. Reliability matters in building trust."
},
{
    "title": "You Can Love Someone and Still Leave",
    "tip": "Love alone isn't enough to sustain a relationship. Compatibility, respect, and shared values matter just as much."
},
{
    "title": "Don't Ignore Your Physical Health Needs",
    "tip": "If stress from a relationship causes physical symptoms like headaches or stomach issues, your body is warning you to leave."
},
{
    "title": "Watch for Jekyll and Hyde Behavior",
    "tip": "Someone who's charming in public but cruel in private is showing you their real self. The mask always slips eventually."
},
{
    "title": "Your Sleep Schedule Matters",
    "tip": "A partner who disrupts your sleep with late-night arguments or demands for attention is disrespecting your health and wellbeing."
},
{
    "title": "Don't Accept Being the Relationship Planner",
    "tip": "If you're always initiating dates, planning activities, and making all the effort, they're not equally invested."
},
{
    "title": "Notice How They Handle Criticism",
    "tip": "Someone who becomes defensive or angry at gentle feedback will never be able to grow with you through challenges."
},
{
    "title": "You're Allowed to Outgrow Relationships",
    "tip": "People change and evolve. It's okay to realize someone who fit your life before doesn't anymore."
},
{
    "title": "Don't Accept Being Guilt-Tripped",
    "tip": "Manipulation through guilt about spending time with others or pursuing your interests is emotional abuse, not love."
},
{
    "title": "Watch Their Driving Behavior",
    "tip": "Road rage, reckless driving, or aggressive behavior behind the wheel reveals anger management issues that will surface elsewhere."
},
{
    "title": "Your Birth Control Choices Are Yours Alone",
    "tip": "Never let a partner pressure you about contraception decisions. Your body, your choice—no exceptions."
},
{
    "title": "Don't Accept Being Compared to Their Ex",
    "tip": "Constant references to past relationships, especially comparisons, show they haven't moved on and you'll always compete with a ghost."
},
{
    "title": "Notice Their Generosity with Others",
    "tip": "How someone treats service workers, tips, and shares with friends reveals their character more than how they treat you initially."
},
{
    "title": "You Don't Need Permission to Have Feelings",
    "tip": "Your emotions don't require validation from your partner. If they make you feel crazy for having normal reactions, that's gaslighting."
},
{
    "title": "Don't Sacrifice Your Living Space Comfort",
    "tip": "If moving in together, ensure you have personal space and input on the home. Your comfort in your own space is essential."
},
{
    "title": "Watch How They Handle Your Medical Needs",
    "tip": "A caring partner supports you during illness or medical appointments. Annoyance or dismissal of health concerns is a red flag."
},
{
    "title": "Your Food Preferences Deserve Respect",
    "tip": "Whether you're vegan, have allergies, or dietary preferences, a good partner accommodates and respects your choices without complaint."
},
{
    "title": "Don't Accept Being Monitored Constantly",
    "tip": "Demanding to check your phone, tracking your location, or interrogating you about whereabouts is controlling, not protective."
},
{
    "title": "Notice Their Relationship with Honesty",
    "tip": "Small lies about insignificant things indicate a pattern. If they lie about little things, they'll lie about big ones."
},
{
    "title": "You're Allowed to Change After Pregnancy",
    "tip": "If planning a family, ensure your partner understands your body, priorities, and identity will evolve. You're not just an incubator."
},
{
    "title": "Don't Accept Being Interrupted Constantly",
    "tip": "Someone who talks over you, dismisses your points, or never lets you finish sentences doesn't respect your voice."
},
{
    "title": "Watch Their Reaction to Your Promotions",
    "tip": "If your career success threatens them or they suggest you turn down opportunities, they're insecure and holding you back."
},
{
    "title": "Your Grooming Choices Are Personal",
    "tip": "Whether it's hair, makeup, or body hair, your appearance choices are yours. A partner who demands changes is controlling."
},
{
    "title": "Don't Accept Being the Emotional Dumping Ground",
    "tip": "Supporting a partner's struggles is different from being their only outlet. They need healthy coping mechanisms and possibly therapy."
},
{
    "title": "Notice How They Handle Your Family Drama",
    "tip": "A good partner supports you through family difficulties without badmouthing your relatives or forcing you to choose sides."
},
{
    "title": "You're Not Obligated to Share Passwords",
    "tip": "Trust doesn't require full digital access. Demanding passwords to prove loyalty is a violation of privacy and autonomy."
},
{
    "title": "Don't Accept Being Rush Into Marriage",
    "tip": "Pressure to get married quickly, especially with ultimatums, is a manipulation tactic. Take the time you need to be certain."
},
{
    "title": "Watch How They Handle Differing Opinions",
    "tip": "Healthy couples can disagree respectfully. If every difference becomes a battle or personal attack, communication is toxic."
},
{
    "title": "Your Spiritual Practices Deserve Space",
    "tip": "Whether you meditate, pray, or practice rituals, your spiritual life should be respected, not mocked or interfered with."
},
{
    "title": "Don't Accept Being Blamed for Their Mood",
    "tip": "You're not responsible for managing their emotions. If they blame you for their bad moods constantly, that's manipulation."
},
{
    "title": "Notice Their Response to Your Boundaries",
    "tip": "The first time you set a boundary reveals everything. Respect means immediate acceptance, not negotiation or pushback."
},
{
    "title": "You Deserve Reciprocal Effort in Planning",
    "tip": "From date nights to life decisions, planning should be shared. If you're always the organizer, you're carrying too much weight."
},
{
    "title": "Don't Accept Being Criticized Publicly",
    "tip": "A respectful partner never belittles, mocks, or criticizes you in front of others. Private concerns stay private."
},
{
    "title": "Watch Their Financial Transparency",
    "tip": "Hiding debts, secret accounts, or lying about spending shows dishonesty that will affect your shared future."
},
{
    "title": "Your Learning Style Deserves Patience",
    "tip": "Whether you're learning a skill together or they're teaching you something, impatience or condescension shows disrespect."
},
{
    "title": "Don't Accept Being Love Bombed and Discarded",
    "tip": "Cycles of intense affection followed by coldness or abandonment are narcissistic abuse patterns. This won't change."
},
{
    "title": "Notice How They React to Your Pain",
    "tip": "Whether physical or emotional, a caring partner shows empathy. Minimizing your pain or making it about them is cruel."
},
{
    "title": "You're Allowed to Prioritize Your Safety",
    "tip": "Trusting your instincts about unsafe situations, people, or places isn't paranoia. A good partner supports your safety concerns."
},
{
    "title": "Don't Accept Being Excluded from Decisions",
    "tip": "Major life decisions affecting you both should involve your input. Unilateral choices show they don't see you as an equal partner."
},
{
    "title": "Watch How They Handle Your Trauma",
    "tip": "A compassionate partner respects your triggers and healing process without using your trauma against you during arguments."
},
{
    "title": "Your Creative Expression Matters",
    "tip": "Whether you write, paint, dance, or create, your artistic pursuits deserve encouragement, not ridicule or discouragement."
},
{
    "title": "Don't Accept Being Punished with Silence",
    "tip": "The silent treatment is emotional abuse designed to control you. Healthy partners communicate even when upset."
},
{
    "title": "Notice Their Commitment to Growth",
    "tip": "Are they reading, learning, and working on themselves? Stagnant people resist change and will resent your growth."
},

     {
    "title": "Don't Ignore Weaponized Forgetfulness",
    "tip": "If they conveniently forget important dates, promises, or conversations repeatedly, it's deliberate dismissal, not poor memory."
},
{
    "title": "Your Clothing Choices Are Your Own",
    "tip": "A partner who polices what you wear or makes you feel ashamed of your style is controlling. Dress however makes you confident."
},
{
    "title": "Watch How They Handle Your Achievements at Work",
    "tip": "Do they ask about your day genuinely or change the subject? Interest in your professional life shows they value your whole self."
},
{
    "title": "You Don't Need to Explain Your Past",
    "tip": "Your history before them is yours to share or not. Don't let anyone pressure you into revealing more than you're comfortable with."
},
{
    "title": "Don't Accept Being Made to Feel Needy",
    "tip": "Having normal relationship needs like communication and quality time isn't being needy. Don't let them make you feel demanding for wanting basics."
},
{
    "title": "Notice Their Relationship with Cleanliness",
    "tip": "Expecting you to clean up after them like a parent reveals entitlement. Adult partners share household responsibilities equally."
},
{
    "title": "Your Alone Time Is Sacred",
    "tip": "Needing space to recharge isn't rejection. A healthy partner understands and respects your need for solitude."
},
{
    "title": "Don't Accept Being the Only One Compromising",
    "tip": "Relationships require mutual compromise. If you're always the one bending, you're not in a partnership—you're being controlled."
},
{
    "title": "Watch Their Reaction to Your Girl Time",
    "tip": "A secure partner encourages your friendships with women. Jealousy or resentment of your girls' nights reveals insecurity."
},
{
    "title": "You're Allowed to Keep Some Things Private",
    "tip": "Intimacy doesn't mean sharing every single thought or detail. You're entitled to mental and emotional privacy."
},
{
    "title": "Don't Accept Being Rushed Through Grief",
    "tip": "Whether loss of a loved one or pet, grief takes time. A compassionate partner supports your process without rushing your healing."
},
{
    "title": "Notice How They Handle Your Dietary Needs",
    "tip": "Making fun of your food choices, pressuring you to eat differently, or 'forgetting' your allergies shows disrespect and carelessness."
},
{
    "title": "Your Professional Network Is Valuable",
    "tip": "Maintain your career connections independently. A partner threatened by your professional relationships is insecure and limiting your growth."
},
{
    "title": "Don't Accept Being the Peacemaker Always",
    "tip": "If you're constantly managing their relationships with others or smoothing over their conflicts, they lack social skills and accountability."
},
{
    "title": "Watch How They Discuss Marriage and Kids",
    "tip": "Vague answers about the future or changing their stance repeatedly means they're keeping options open. Demand clarity."
},
{
    "title": "You Deserve Enthusiastic Support",
    "tip": "Your partner should be your biggest cheerleader. Lukewarm support or competitiveness shows they're threatened by your success."
},
{
    "title": "Don't Accept Being Dismissed as Dramatic",
    "tip": "Labeling your legitimate concerns as drama is a silencing tactic. Your feelings deserve to be heard and addressed."
},
{
    "title": "Notice Their Gift-Giving Thoughtfulness",
    "tip": "Gifts don't need to be expensive, but they should show they pay attention. Generic or last-minute gifts show lack of effort."
},
{
    "title": "Your Medical History Is Private",
    "tip": "You decide what health information to share and when. Don't let anyone pressure you into disclosing medical details before you're ready."
},
{
    "title": "Don't Accept Being Compared to Their Mother",
    "tip": "Whether favorably or unfavorably, constant mother comparisons are unhealthy. You're a partner, not a maternal replacement."
},
{
    "title": "Watch Their Response to Your Hobbies",
    "tip": "Mocking or belittling activities you enjoy shows contempt. Support means encouraging your interests even if they don't share them."
},
{
    "title": "You're Not Required to Share Your Location",
    "tip": "Demanding constant location access is surveillance, not safety. Trust means not needing to track each other's every move."
},
{
    "title": "Don't Accept Being the Household Manager",
    "tip": "Planning meals, appointments, and household tasks shouldn't fall entirely on you. Mental load should be shared equally."
},
{
    "title": "Notice How They Handle Your Menstrual Health",
    "tip": "Supportive partners understand PMDD, cramps, and mood changes. Dismissal or mockery of your cycle shows immaturity."
},
{
    "title": "Your Reading Preferences Matter",
    "tip": "Whether you read romance, mystery, or non-fiction, don't let anyone shame your literary choices. Your reading is your business."
},
{
    "title": "Don't Accept Being Rushed Through Decisions",
    "tip": "Major choices about moving, marriage, or career need time. Pressure to decide quickly prevents you from thinking clearly."
},
{
    "title": "Watch Their Behavior During Your Period",
    "tip": "Do they help, stay supportive, or act disgusted and avoid you? Their response to natural biology reveals maturity level."
},
{
    "title": "You Deserve Privacy in the Bathroom",
    "tip": "Wanting bathroom privacy isn't being secretive. Everyone deserves personal space for basic bodily functions without surveillance."
},
{
    "title": "Don't Accept Being the Entertainment Director",
    "tip": "Constantly having to keep them entertained or plan all activities is exhausting. Adults should be able to entertain themselves."
},
{
    "title": "Notice Their Relationship with Your Pets",
    "tip": "How they treat animals you love shows character. Jealousy of your pet or refusing to respect your animal companion is concerning."
},
{
    "title": "Your Therapy Sessions Are Confidential",
    "tip": "You're not obligated to share everything discussed in therapy. Your mental health work can remain private."
},
{
    "title": "Don't Accept Being Volunteered for Things",
    "tip": "Making commitments on your behalf without asking shows disrespect for your time and autonomy."
},
{
    "title": "Watch How They Handle Your Salary Changes",
    "tip": "Whether you earn more or less than them shouldn't threaten a secure partner. Financial changes reveal insecurity or support."
},
{
    "title": "You're Allowed to Say No to Sex",
    "tip": "Consent isn't a one-time thing. You can always say no, change your mind, or stop—no explanations needed."
},
{
    "title": "Don't Accept Being Monitored Online",
    "tip": "Demanding access to your social media or monitoring who you follow is digital abuse. Your online presence is yours to control."
},
{
    "title": "Notice Their Response to Your Boundaries with In-Laws",
    "tip": "A good partner supports your boundaries with their family, not forces relationship or dismisses your discomfort."
},
{
    "title": "Your Self-Care Routine Matters",
    "tip": "Whether skincare, baths, or spa days, self-care time is important. Don't let anyone make you feel selfish for prioritizing yourself."
},
{
    "title": "Don't Accept Being the Designated Driver Always",
    "tip": "If they always drink while expecting you to stay sober and drive, they're using you. Responsibility should be reciprocal."
},
{
    "title": "Watch Their Financial Responsibility",
    "tip": "Chronic overdrafts, inability to budget, or constantly borrowing money shows financial immaturity that will impact your future."
},
{
    "title": "You Deserve Morning and Night Routines",
    "tip": "Your sleep schedule and morning rituals deserve respect. Disrupting these for their convenience shows selfishness."
},
{
    "title": "Don't Accept Being the Free Labor",
    "tip": "If they're always asking you to do work-related tasks or help their business for free, they're exploiting you."
},
{
    "title": "Notice How They Handle Your Postpartum Journey",
    "tip": "After childbirth, you need support not criticism. Comments about your body or pressure to 'bounce back' are cruel."
},
{
    "title": "Your Comfort with Alcohol Is Valid",
    "tip": "Whether you drink or not, your choice deserves respect. Pressure to drink or mocking sobriety shows disrespect."
},
{
    "title": "Don't Accept Being the Emotion Translator",
    "tip": "You shouldn't have to constantly interpret their unclear communication. Adults should express themselves clearly."
},
{
    "title": "Watch Their Handling of Your Health Concerns",
    "tip": "Dismissing symptoms or discouraging doctor visits shows lack of care for your wellbeing. Health concerns deserve attention."
},
{
    "title": "You're Allowed to Have Different Political Views",
    "tip": "While core values should align, you can have different opinions on some issues. Respect for differing views matters."
},
{
    "title": "Don't Accept Being the Budget Manager Alone",
    "tip": "Financial planning is a shared responsibility. If they refuse to engage with household finances, they're avoiding adult accountability."
},
{
    "title": "Notice Their Reaction to Your Weight Changes",
    "tip": "Bodies fluctuate naturally. Comments, pressure to diet, or withdrawal of affection based on weight are abusive."
},
{
    "title": "Your Dreams and Goals Matter Equally",
    "tip": "Your aspirations aren't less important than theirs. A partnership means supporting each other's ambitions, not just one person's."
},
{
    "title": "Don't Accept Being the Social Secretary",
    "tip": "Maintaining all friendships and family relationships shouldn't be your sole job. They need to nurture their own connections too."
},
           


                

            ]
        }
    }
}
