{
  "GirlsCode_DataBase": {
    "GirlCode1": {
      "GirlCode_Title": "Never Date Your Bestie's Ex",
      "GirlCode_Details": "Her ex is off-limits forever. No guy is worth losing your best friend over."
    },
    "GirlCode2": {
      "GirlCode_Title": "Keep Her Secrets Safe",
      "GirlCode_Details": "What she tells you about him stays between you two. Loyalty over gossip, always."
    },
    "GirlCode3": {
      "GirlCode_Title": "Be Honest About Red Flags",
      "GirlCode_Details": "If you see a red flag in her dating life, speak up—with love and honesty."
    },
    "GirlCode4": {
      "GirlCode_Title": "Hype Her Up, Don't Tear Her Down",
      "GirlCode_Details": "Celebrate her wins, support her glow-up, and never compete with her for male attention."
    },
    "GirlCode5": {
      "GirlCode_Title": "Don't Let Him Isolate Her",
      "GirlCode_Details": "If a guy is trying to cut her off from friends and family, that's a dealbreaker. Call it out."
    },
    "GirlCode6": {
      "GirlCode_Title": "Split the Bill or Offer to Pay",
      "GirlCode_Details": "Financial independence matters. Never feel obligated to let a man pay if it makes you uncomfortable."
    },
    "GirlCode7": {
      "GirlCode_Title": "Trust Your Gut Feeling",
      "GirlCode_Details": "If something feels off about him, it probably is. Your intuition is your superpower—don't ignore it."
    },
    "GirlCode8": {
      "GirlCode_Title": "Have Each Other's Backs on Dates",
      "GirlCode_Details": "Check-ins during dates, safe words for group hangouts, and always prioritize her safety over politeness."
    },
    "GirlCode9": {
      "GirlCode_Title": "Don't Chase Men, Attract Them",
      "GirlCode_Details": "Know your worth and let him put in the effort. A man worth having will show up for you consistently."
    },
    "GirlCode10": {
      "GirlCode_Title": "Prioritize Your Peace Over Relationships",
      "GirlCode_Details": "No relationship is worth your mental health, self-respect, or happiness. It's okay to walk away and start fresh."
    },

    "GirlCode11": {
  "GirlCode_Title": "Don't Settle for Breadcrumbs",
  "GirlCode_Details": "Sporadic texts and last-minute plans aren't dating. You deserve consistency and intentionality."
},
"GirlCode12": {
  "GirlCode_Title": "Call Out Disrespect Immediately",
  "GirlCode_Details": "Whether it's a joke that lands wrong or behavior that crosses the line, address it in the moment."
},
"GirlCode13": {
  "GirlCode_Title": "Don't Loan Money to Romantic Partners",
  "GirlCode_Details": "Money and romance mix poorly. If he can't afford something, that's his problem to solve."
},
"GirlCode14": {
  "GirlCode_Title": "Keep Your Girls Informed",
  "GirlCode_Details": "Let your close friends know where you're going on dates and who you're with for safety."
},
"GirlCode15": {
  "GirlCode_Title": "Never Apologize for Your Standards",
  "GirlCode_Details": "Having dealbreakers isn't being picky—it's being smart about what you accept in your life."
},
"GirlCode16": {
  "GirlCode_Title": "Don't Play Games to Keep Him Interested",
  "GirlCode_Details": "If you have to pretend to be someone else or play hard to get, he's not the one."
},
"GirlCode17": {
  "GirlCode_Title": "Watch How He Treats Service Workers",
  "GirlCode_Details": "A man's character shows in how he treats people who can't do anything for him."
},
"GirlCode18": {
  "GirlCode_Title": "Don't Ignore Patterns",
  "GirlCode_Details": "If he's lied once, cheated once, or been disrespectful once, that's usually not the last time."
},
"GirlCode19": {
  "GirlCode_Title": "Support Her Career Over Her Relationship",
  "GirlCode_Details": "A good man will lift her up professionally. Never encourage her to choose a guy over her dreams."
},
"GirlCode20": {
  "GirlCode_Title": "Don't Change Yourself for Anyone",
  "GirlCode_Details": "Your quirks, ambitions, and personality are features, not bugs. The right person will love all of you."
},
"GirlCode21": {
  "GirlCode_Title": "Know the Difference Between Love and Convenience",
  "GirlCode_Details": "Just because he's comfortable doesn't mean he loves you. Real love includes effort and growth."
},
"GirlCode22": {
  "GirlCode_Title": "Don't Compete for His Attention",
  "GirlCode_Details": "If you're fighting other women for his time, he's not worth fighting for."
},
"GirlCode23": {
  "GirlCode_Title": "Listen to Your Friends' Concerns",
  "GirlCode_Details": "Sometimes people we love see red flags we're too close to notice. Stay open to their perspective."
},
"GirlCode24": {
  "GirlCode_Title": "Require Exclusivity Conversation Early",
  "GirlCode_Details": "Don't assume you're exclusive. Have the conversation and make sure you're on the same page."
},
"GirlCode25": {
  "GirlCode_Title": "Don't Shrink Yourself for Him",
  "GirlCode_Details": "Your ambition, intelligence, and confidence are attractive. Never downplay them to make him comfortable."
},
"GirlCode26": {
  "GirlCode_Title": "Respect Boundaries Without Explanation",
  "GirlCode_Details": "You don't owe anyone access to your body, time, or energy. A boundary is enough."
},
"GirlCode27": {
  "GirlCode_Title": "Don't Accept Apologies Without Change",
  "GirlCode_Details": "Words are easy. Real apologies come with changed behavior over time."
},
"GirlCode28": {
  "GirlCode_Title": "Check In With Her During Relationship Issues",
  "GirlCode_Details": "When she's going through a breakup or relationship drama, show up consistently and listen without judgment."
},
"GirlCode29": {
  "GirlCode_Title": "Don't Stay for Potential",
  "GirlCode_Details": "He's not a fixer-upper project. Love him for who he is now, not who he might become."
},
"GirlCode30": {
  "GirlCode_Title": "Know That Trauma Bonding Isn't Love",
  "GirlCode_Details": "Going through drama together doesn't mean you're compatible. Real love is built on stability and respect."
},
"GirlCode31": {
  "GirlCode_Title": "Don't Let Him Rewrite Your Narrative",
  "GirlCode_Details": "If he constantly contradicts your memories or experiences, that's manipulation. Trust yourself."
},
"GirlCode32": {
  "GirlCode_Title": "Celebrate Single Status",
  "GirlCode_Details": "Being alone is better than being with the wrong person. Enjoy your independence and freedom."
},
"GirlCode33": {
  "GirlCode_Title": "Don't Accept Crumbs of Effort",
  "GirlCode_Details": "He should show up for you in meaningful ways, not just romantically. Check his actions, not his words."
},
"GirlCode34": {
  "GirlCode_Title": "Protect Your Peace From Drama",
  "GirlCode_Details": "Don't engage with his exes, his family drama, or unnecessary conflict. Your energy is precious."
},
"GirlCode35": {
  "GirlCode_Title": "Don't Compete With His Phone",
  "GirlCode_Details": "If he's always on his phone around you, he's not present. You deserve full attention."
},
"GirlCode36": {
  "GirlCode_Title": "Ask Direct Questions",
  "GirlCode_Details": "Stop hinting and guessing. Clear communication prevents misunderstandings and wasted time."
},
"GirlCode37": {
  "GirlCode_Title": "Don't Accept Bare Minimum",
  "GirlCode_Details": "He texting back doesn't deserve a medal. Set the bar higher than basic human decency."
},
"GirlCode38": {
  "GirlCode_Title": "Watch How He Handles Conflict",
  "GirlCode_Details": "Does he communicate or shut down? Does he take responsibility or blame you? His conflict style matters."
},
"GirlCode39": {
  "GirlCode_Title": "Don't Let Him Rush the Relationship",
  "GirlCode_Details": "Love-bombing and moving fast are red flags. Healthy relationships develop at a sustainable pace."
},
"GirlCode40": {
  "GirlCode_Title": "Maintain Financial Independence",
  "GirlCode_Details": "Never become financially dependent on a partner. Keep your own income, savings, and resources."
},
"GirlCode41": {
  "GirlCode_Title": "Don't Accept Jealousy as Love",
  "GirlCode_Details": "A possessive, controlling man isn't protecting you—he's owning you. That's not love."
},
"GirlCode42": {
  "GirlCode_Title": "Listen When She Says He's Bad News",
  "GirlCode_Details": "If your bestie sees something you don't, take it seriously. She might be the voice of reason you need."
},
"GirlCode43": {
  "GirlCode_Title": "Don't Stay in Situationships",
  "GirlCode_Details": "After a few months, if he won't define the relationship, he's deciding for you. Choose clarity and walk away."
},
"GirlCode44": {
  "GirlCode_Title": "Respect Her Timeline",
  "GirlCode_Details": "Whether she's taking time to heal or rushing into love, support her journey without judgment."
},
"GirlCode45": {
  "GirlCode_Title": "Don't Ignore Substance Abuse Issues",
  "GirlCode_Details": "If he drinks excessively, uses drugs, or has addictive behaviors, that's a dealbreaker. You can't fix it."
},
"GirlCode46": {
  "GirlCode_Title": "Know That Love Isn't Enough",
  "GirlCode_Details": "Chemistry and love matter, but so do values, goals, and compatibility. Passion fades without a solid foundation."
},
"GirlCode47": {
  "GirlCode_Title": "Don't Accept Silent Treatment",
  "GirlCode_Details": "Giving you the cold shoulder is manipulation. Demand communication or remove yourself from the situation."
},
"GirlCode48": {
  "GirlCode_Title": "Check His Relationship With His Mother",
  "GirlCode_Details": "How he treats the main woman in his life reveals how he'll eventually treat you."
},
"GirlCode49": {
  "GirlCode_Title": "Don't Share Your Passwords or Codes",
  "GirlCode_Details": "Privacy isn't secrecy. Keep your personal accounts and information to yourself for your own protection."
},
"GirlCode50": {
  "GirlCode_Title": "Normalize Asking About Exes",
  "GirlCode_Details": "His past relationships matter. Ask about breakups, patterns, and what he learned. His answers reveal character."
},
"GirlCode51": {
  "GirlCode_Title": "Don't Sacrifice Sleep for Late-Night Texts",
  "GirlCode_Details": "If he only wants to talk late at night, that's intentional. He's not prioritizing quality time with you."
},
"GirlCode52": {
  "GirlCode_Title": "Support Her Decision to Leave",
  "GirlCode_Details": "If she decides to end it, celebrate her strength. Never pressure her to stay or take him back."
},
"GirlCode53": {
  "GirlCode_Title": "Don't Ignore Online Red Flags",
  "GirlCode_Details": "Check his social media behavior. Is he respectful? Does he have shady follows? Trust what you see."
},
"GirlCode54": {
  "GirlCode_Title": "Know That Great Sex Isn't a Relationship",
  "GirlCode_Details": "Chemistry in bed doesn't mean compatibility in life. Don't confuse passion with partnership."
},
"GirlCode55": {
  "GirlCode_Title": "Don't Let Him Control Your Circle",
  "GirlCode_Details": "A good man wants you to have friends and life outside the relationship. Isolation is a control tactic."
},
"GirlCode56": {
  "GirlCode_Title": "Ask About His Future Plans",
  "GirlCode_Details": "Does he want marriage, kids, stability? Make sure his vision aligns with yours before investing deeper."
},
"GirlCode57": {
  "GirlCode_Title": "Don't Accept Mixed Signals",
  "GirlCode_Details": "Confused feelings are usually someone keeping options open. Clarity is a bare minimum."
},
"GirlCode58": {
  "GirlCode_Title": "Be There When She's Rebuilding",
  "GirlCode_Details": "After heartbreak, show up consistently. Remind her of her worth and help her find herself again."
},
"GirlCode59": {
  "GirlCode_Title": "Don't Overlook How He Speaks About Women",
  "GirlCode_Details": "Misogynistic jokes, disrespectful commentary about women—these aren't harmless. They reveal his worldview."
},
"GirlCode60": {
  "GirlCode_Title": "Trust the Relationship Feedback You Get",
  "GirlCode_Details": "If multiple people express concern about your relationship, listen. Sometimes outside perspective is clarity."
},

    "GirlCode61": {
  "GirlCode_Title": "Don't Accept Weaponized Incompetence",
  "GirlCode_Details": "If he 'doesn't know how' to do basic tasks to avoid responsibility, that's deliberate. Don't fall for it."
},
"GirlCode62": {
  "GirlCode_Title": "Celebrate Her Self-Care Without Guilt",
  "GirlCode_Details": "Taking time for herself isn't selfish. Encourage her to prioritize mental health and personal growth."
},
"GirlCode63": {
  "GirlCode_Title": "Don't Ignore Financial Irresponsibility",
  "GirlCode_Details": "A man drowning in debt or spending recklessly will drag you down. Money habits reveal character."
},
"GirlCode64": {
  "GirlCode_Title": "Ask Him About His Friendships",
  "GirlCode_Details": "Does he maintain friendships? Is he loyal to his friends? These patterns translate to romantic relationships."
},
"GirlCode65": {
  "GirlCode_Title": "Don't Accept Performative Apologies",
  "GirlCode_Details": "Grand gestures and expensive gifts don't erase hurt. Actions and consistency matter more."
},
"GirlCode66": {
  "GirlCode_Title": "Protect Her From His Insecurities",
  "GirlCode_Details": "If he's threatened by her success or friends, that's his issue to work on, not hers to manage."
},
"GirlCode67": {
  "GirlCode_Title": "Don't Date Men Who Disrespect Their Mothers",
  "GirlCode_Details": "If he speaks harshly about his mom, he'll eventually speak that way about you too."
},
"GirlCode68": {
  "GirlCode_Title": "Know Your Non-Negotiables Early",
  "GirlCode_Details": "Before investing time, be clear about what you need: commitment, honesty, respect, emotional availability."
},
"GirlCode69": {
  "GirlCode_Title": "Don't Let Him Gaslight Your Feelings",
  "GirlCode_Details": "Your emotions are valid. If he dismisses how you feel, that's disrespect disguised as logic."
},
"GirlCode70": {
  "GirlCode_Title": "Be Honest When She's Making a Mistake",
  "GirlCode_Details": "Real friendship means speaking hard truths with compassion, not just telling her what she wants to hear."
},
"GirlCode71": {
  "GirlCode_Title": "Don't Accept Unreturned Effort",
  "GirlCode_Details": "If you're always the one planning dates, texting first, and initiating, you're dating alone."
},
"GirlCode72": {
  "GirlCode_Title": "Watch For Love-Bombing Red Flags",
  "GirlCode_Details": "Excessive compliments, declarations of love too early, and overwhelming attention are manipulation tactics."
},
"GirlCode73": {
  "GirlCode_Title": "Don't Compromise Your Mental Health",
  "GirlCode_Details": "If a relationship is causing anxiety, depression, or constant stress, it's toxic. Leave."
},
"GirlCode74": {
  "GirlCode_Title": "Remind Her That Alone Is Better Than Wrong",
  "GirlCode_Details": "Single life is freedom. An unhappy relationship is a prison. Help her see that."
},
"GirlCode75": {
  "GirlCode_Title": "Don't Accept Conditional Love",
  "GirlCode_Details": "He shouldn't love you only when you're happy, thin, quiet, or convenient. Real love is unconditional."
},
"GirlCode76": {
  "GirlCode_Title": "Check His Relationship History",
  "GirlCode_Details": "Does he have a pattern of short relationships, toxic exes, or always playing the victim? That's a tell."
},
"GirlCode77": {
  "GirlCode_Title": "Don't Ignore Trust Issues Early",
  "GirlCode_Details": "If he's paranoid, controlling, or suspicious early on, it won't improve. That's his baggage to unpack."
},
"GirlCode78": {
  "GirlCode_Title": "Support Her Through the Messy Middle",
  "GirlCode_Details": "Healing isn't linear. Be patient when she's processing emotions from a breakup."
},
"GirlCode79": {
  "GirlCode_Title": "Don't Accept Disrespect Dressed as Humor",
  "GirlCode_Details": "If he belittles you and laughs it off as a joke, that's emotional abuse. Don't normalize it."
},
"GirlCode80": {
  "GirlCode_Title": "Know That Potential Isn't Promise",
  "GirlCode_Details": "He might be smart, talented, or attractive, but potential means nothing without effort and follow-through."
},
"GirlCode81": {
  "GirlCode_Title": "Don't Settle Into Complacency",
  "GirlCode_Details": "Just because you've been together a while doesn't mean you should accept less. Standards don't expire."
},
"GirlCode82": {
  "GirlCode_Title": "Call Out Double Standards",
  "GirlCode_Details": "If he has freedoms he won't give you, that's inequality. You deserve the same respect and autonomy."
},
"GirlCode83": {
  "GirlCode_Title": "Don't Ignore Vague Commitment",
  "GirlCode_Details": "Phrases like 'eventually' or 'maybe someday' about the future mean he's not serious. Move on."
},
"GirlCode84": {
  "GirlCode_Title": "Celebrate Her Solo Travels and Adventures",
  "GirlCode_Details": "Independence strengthens her. Encourage her to explore the world and know herself better."
},
"GirlCode85": {
  "GirlCode_Title": "Don't Accept Blame for His Actions",
  "GirlCode_Details": "He cheated, lied, or hurt you because of his choices, not because of anything you did or didn't do."
},
"GirlCode86": {
  "GirlCode_Title": "Check How He Treats People He Disagrees With",
  "GirlCode_Details": "Kindness in disagreement shows maturity. Hostility and contempt are warning signs."
},
"GirlCode87": {
  "GirlCode_Title": "Don't Let Him Redefine Your Boundaries",
  "GirlCode_Details": "Once you set a boundary, hold it. Don't let him negotiate or manipulate you into changing it."
},
"GirlCode88": {
  "GirlCode_Title": "Be the Friend She Needs During Heartbreak",
  "GirlCode_Details": "Listen without fixing, validate without judging, and remind her of who she was before him."
},
"GirlCode89": {
  "GirlCode_Title": "Don't Accept Minimum Investment",
  "GirlCode_Details": "He should be investing emotionally, mentally, and physically in the relationship, not just showing up."
},
"GirlCode90": {
  "GirlCode_Title": "Know That Chemistry Fades Without Respect",
  "GirlCode_Details": "Attraction and passion need respect as a foundation, or they'll eventually disappear entirely."
},
"GirlCode91": {
  "GirlCode_Title": "Don't Overlook Substance in Pursuit of Style",
  "GirlCode_Details": "Good looks, money, and charm don't equal a good man. Character and integrity matter most."
},
"GirlCode92": {
  "GirlCode_Title": "Warn Her About Future-Faking",
  "GirlCode_Details": "If he talks about a future together but never makes concrete plans, he's stringing you along."
},
"GirlCode93": {
  "GirlCode_Title": "Don't Accept Avoidant Behavior",
  "GirlCode_Details": "If he disappears when things get serious or runs from difficult conversations, he's emotionally unavailable."
},
"GirlCode94": {
  "GirlCode_Title": "Respect Her Choice to Stay Single",
  "GirlCode_Details": "Not everyone needs a relationship. If she's happy alone, celebrate that instead of pushing dates."
},
"GirlCode95": {
  "GirlCode_Title": "Don't Ignore Patterns of Infidelity",
  "GirlCode_Details": "If he cheated on past partners, he's shown you who he is. Believe him and move on."
},
"GirlCode96": {
  "GirlCode_Title": "Ask About His Emotional Intelligence",
  "GirlCode_Details": "Can he identify and express emotions? Is he self-aware? Emotional maturity is non-negotiable."
},
"GirlCode97": {
  "GirlCode_Title": "Don't Stay Because of Time Already Invested",
  "GirlCode_Details": "Sunk cost fallacy is real, but wasting more time won't change the past. Cut losses and move forward."
},
"GirlCode98": {
  "GirlCode_Title": "Help Her Recognize Her Own Worth",
  "GirlCode_Details": "Constantly remind her that she's valuable, deserving, and enough—exactly as she is right now."
},
"GirlCode99": {
  "GirlCode_Title": "Don't Accept Resentment as Normal",
  "GirlCode_Details": "If he's resentful about your career, friends, or hobbies, that's possessiveness, not love."
},
"GirlCode100": {
  "GirlCode_Title": "Know That Your Happiness Comes First",
  "GirlCode_Details": "You can't pour from an empty cup. Prioritize your wellbeing, dreams, and peace above any relationship."
},
"GirlCode101": {
  "GirlCode_Title": "Don't Ignore Red Flags for the Sake of Companionship",
  "GirlCode_Details": "Fear of being alone is never a reason to stay with someone who doesn't serve you."
},
"GirlCode102": {
  "GirlCode_Title": "Show Up Consistently for Her Wins",
  "GirlCode_Details": "Career promotions, personal achievements, fitness goals—celebrate them all like they're your own."
},
"GirlCode103": {
  "GirlCode_Title": "Don't Accept Fake Effort",
  "GirlCode_Details": "Grand romantic gestures mean nothing if everyday care is missing. Consistency matters more than spectacle."
},
"GirlCode104": {
  "GirlCode_Title": "Understand That Compatibility Matters",
  "GirlCode_Details": "You can love someone deeply and still not be right for each other. That's okay and it's valid."
},
"GirlCode105": {
  "GirlCode_Title": "Don't Let Her Dim Her Light",
  "GirlCode_Details": "If a man asks her to be smaller, quieter, or less ambitious, he's trying to control her. Protect her."
},
"GirlCode106": {
  "GirlCode_Title": "Check His Response to Rejection",
  "GirlCode_Details": "Does he respect boundaries or get defensive? How he handles 'no' reveals his character."
},
"GirlCode107": {
  "GirlCode_Title": "Don't Accept Comparison to His Exes",
  "GirlCode_Details": "Whether favorably or unfavorably, you shouldn't be measured against his past. You're your own person."
},
"GirlCode108": {
  "GirlCode_Title": "Be Her Reality Check",
  "GirlCode_Details": "When she's making excuses for him, gently point out what you're seeing. Love doesn't require blindness."
},
"GirlCode109": {
  "GirlCode_Title": "Don't Ignore Early Signs of Controlling Behavior",
  "GirlCode_Details": "Monitoring your location, questioning your friendships, or checking your phone—these are abuse precursors."
},
"GirlCode110": {
  "GirlCode_Title": "Know That You Deserve Effort, Not Excuses",
  "GirlCode_Details": "A man who wants to be with you will make time, communicate, and show up. No excuses."
},

    "GirlCode111": {
  "GirlCode_Title": "Don't Accept Vague Promises",
  "GirlCode_Details": "If he can't give you specifics about the future, he's keeping his options open. Demand clarity."
},
"GirlCode112": {
  "GirlCode_Title": "Celebrate Her Breaking Her Own Cycles",
  "GirlCode_Details": "When she chooses differently or sets new boundaries, acknowledge her growth and strength."
},
"GirlCode113": {
  "GirlCode_Title": "Don't Ignore His Reaction to Your Success",
  "GirlCode_Details": "A secure man will be proud and supportive. Jealousy or dismissal is a major red flag."
},
"GirlCode114": {
  "GirlCode_Title": "Know That Trauma Doesn't Excuse Behavior",
  "GirlCode_Details": "His past pain explains things but doesn't justify hurting you. He needs to do the work."
},
"GirlCode115": {
  "GirlCode_Title": "Don't Stay in a Relationship Out of Pity",
  "GirlCode_Details": "Feeling sorry for him isn't a foundation for love. You deserve to be with someone you're excited about."
},
"GirlCode116": {
  "GirlCode_Title": "Watch How He Handles Your Achievements",
  "GirlCode_Details": "Does he celebrate you or minimize your wins? His reaction shows his true feelings about your success."
},
"GirlCode117": {
  "GirlCode_Title": "Don't Accept Breadcrumb Communication",
  "GirlCode_Details": "Infrequent messages, delayed responses, and one-word replies aren't dating. That's neglect."
},
"GirlCode118": {
  "GirlCode_Title": "Remind Her That Loyalty Goes Both Ways",
  "GirlCode_Details": "She shouldn't be the only one fighting for the relationship. He needs to show up too."
},
"GirlCode119": {
  "GirlCode_Title": "Don't Ignore Mismatched Values",
  "GirlCode_Details": "If your core beliefs differ on religion, family, or life goals, that's not something love conquers."
},
"GirlCode120": {
  "GirlCode_Title": "Know That Your Intuition Is Your Protector",
  "GirlCode_Details": "If something feels wrong before you have proof, trust that feeling. Your gut is wiser than you think."
},
"GirlCode121": {
  "GirlCode_Title": "Don't Accept Intermittent Reinforcement",
  "GirlCode_Details": "When he's inconsistent—sometimes loving, sometimes cold—you'll chase to get that good feeling back. That's manipulation."
},
"GirlCode122": {
  "GirlCode_Title": "Be Her Anchor During Confusion",
  "GirlCode_Details": "When she's unsure about a guy, help her see clearly without judgment. Sometimes we need someone outside to see truth."
},
"GirlCode123": {
  "GirlCode_Title": "Don't Normalize His Anger",
  "GirlCode_Details": "Yelling, throwing things, or aggressive behavior isn't passion—it's a warning sign of abuse."
},
"GirlCode124": {
  "GirlCode_Title": "Ask About His Relationship With Money",
  "GirlCode_Details": "Is he generous or selfish? Does he save or spend recklessly? Money habits show priorities."
},
"GirlCode125": {
  "GirlCode_Title": "Don't Stay Because You've Already Invested",
  "GirlCode_Details": "Months or years invested doesn't mean you owe him more of your future. Future investments matter most."
},
"GirlCode126": {
  "GirlCode_Title": "Help Her See That Attachment Isn't Love",
  "GirlCode_Details": "Fear of being alone, habit, or comfort isn't love. Real love feels safe and expanding, not desperate."
},
"GirlCode127": {
  "GirlCode_Title": "Don't Accept Selective Honesty",
  "GirlCode_Details": "If he's honest sometimes but lies about big or small things, he's a liar. Honesty isn't selective."
},
"GirlCode128": {
  "GirlCode_Title": "Watch For Sudden Personality Changes",
  "GirlCode_Details": "If he's sweet initially then becomes critical and cold, that's a calculated tactic, not a mood shift."
},
"GirlCode129": {
  "GirlCode_Title": "Don't Let Fear Keep You in the Wrong Relationship",
  "GirlCode_Details": "Fear of starting over, being alone, or failure—don't let these fears trap you."
},
"GirlCode130": {
  "GirlCode_Title": "Celebrate Her Choosing Herself",
  "GirlCode_Details": "When she leaves a toxic situation, be her biggest cheerleader. That takes courage."
},
"GirlCode131": {
  "GirlCode_Title": "Don't Accept Excuses for Disrespect",
  "GirlCode_Details": "Drunk, stressed, or tired—disrespect is still disrespect. It's a choice."
},
"GirlCode132": {
  "GirlCode_Title": "Know That Shared Struggles Aren't Compatibility",
  "GirlCode_Details": "Surviving hard times together doesn't mean you belong together. Compatibility needs more than adversity."
},
"GirlCode133": {
  "GirlCode_Title": "Don't Ignore Emotional Unavailability",
  "GirlCode_Details": "If he won't open up, process emotions, or be vulnerable, he can't meet your emotional needs."
},
"GirlCode134": {
  "GirlCode_Title": "Be Her Mirror When She's Losing Herself",
  "GirlCode_Details": "If she's changing who she is for him, gently reflect back who she used to be."
},
"GirlCode135": {
  "GirlCode_Title": "Don't Accept His Need for 'Space' as Connection",
  "GirlCode_Details": "Healthy relationships involve togetherness and intimacy, not constant distance."
},
"GirlCode136": {
  "GirlCode_Title": "Ask How He Talks About His Exes",
  "GirlCode_Details": "Does he trash them all or speak respectfully? How he discusses past partners predicts how he'll discuss you."
},
"GirlCode137": {
  "GirlCode_Title": "Don't Ignore Silent Treatment",
  "GirlCode_Details": "Refusing to communicate or shutting down is emotional abuse. It's a form of control and punishment."
},
"GirlCode138": {
  "GirlCode_Title": "Remind Her That Staying Isn't Love",
  "GirlCode_Details": "Tolerating someone who disrespects you isn't loyalty—it's self-abandonment."
},
"GirlCode139": {
  "GirlCode_Title": "Don't Accept Constant Criticism",
  "GirlCode_Details": "If he's always pointing out what's wrong with you, that's eroding your self-esteem intentionally."
},
"GirlCode140": {
  "GirlCode_Title": "Know That Real Men Don't Need to Prove Themselves",
  "GirlCode_Details": "A secure man shows up consistently without needing you to beg or convince him."
},
"GirlCode141": {
  "GirlCode_Title": "Don't Accept His Boundaries While He Violates Yours",
  "GirlCode_Details": "Healthy relationships have mutual respect for boundaries, not one-sided demands."
},
"GirlCode142": {
  "GirlCode_Title": "Support Her Therapy and Healing Work",
  "GirlCode_Details": "When she's doing the work to understand herself better, celebrate that growth."
},
"GirlCode143": {
  "GirlCode_Title": "Don't Ignore Patterns in His Communication",
  "GirlCode_Details": "Does he only text late? Only call when he needs something? Patterns reveal priorities."
},
"GirlCode144": {
  "GirlCode_Title": "Know That You Don't Need Permission to Leave",
  "GirlCode_Details": "You don't need his agreement or understanding. Your decision to go is enough."
},
"GirlCode145": {
  "GirlCode_Title": "Don't Accept Blame-Shifting",
  "GirlCode_Details": "When he hurts you, he should take responsibility, not flip it to make you the bad guy."
},
"GirlCode146": {
  "GirlCode_Title": "Be Her Safe Space to Vent",
  "GirlCode_Details": "Let her express doubts, frustrations, and fears without judgment. That's what friends do."
},
"GirlCode147": {
  "GirlCode_Title": "Don't Ignore His Social Media Behavior",
  "GirlCode_Details": "Liking other women's photos, inappropriate comments, or hiding you from posts—that's disrespect."
},
"GirlCode148": {
  "GirlCode_Title": "Know That Love Doesn't Require Suffering",
  "GirlCode_Details": "If loving him means constant pain, sacrifice, or compromise of your values, it's not real love."
},
"GirlCode149": {
  "GirlCode_Title": "Don't Accept Performance Over Presence",
  "GirlCode_Details": "Public displays of affection don't matter if he ignores you in private. Real love is consistent."
},
"GirlCode150": {
  "GirlCode_Title": "Celebrate Her Journey to Self-Love",
  "GirlCode_Details": "The relationship she builds with herself is the most important. Encourage her to fall in love with her own life."
},
"GirlCode151": {
  "GirlCode_Title": "Don't Ignore Red Flags Just Because He's Attractive",
  "GirlCode_Details": "Looks fade and don't fix behavior. A beautiful package with an ugly inside is still empty."
},
"GirlCode152": {
  "GirlCode_Title": "Ask About His Vision for You Two",
  "GirlCode_Details": "Does he see a future with you? Can he articulate what that looks like? Vagueness is a warning."
},
"GirlCode153": {
  "GirlCode_Title": "Don't Accept Excuses for Neglect",
  "GirlCode_Details": "Busy doesn't mean ignoring you completely. A man who cares will find time."
},
"GirlCode154": {
  "GirlCode_Title": "Remind Her That She's Allowed to Change Her Mind",
  "GirlCode_Details": "If she thought she wanted forever with him but changed her mind, that's valid. She's allowed to evolve."
},
"GirlCode155": {
  "GirlCode_Title": "Don't Ignore His Resistance to Commitment",
  "GirlCode_Details": "After months of dating, if he won't commit or discuss the future, he's already answered the question."
},
"GirlCode156": {
  "GirlCode_Title": "Know That Vulnerability Is Strength, Not Weakness",
  "GirlCode_Details": "A man who can be vulnerable and honest is showing maturity, not softness."
},
"GirlCode157": {
  "GirlCode_Title": "Don't Accept Transactional Love",
  "GirlCode_Details": "Love shouldn't come with strings attached or expectations of repayment. That's manipulation."
},
"GirlCode158": {
  "GirlCode_Title": "Be the Friend Who Doesn't Abandon Her",
  "GirlCode_Details": "Whether she's in a relationship or single, be consistently there. Don't disappear into coupledom."
},
"GirlCode159": {
  "GirlCode_Title": "Don't Ignore When He Talks Down to You",
  "GirlCode_Details": "Condescension disguised as teaching or explaining is belittling. You're not a child."
},
"GirlCode160": {
  "GirlCode_Title": "Know That You Deserve Someone Who's Sure About You",
  "GirlCode_Details": "Stop trying to convince someone to love you. The right person won't need convincing."
},

    "GirlCode161": {
  "GirlCode_Title": "Don't Accept His Reluctance to Meet Your People",
  "GirlCode_Details": "If he avoids meeting your friends and family after months, he's hiding something or not serious."
},
"GirlCode162": {
  "GirlCode_Title": "Celebrate Her Breaking Free From Codependency",
  "GirlCode_Details": "When she stops needing validation from a man, that's a major win. Amplify that shift."
},
"GirlCode163": {
  "GirlCode_Title": "Don't Ignore When He Prioritizes Everything Over You",
  "GirlCode_Details": "Work, friends, hobbies—these matter, but you should be a priority, not an afterthought."
},
"GirlCode164": {
  "GirlCode_Title": "Know That Your Body Is Your Own",
  "GirlCode_Details": "Never let him pressure you into sex or override your comfort. Consent is always mandatory."
},
"GirlCode165": {
  "GirlCode_Title": "Don't Accept Microaggressions as Harmless",
  "GirlCode_Details": "Small disrespects add up. Don't normalize comments about your body, appearance, or intelligence."
},
"GirlCode166": {
  "GirlCode_Title": "Be Her Cheerleader for New Beginnings",
  "GirlCode_Details": "When she starts fresh—new job, new city, new life—show up and celebrate her bravery."
},
"GirlCode167": {
  "GirlCode_Title": "Don't Ignore Financial Control",
  "GirlCode_Details": "If he monitors your spending, controls your paycheck, or demands access to your accounts, that's abuse."
},
"GirlCode168": {
  "GirlCode_Title": "Ask About His Relationship With Therapy",
  "GirlCode_Details": "Is he open to growth? Has he done therapy work? Someone avoiding self-work will stagnate."
},
"GirlCode169": {
  "GirlCode_Title": "Don't Accept Accusations of Being 'Crazy'",
  "GirlCode_Details": "When he calls you crazy for having emotions or boundaries, that's gaslighting. Trust your sanity."
},
"GirlCode170": {
  "GirlCode_Title": "Remind Her That Loneliness Isn't Love",
  "GirlCode_Details": "Being lonely doesn't make a wrong person right. Being alone is better than being with the wrong one."
},
"GirlCode171": {
  "GirlCode_Title": "Don't Ignore When He Compares You to Others",
  "GirlCode_Details": "Comparing you to his exes, celebrities, or friends is disrespectful and designed to make you feel small."
},
"GirlCode172": {
  "GirlCode_Title": "Know That Your Needs Matter",
  "GirlCode_Details": "Your emotional, physical, and mental needs are valid. Don't shrink them to accommodate him."
},
"GirlCode173": {
  "GirlCode_Title": "Don't Accept Empty Promises Repeatedly",
  "GirlCode_Details": "Once is a mistake, twice is a pattern, three times is a choice. Stop believing his words if actions don't follow."
},
"GirlCode174": {
  "GirlCode_Title": "Support Her Decision to Invest in Herself",
  "GirlCode_Details": "Whether it's therapy, education, or hobbies—when she invests in herself, that's the best relationship."
},
"GirlCode175": {
  "GirlCode_Title": "Don't Ignore His Inability to Apologize Properly",
  "GirlCode_Details": "Real apologies include acknowledgment, understanding, and commitment to change. Anything less is manipulation."
},
"GirlCode176": {
  "GirlCode_Title": "Know That You're Not Responsible for His Emotions",
  "GirlCode_Details": "His happiness, sadness, or anger is his to manage. You're not his emotional support animal."
},
"GirlCode177": {
  "GirlCode_Title": "Don't Accept His Need for You to 'Prove' Love",
  "GirlCode_Details": "Real love doesn't require constant proof. It's shown through consistent actions and presence."
},
"GirlCode178": {
  "GirlCode_Title": "Be There When She's Rebuilding Her Identity",
  "GirlCode_Details": "After a breakup, she might not know who she is. Help her rediscover her passions and dreams."
},
"GirlCode179": {
  "GirlCode_Title": "Don't Ignore When He Threatens to Leave",
  "GirlCode_Details": "If he uses 'I'm leaving' as a manipulation tactic, call his bluff. Don't let threats control you."
},
"GirlCode180": {
  "GirlCode_Title": "Know That Compatibility Requires Communication",
  "GirlCode_Details": "If you can't talk openly about problems, you'll never resolve them. Communication is essential."
},
"GirlCode181": {
  "GirlCode_Title": "Don't Accept Crumbs of Affection",
  "GirlCode_Details": "One text per week or occasional compliments aren't love. You deserve consistent affection."
},
"GirlCode182": {
  "GirlCode_Title": "Celebrate Her Saying No Without Explanation",
  "GirlCode_Details": "When she sets boundaries without justifying them, that's growth. Protect that power."
},
"GirlCode183": {
  "GirlCode_Title": "Don't Ignore His Addiction Issues",
  "GirlCode_Details": "Substance abuse, gambling, or porn addiction—these won't disappear with love. He needs professional help."
},
"GirlCode184": {
  "GirlCode_Title": "Ask About His Relationship With His Siblings",
  "GirlCode_Details": "Does he maintain family relationships? Is he loyal and supportive? Family dynamics reveal character."
},
"GirlCode185": {
  "GirlCode_Title": "Don't Accept Ambiguous Relationship Status",
  "GirlCode_Details": "After a few months, if he won't define what you are, you're not his girlfriend. Move on."
},
"GirlCode186": {
  "GirlCode_Title": "Remind Her That She's Enough as She Is",
  "GirlCode_Details": "She doesn't need a man to complete her. She's whole, worthy, and capable alone."
},
"GirlCode187": {
  "GirlCode_Title": "Don't Ignore When He Flirts With Others",
  "GirlCode_Details": "If he's openly flirting or crossing boundaries with other women, he's disrespecting you."
},
"GirlCode188": {
  "GirlCode_Title": "Know That Your Standards Aren't Too High",
  "GirlCode_Details": "Wanting respect, effort, and honesty isn't asking too much. Don't lower your standards for anyone."
},
"GirlCode189": {
  "GirlCode_Title": "Don't Accept His Anger as Passion",
  "GirlCode_Details": "Explosiveness and volatility aren't signs of depth. They're signs of instability."
},
"GirlCode190": {
  "GirlCode_Title": "Be Her Safe Harbor During Storms",
  "GirlCode_Details": "When her world is falling apart, be the constant, steady presence she can rely on."
},
"GirlCode191": {
  "GirlCode_Title": "Don't Ignore Red Flags Because of Good Moments",
  "GirlCode_Details": "A few good dates don't erase concerning behavior. Consistency matters more than moments."
},
"GirlCode192": {
  "GirlCode_Title": "Know That Forgiveness Doesn't Mean Staying",
  "GirlCode_Details": "You can forgive him and still leave. Forgiveness is for you, not an excuse to remain."
},
"GirlCode193": {
  "GirlCode_Title": "Don't Accept Gaslighting About Your Memories",
  "GirlCode_Details": "If he denies things that happened or makes you question your memory, that's psychological abuse."
},
"GirlCode194": {
  "GirlCode_Title": "Support Her Grieving the Relationship",
  "GirlCode_Details": "Even if leaving was right, it can still hurt. Let her process the loss without toxic positivity."
},
"GirlCode195": {
  "GirlCode_Title": "Don't Ignore His Disrespect Toward Sex Workers",
  "GirlCode_Details": "How he views and speaks about sex workers reveals his respect for women's autonomy."
},
"GirlCode196": {
  "GirlCode_Title": "Know That Love Should Feel Safe",
  "GirlCode_Details": "Real love doesn't include walking on eggshells, anxiety, or constant worry."
},
"GirlCode197": {
  "GirlCode_Title": "Don't Accept His Unwillingness to Compromise",
  "GirlCode_Details": "Healthy relationships require both people to bend. If he won't, he's selfish."
},
"GirlCode198": {
  "GirlCode_Title": "Celebrate Her Creating Boundaries With Family",
  "GirlCode_Details": "If she's setting limits with toxic family members, support her fiercely. That takes strength."
},
"GirlCode199": {
  "GirlCode_Title": "Don't Ignore When He Dismisses Your Career",
  "GirlCode_Details": "Your job, education, and ambitions matter. A supportive partner will celebrate, not diminish them."
},
"GirlCode200": {
  "GirlCode_Title": "Know That You Deserve Someone Who Chooses You Daily",
  "GirlCode_Details": "Love isn't a one-time decision. He should choose you, your happiness, and your wellbeing every single day."
},

    "GirlCode201": {
  "GirlCode_Title": "Don't Accept Breadcrumbs as a Love Language",
  "GirlCode_Details": "Occasional check-ins and rare dates aren't romance. Love shows up consistently and intentionally."
},
"GirlCode202": {
  "GirlCode_Title": "Remind Her That Healing Takes Time",
  "GirlCode_Details": "There's no timeline for getting over heartbreak. Support her patience with herself."
},
"GirlCode203": {
  "GirlCode_Title": "Don't Ignore When He Makes You Feel Small",
  "GirlCode_Details": "Whether through jokes, comments, or actions—if he makes you feel less than, that's emotional abuse."
},
"GirlCode204": {
  "GirlCode_Title": "Know That Your Gut Feeling Is Your Inner Wisdom",
  "GirlCode_Details": "Before you have facts, your intuition senses danger. Listen to that voice inside."
},
"GirlCode205": {
  "GirlCode_Title": "Don't Accept Excuses for Unreliability",
  "GirlCode_Details": "A man who constantly cancels, shows up late, or forgets plans isn't prioritizing you."
},
"GirlCode206": {
  "GirlCode_Title": "Be Her Witness to Her Own Strength",
  "GirlCode_Details": "When she doubts herself, remind her of what she's survived and overcome."
},
"GirlCode207": {
  "GirlCode_Title": "Don't Ignore His Obsession With Controlling Image",
  "GirlCode_Details": "If he's overly concerned with how you look or dress around others, that's about control."
},
"GirlCode208": {
  "GirlCode_Title": "Know That Mistakes Can Be Dealbreakers",
  "GirlCode_Details": "One serious transgression doesn't always deserve a second chance. You get to decide your threshold."
},
"GirlCode209": {
  "GirlCode_Title": "Don't Accept Inconsistent Effort",
  "GirlCode_Details": "Hot and cold behavior keeps you off-balance and fighting for his attention. That's toxic."
},
"GirlCode210": {
  "GirlCode_Title": "Support Her Reclaiming Her Life Post-Breakup",
  "GirlCode_Details": "New hobbies, new friends, new adventures—celebrate her building a life that excites her."
},
"GirlCode211": {
  "GirlCode_Title": "Don't Ignore When He Checks Your Phone",
  "GirlCode_Details": "Monitoring your communications is invasion of privacy and a sign of controlling behavior."
},
"GirlCode212": {
  "GirlCode_Title": "Know That You Deserve Transparency",
  "GirlCode_Details": "A partner should be open about his life, friends, and whereabouts. Secrecy breeds distrust."
},
"GirlCode213": {
  "GirlCode_Title": "Don't Accept His Lack of Ambition",
  "GirlCode_Details": "You can't pour all your energy into lifting him up. He needs his own drive and goals."
},
"GirlCode214": {
  "GirlCode_Title": "Celebrate Her Choosing Her Mental Health",
  "GirlCode_Details": "When she prioritizes therapy, meditation, or self-care over a relationship, that's wisdom."
},
"GirlCode215": {
  "GirlCode_Title": "Don't Ignore Disrespect Disguised as Jokes",
  "GirlCode_Details": "If a 'joke' makes you uncomfortable and he won't stop, it's intentional disrespect."
},
"GirlCode216": {
  "GirlCode_Title": "Know That Apologies Without Change Are Manipulation",
  "GirlCode_Details": "He says sorry but repeats the same behavior. That's not remorse—it's a strategy."
},
"GirlCode217": {
  "GirlCode_Title": "Don't Accept His Discomfort With Your Success",
  "GirlCode_Details": "A real man celebrates your wins. His insecurity about your achievements isn't your problem."
},
"GirlCode218": {
  "GirlCode_Title": "Be Her Reality When She's Lost in Fantasy",
  "GirlCode_Details": "When she's making excuses for him, gently bring her back to what she's actually experiencing."
},
"GirlCode219": {
  "GirlCode_Title": "Don't Ignore His Resistance to Building a Future",
  "GirlCode_Details": "If he won't talk about next year or has no plans, he's not planning to have you in his life."
},
"GirlCode220": {
  "GirlCode_Title": "Know That Self-Respect Is Non-Negotiable",
  "GirlCode_Details": "No one is worth compromising your dignity. Keep your self-respect above all else."
},
"GirlCode221": {
  "GirlCode_Title": "Don't Accept Blame for His Infidelity",
  "GirlCode_Details": "His cheating isn't about what you did or didn't do. It's about his character and choices."
},
"GirlCode222": {
  "GirlCode_Title": "Support Her Setting Boundaries With Exes",
  "GirlCode_Details": "If she's cutting contact with an ex, back her up. She knows what she needs."
},
"GirlCode223": {
  "GirlCode_Title": "Don't Ignore When He Weaponizes Your Insecurities",
  "GirlCode_Details": "If he uses your vulnerabilities against you, that's psychological abuse."
},
"GirlCode224": {
  "GirlCode_Title": "Know That You Shouldn't Have to Ask for Basic Respect",
  "GirlCode_Details": "Respect should be automatic. If you're constantly asking for it, he doesn't value you."
},
"GirlCode225": {
  "GirlCode_Title": "Don't Accept His Inability to Take Criticism",
  "GirlCode_Details": "If he can't hear feedback without becoming defensive, he'll never grow or improve."
},
"GirlCode226": {
  "GirlCode_Title": "Celebrate Her Breaking Unhealthy Patterns",
  "GirlCode_Details": "When she recognizes her own role in dysfunction and changes it, that's self-awareness and growth."
},
"GirlCode227": {
  "GirlCode_Title": "Don't Ignore His Disrespect Toward Your Family",
  "GirlCode_Details": "How he treats your loved ones matters. Rudeness or dismissal is a red flag."
},
"GirlCode228": {
  "GirlCode_Title": "Know That Longing Isn't Love",
  "GirlCode_Details": "Missing someone or wanting them doesn't make a toxic relationship worth saving."
},
"GirlCode229": {
  "GirlCode_Title": "Don't Accept His Refusal to Discuss Problems",
  "GirlCode_Details": "Avoidance of difficult conversations means nothing ever gets resolved."
},
"GirlCode230": {
  "GirlCode_Title": "Be Her Constant When Everything Is Changing",
  "GirlCode_Details": "Through relationships, breakups, and life changes—be the friend who stays steady."
},
"GirlCode231": {
  "GirlCode_Title": "Don't Ignore When He Compares Your Body",
  "GirlCode_Details": "Comments about your weight, appearance, or comparing you to others is body shaming."
},
"GirlCode232": {
  "GirlCode_Title": "Know That Your Feelings Are Valid",
  "GirlCode_Details": "Don't let him convince you that your emotions are wrong or irrational. Feel what you feel."
},
"GirlCode233": {
  "GirlCode_Title": "Don't Accept His Reluctance to Introduce You",
  "GirlCode_Details": "After months, if he hasn't introduced you to important people, you're a secret."
},
"GirlCode234": {
  "GirlCode_Title": "Support Her Journey of Self-Discovery",
  "GirlCode_Details": "Whether it's spiritual growth, career changes, or personal evolution—celebrate her transformation."
},
"GirlCode235": {
  "GirlCode_Title": "Don't Ignore Patterns of Dishonesty",
  "GirlCode_Details": "Small lies today become big lies tomorrow. Address dishonesty immediately."
},
"GirlCode236": {
  "GirlCode_Title": "Know That You're Allowed to Want More",
  "GirlCode_Details": "Wanting commitment, effort, or honesty isn't demanding. It's having standards."
},
"GirlCode237": {
  "GirlCode_Title": "Don't Accept His Need to Control Your Appearance",
  "GirlCode_Details": "Your body, your style, your hair—these are your choices. His opinions don't overrule your autonomy."
},
"GirlCode238": {
  "GirlCode_Title": "Be Her Voice When She's Lost Hers",
  "GirlCode_Details": "If manipulation has silenced her, help her find her voice again."
},
"GirlCode239": {
  "GirlCode_Title": "Don't Ignore When He Isolates You From Friends",
  "GirlCode_Details": "Subtle comments about your friends or making you feel bad for spending time with them is isolation."
},
"GirlCode240": {
  "GirlCode_Title": "Know That Moving On Is an Act of Self-Love",
  "GirlCode_Details": "Letting go of someone who doesn't serve you is the most loving thing you can do for yourself."
},
"GirlCode241": {
  "GirlCode_Title": "Don't Accept His Expectation of Perfection",
  "GirlCode_Details": "You're human. You'll make mistakes. A loving partner accepts your flaws."
},
"GirlCode242": {
  "GirlCode_Title": "Celebrate Her Standing in Her Power",
  "GirlCode_Details": "When she stops seeking validation and starts trusting herself, that's a transformation."
},
"GirlCode243": {
  "GirlCode_Title": "Don't Ignore His Minimization of Your Feelings",
  "GirlCode_Details": "Saying things like 'you're overreacting' or 'it's not that serious' dismisses your valid emotions."
},
"GirlCode244": {
  "GirlCode_Title": "Know That Consistency Is the Bare Minimum",
  "GirlCode_Details": "A man worth having shows up the same way—reliably and intentionally—every single day."
},
"GirlCode245": {
  "GirlCode_Title": "Don't Accept Ultimatums About Your Choices",
  "GirlCode_Details": "Forcing you to choose between him and your dreams, friends, or family is manipulative."
},
"GirlCode246": {
  "GirlCode_Title": "Support Her Creating a Life She Loves",
  "GirlCode_Details": "A life full of purpose, friends, and joy is better than any relationship."
},
"GirlCode247": {
  "GirlCode_Title": "Don't Ignore His Discomfort With Your Independence",
  "GirlCode_Details": "A secure man wants you to have your own life, money, and identity."
},
"GirlCode248": {
  "GirlCode_Title": "Know That You Don't Owe Anyone Your Time",
  "GirlCode_Details": "Saying no to dates, calls, or plans is your right. You don't need to justify it."
},
"GirlCode249": {
  "GirlCode_Title": "Don't Accept His Pressure to Share Everything",
  "GirlCode_Details": "You're allowed to have privacy, secrets, and a life he doesn't need to know about."
},
"GirlCode250": {
  "GirlCode_Title": "Be Her Greatest Advocate and Believer",
  "GirlCode_Details": "When no one else gets it, when she doubts herself—you believe in her completely."
},

    "GirlCode251": {
  "GirlCode_Title": "Don't Accept His Excuses for Being Late",
  "GirlCode_Details": "Chronic lateness shows disrespect for your time. A man who values you will be punctual."
},
"GirlCode252": {
  "GirlCode_Title": "Celebrate Her Reclaiming Her Sexuality",
  "GirlCode_Details": "When she owns her desires and boundaries around sex, that's empowerment. Support that."
},
"GirlCode253": {
  "GirlCode_Title": "Don't Ignore When He Compares Your Body to Exes",
  "GirlCode_Details": "References to his exes' bodies are disrespectful and designed to make you feel insecure."
},
"GirlCode254": {
  "GirlCode_Title": "Know That Settling Is Slow Suicide",
  "GirlCode_Details": "Accepting less than you deserve kills your spirit gradually. Don't do it."
},
"GirlCode255": {
  "GirlCode_Title": "Don't Accept His Dismissal of Your Career Goals",
  "GirlCode_Details": "Your ambitions are valid. A partner should support, not sabotage them."
},
"GirlCode256": {
  "GirlCode_Title": "Be Her Sounding Board Without Judgment",
  "GirlCode_Details": "Let her think out loud, make mistakes in conversation, and explore her feelings safely."
},
"GirlCode257": {
  "GirlCode_Title": "Don't Ignore His Pattern of Blaming You",
  "GirlCode_Details": "If everything is always your fault, that's manipulation and a sign of his immaturity."
},
"GirlCode258": {
  "GirlCode_Title": "Know That You Deserve Someone's Full Attention",
  "GirlCode_Details": "During time together, you shouldn't compete with his phone, friends, or distractions."
},
"GirlCode259": {
  "GirlCode_Title": "Don't Accept His Refusal to Commit to Plans",
  "GirlCode_Details": "If he won't confirm dates in advance, he's leaving you as a backup option."
},
"GirlCode260": {
  "GirlCode_Title": "Support Her Taking a Break From Dating",
  "GirlCode_Details": "Sometimes stepping back from the dating scene is healing. Respect her timeline."
},
"GirlCode261": {
  "GirlCode_Title": "Don't Ignore His Resentment About Your Independence",
  "GirlCode_Details": "Your ability to survive without him should be attractive, not threatening."
},
"GirlCode262": {
  "GirlCode_Title": "Know That Real Love Doesn't Require Proof",
  "GirlCode_Details": "You shouldn't have to constantly validate or convince him of your feelings."
},
"GirlCode263": {
  "GirlCode_Title": "Don't Accept His Disrespect in Front of Others",
  "GirlCode_Details": "How he treats you publicly matters. Humiliation in front of friends is a dealbreaker."
},
"GirlCode264": {
  "GirlCode_Title": "Celebrate Her Saying Goodbye to the Wrong Person",
  "GirlCode_Details": "When she ends it, be her cheerleader. She's choosing herself and that's everything."
},
"GirlCode265": {
  "GirlCode_Title": "Don't Ignore His Financial Irresponsibility Toward You",
  "GirlCode_Details": "If he borrowed money and never repaid it, that's disrespect and shows his character."
},
"GirlCode266": {
  "GirlCode_Title": "Know That Your Intuition About His Infidelity Matters",
  "GirlCode_Details": "If something feels off, investigate. Your gut is usually right."
},
"GirlCode267": {
  "GirlCode_Title": "Don't Accept His Excuses for Not Meeting Your Needs",
  "GirlCode_Details": "His limitations aren't your responsibility. You deserve a partner who can show up."
},
"GirlCode268": {
  "GirlCode_Title": "Be Her Mirror for What's Real",
  "GirlCode_Details": "When she's delusional about him, reflect back the truth she's not seeing."
},
"GirlCode269": {
  "GirlCode_Title": "Don't Ignore When He Disrespects Your Boundaries",
  "GirlCode_Details": "Testing your limits or pushing past your nos is disrespect. Hold firm."
},
"GirlCode270": {
  "GirlCode_Title": "Know That You're Worth More Than Convenience",
  "GirlCode_Details": "Don't let him use you when it's convenient and ignore you when it's not."
},
"GirlCode271": {
  "GirlCode_Title": "Don't Accept His Inability to Handle Conflict",
  "GirlCode_Details": "Running away, shutting down, or getting aggressive during arguments are all avoidance tactics."
},
"GirlCode272": {
  "GirlCode_Title": "Support Her Creating Her Own Traditions",
  "GirlCode_Details": "New rituals, new memories without him—encourage her to build her own beautiful life."
},
"GirlCode273": {
  "GirlCode_Title": "Don't Ignore His Inability to Celebrate You",
  "GirlCode_Details": "A man who can't genuinely celebrate your wins is threatened by your growth."
},
"GirlCode274": {
  "GirlCode_Title": "Know That Compromise Shouldn't Mean Losing Yourself",
  "GirlCode_Details": "Healthy relationships require balance, not your complete surrender."
},
"GirlCode275": {
  "GirlCode_Title": "Don't Accept His Reluctance to Use Protection",
  "GirlCode_Details": "A man who pressures you sexually or avoids protection doesn't respect your body or health."
},
"GirlCode276": {
  "GirlCode_Title": "Celebrate Her Investing in Self-Development",
  "GirlCode_Details": "Books, courses, therapy—when she prioritizes growth, that's the best investment."
},
"GirlCode277": {
  "GirlCode_Title": "Don't Ignore His Disrespect for Your Religion or Beliefs",
  "GirlCode_Details": "Your faith and values are non-negotiable. He should respect them, not mock them."
},
"GirlCode278": {
  "GirlCode_Title": "Know That You Deserve Someone Who's Secure",
  "GirlCode_Details": "A confident man won't need constant reassurance or validation from you."
},
"GirlCode279": {
  "GirlCode_Title": "Don't Accept His Need to Keep You Jealous",
  "GirlCode_Details": "If he flirts with others to make you jealous, that's manipulation and disrespect."
},
"GirlCode280": {
  "GirlCode_Title": "Be Her Safe Space to Vent About Dating",
  "GirlCode_Details": "Let her complain, cry, and process without trying to fix everything immediately."
},
"GirlCode281": {
  "GirlCode_Title": "Don't Ignore His Controlling Behavior Over Your Appearance",
  "GirlCode_Details": "Criticizing your makeup, clothes, or hair is control disguised as opinion."
},
"GirlCode282": {
  "GirlCode_Title": "Know That You Don't Need His Permission to Leave",
  "GirlCode_Details": "Your decision to end things is final. You don't need his approval."
},
"GirlCode283": {
  "GirlCode_Title": "Don't Accept His Expectation That You'll Change",
  "GirlCode_Details": "Love him or leave him—but don't try to become someone else to keep him."
},
"GirlCode284": {
  "GirlCode_Title": "Support Her Being Selfish About Her Happiness",
  "GirlCode_Details": "Choosing herself over a toxic relationship isn't selfish—it's necessary."
},
"GirlCode285": {
  "GirlCode_Title": "Don't Ignore When He Minimizes Your Concerns",
  "GirlCode_Details": "If you bring up an issue and he dismisses it, your concerns don't matter to him."
},
"GirlCode286": {
  "GirlCode_Title": "Know That Chemistry Shouldn't Override Red Flags",
  "GirlCode_Details": "Great sex and spark don't excuse bad behavior or lack of respect."
},
"GirlCode287": {
  "GirlCode_Title": "Don't Accept His Excuses for Being Emotionally Unavailable",
  "GirlCode_Details": "A man who won't open up emotionally can't give you the intimacy you need."
},
"GirlCode288": {
  "GirlCode_Title": "Celebrate Her Understanding Her Own Worth",
  "GirlCode_Details": "When she knows her value and won't settle, that's a powerful transformation."
},
"GirlCode289": {
  "GirlCode_Title": "Don't Ignore His Pattern of Dating Younger Women",
  "GirlCode_Details": "If he consistently dates much younger women, he's seeking control and immaturity."
},
"GirlCode290": {
  "GirlCode_Title": "Know That You Shouldn't Have to Shrink Your Voice",
  "GirlCode_Details": "Speaking up, having opinions, and being heard are your rights in a relationship."
},
"GirlCode291": {
  "GirlCode_Title": "Don't Accept His Disrespect of Your Menstrual Cycle",
  "GirlCode_Details": "Comments about your period or using it against you during conflicts is disrespectful."
},
"GirlCode292": {
  "GirlCode_Title": "Be Her Encouragement to Trust Her Instincts",
  "GirlCode_Details": "When she feels something is wrong, remind her that her gut is protecting her."
},
"GirlCode293": {
  "GirlCode_Title": "Don't Ignore His Obsession With Porn",
  "GirlCode_Details": "If it's affecting your intimacy or his perception of sex, that's a problem worth addressing."
},
"GirlCode294": {
  "GirlCode_Title": "Know That You Deserve Consistency, Not Drama",
  "GirlCode_Details": "A stable, reliable partner is better than an exciting, chaotic one."
},
"GirlCode295": {
  "GirlCode_Title": "Don't Accept His Refusal to Discuss the Future",
  "GirlCode_Details": "After a year, if he won't talk about where this is going, he's avoiding commitment."
},
"GirlCode296": {
  "GirlCode_Title": "Support Her Taking Her Time to Heal",
  "GirlCode_Details": "There's no rush to date again. Let her process at her own pace."
},
"GirlCode297": {
  "GirlCode_Title": "Don't Ignore His Disrespect Toward Mental Health",
  "GirlCode_Details": "If he dismisses therapy or mocks mental illness, he won't support your emotional needs."
},
"GirlCode298": {
  "GirlCode_Title": "Know That You're Allowed to Have Deal-Breakers",
  "GirlCode_Details": "Non-negotiables aren't unreasonable—they're self-protection."
},
"GirlCode299": {
  "GirlCode_Title": "Don't Accept His Expectation of Unconditional Forgiveness",
  "GirlCode_Details": "Forgiveness is earned through changed behavior, not demanded as a right."
},
"GirlCode300": {
  "GirlCode_Title": "Be Her Reminder That She's Enough on Her Own",
  "GirlCode_Details": "A relationship should add to her life, not be her entire life. Remind her of her inherent worth."
},

"GirlCode301": {
  "GirlCode_Title": "Don't Accept His Need to Control Your Social Media",
  "GirlCode_Details": "What you post, who you follow, and how you present yourself online are your choices."
},
"GirlCode302": {
  "GirlCode_Title": "Celebrate Her Unfollowing Men Who Don't Serve Her",
  "GirlCode_Details": "When she removes toxic people from her life, that's growth and self-respect in action."
},
"GirlCode303": {
  "GirlCode_Title": "Don't Ignore His Pattern of Canceling Plans Last-Minute",
  "GirlCode_Details": "Constant cancellations show he doesn't value your time or the relationship."
},
"GirlCode304": {
  "GirlCode_Title": "Know That You Deserve Someone Who Shows Up",
  "GirlCode_Details": "Showing up means physically, emotionally, and mentally being present."
},
"GirlCode305": {
  "GirlCode_Title": "Don't Accept His Disrespect Toward Your Period",
  "GirlCode_Details": "Refusing intimacy because of your cycle or making jokes about it is immaturity."
},
"GirlCode306": {
  "GirlCode_Title": "Be Her Strength When She's Doubting Herself",
  "GirlCode_Details": "Remind her of her accomplishments when imposter syndrome hits."
},
"GirlCode307": {
  "GirlCode_Title": "Don't Ignore When He Rushes Physical Intimacy",
  "GirlCode_Details": "Pushing for sex before you're ready or comfortable is pressure and disrespect."
},
"GirlCode308": {
  "GirlCode_Title": "Know That Your Body Belongs to You Alone",
  "GirlCode_Details": "No one gets access to your body without enthusiastic, continuous consent."
},
"GirlCode309": {
  "GirlCode_Title": "Don't Accept His Attitude That You Owe Him Sex",
  "GirlCode_Details": "Sexual intimacy is a gift, never an obligation or debt."
},
"GirlCode310": {
  "GirlCode_Title": "Support Her Exploring Her Sexuality Safely",
  "GirlCode_Details": "Whether she's discovering new things or setting boundaries, support her autonomy."
},
"GirlCode311": {
  "GirlCode_Title": "Don't Ignore His Disrespect During Intimate Moments",
  "GirlCode_Details": "Comments about your body or pressure during sex crosses boundaries. Stop him immediately."
},
"GirlCode312": {
  "GirlCode_Title": "Know That You Can Say No to Sex Anytime",
  "GirlCode_Details": "Even in a relationship, even mid-act—you can withdraw consent at any moment."
},
"GirlCode313": {
  "GirlCode_Title": "Don't Accept His Attempts to Pressure You Sexually",
  "GirlCode_Details": "Guilt-tripping, pouting, or being manipulative about sex is coercion."
},
"GirlCode314": {
  "GirlCode_Title": "Celebrate Her Sexual Confidence",
  "GirlCode_Details": "When she knows what she wants and asks for it, that's empowerment."
},
"GirlCode315": {
  "GirlCode_Title": "Don't Ignore His Disrespect of Your Sexual History",
  "GirlCode_Details": "Your past partners or sexual experiences aren't his to judge or hold against you."
},
"GirlCode316": {
  "GirlCode_Title": "Know That Foreplay and Aftercare Matter",
  "GirlCode_Details": "A man who rushes or ignores your pleasure doesn't deserve your time."
},
"GirlCode317": {
  "GirlCode_Title": "Don't Accept His Refusal to Discuss Boundaries",
  "GirlCode_Details": "Healthy sex requires communication. If he won't talk about it, that's a red flag."
},
"GirlCode318": {
  "GirlCode_Title": "Be Her Safe Person to Discuss Intimacy",
  "GirlCode_Details": "Let her share her sexual concerns without judgment or gossip."
},
"GirlCode319": {
  "GirlCode_Title": "Don't Ignore When He Ignores Your Pleasure",
  "GirlCode_Details": "Sex should feel good for both of you. If it's only about him, that's selfish."
},
"GirlCode320": {
  "GirlCode_Title": "Know That You Deserve Someone Who Listens",
  "GirlCode_Details": "Whether it's about sex or life—your words and needs should be heard."
},
"GirlCode321": {
  "GirlCode_Title": "Don't Accept His Expectation of Always Being Available",
  "GirlCode_Details": "You have a life, responsibilities, and need for alone time. That's healthy."
},
"GirlCode322": {
  "GirlCode_Title": "Support Her Maintaining Her Hobbies",
  "GirlCode_Details": "Encourage her to keep doing what makes her happy outside the relationship."
},
"GirlCode323": {
  "GirlCode_Title": "Don't Ignore His Resentment of Your Friendships",
  "GirlCode_Details": "A secure man won't be threatened by your close female friendships."
},
"GirlCode324": {
  "GirlCode_Title": "Know That Your Friends' Opinions Matter",
  "GirlCode_Details": "People who love you often see things you're too close to notice."
},
"GirlCode325": {
  "GirlCode_Title": "Don't Accept His Isolation Tactics",
  "GirlCode_Details": "Gradually cutting you off from friends is a classic control mechanism."
},
"GirlCode326": {
  "GirlCode_Title": "Celebrate Her Girls' Nights and Solo Time",
  "GirlCode_Details": "Time with friends or alone recharges her. Protect that space."
},
"GirlCode327": {
  "GirlCode_Title": "Don't Ignore When He Gets Jealous of Your Friends",
  "GirlCode_Details": "Jealousy over friendships is possessiveness, not love."
},
"GirlCode328": {
  "GirlCode_Title": "Know That Your Friendships Are Non-Negotiable",
  "GirlCode_Details": "A man shouldn't make you choose between him and your friends."
},
"GirlCode329": {
  "GirlCode_Title": "Don't Accept His Refusal to Meet Your Friends",
  "GirlCode_Details": "After a reasonable time, if he won't integrate into your social circle, that's telling."
},
"GirlCode330": {
  "GirlCode_Title": "Be Her Consistent Friend Through Everything",
  "GirlCode_Details": "Whether she's in a relationship or single, be the friend who always shows up."
},
"GirlCode331": {
  "GirlCode_Title": "Don't Ignore His Disrespect Toward Your Family",
  "GirlCode_Details": "How he treats your loved ones reveals how much he respects you."
},
"GirlCode332": {
  "GirlCode_Title": "Know That Family Dynamics Matter for the Future",
  "GirlCode_Details": "If he's cruel to his own family, he'll likely be cruel to yours too."
},
"GirlCode333": {
  "GirlCode_Title": "Don't Accept His Attempts to Separate You From Family",
  "GirlCode_Details": "Isolation from family is a control tactic used by abusive partners."
},
"GirlCode334": {
  "GirlCode_Title": "Support Her Having Healthy Family Boundaries",
  "GirlCode_Details": "Setting limits with toxic family members is necessary, not mean."
},
"GirlCode335": {
  "GirlCode_Title": "Don't Ignore His Disrespect Toward Your Parents",
  "GirlCode_Details": "Speaking badly about your mom or dad shows lack of respect for you."
},
"GirlCode336": {
  "GirlCode_Title": "Know That His Family Dynamics Will Impact Your Relationship",
  "GirlCode_Details": "If his family is toxic and he hasn't set boundaries, you'll be dragged into it."
},
"GirlCode337": {
  "GirlCode_Title": "Don't Accept His Refusal to Meet Your Family",
  "GirlCode_Details": "Avoiding your family suggests he's not serious or has something to hide."
},
"GirlCode338": {
  "GirlCode_Title": "Be Her Support When Family Relationships Are Complicated",
  "GirlCode_Details": "Listen without judgment when her family dynamics are messy."
},
"GirlCode339": {
  "GirlCode_Title": "Don't Ignore When He's Critical of Your Family",
  "GirlCode_Details": "Constant criticism of your loved ones is disrespectful to you."
},
"GirlCode340": {
  "GirlCode_Title": "Know That You Don't Have to Choose",
  "GirlCode_Details": "Family or boyfriend—a good man won't force you to pick."
},
"GirlCode341": {
  "GirlCode_Title": "Don't Accept His Attempts to Control Your Money",
  "GirlCode_Details": "Your income, savings, and financial choices are yours alone."
},
"GirlCode342": {
  "GirlCode_Title": "Celebrate Her Financial Independence",
  "GirlCode_Details": "Money in her own name and control is freedom and power."
},
"GirlCode343": {
  "GirlCode_Title": "Don't Ignore His Financial Irresponsibility",
  "GirlCode_Details": "Debt, poor spending habits, or refusal to work affects your future together."
},
"GirlCode344": {
  "GirlCode_Title": "Know That Your Financial Goals Matter",
  "GirlCode_Details": "A partner should support your financial independence, not hinder it."
},
"GirlCode345": {
  "GirlCode_Title": "Don't Accept His Disrespect Toward Your Career",
  "GirlCode_Details": "Your job, income, and professional achievements deserve respect and support."
},
"GirlCode346": {
  "GirlCode_Title": "Be Her Cheerleader for Career Wins",
  "GirlCode_Details": "Promotions, new jobs, raises—celebrate her professional growth."
},
"GirlCode347": {
  "GirlCode_Title": "Don't Ignore His Expectation That You'll Sacrifice Your Career",
  "GirlCode_Details": "A healthy relationship doesn't require you to give up your professional dreams."
},
"GirlCode348": {
  "GirlCode_Title": "Know That You Shouldn't Have to Choose Between Love and Success",
  "GirlCode_Details": "A man worth having will support your ambitions, not resent them."
},
"GirlCode349": {
  "GirlCode_Title": "Don't Accept His Attempts to Make You Financially Dependent",
  "GirlCode_Details": "Financial dependence is a tool for control. Keep your own income and accounts."
},
"GirlCode350": {
  "GirlCode_Title": "Support Her Investing in Her Career",
  "GirlCode_Details": "Whether it's training, education, or side hustles—encourage her professional growth."
},
"GirlCode351": {
  "GirlCode_Title": "Don't Ignore When He Undermines Your Professional Competence",
  "GirlCode_Details": "Suggesting you're not good at your job or can't handle it is disrespect and manipulation."
},
"GirlCode352": {
  "GirlCode_Title": "Know That Your Paycheck Isn't His to Dictate",
  "GirlCode_Details": "How you spend your earned money is entirely your business."
},
"GirlCode353": {
  "GirlCode_Title": "Don't Accept His Resentment Toward Your Success",
  "GirlCode_Details": "If he's jealous or angry about your achievements, that's insecurity masquerading as love."
},
"GirlCode354": {
  "GirlCode_Title": "Be Her Witness to Her Professional Evolution",
  "GirlCode_Details": "Watch her grow in her career and remind her how far she's come."
},
"GirlCode355": {
  "GirlCode_Title": "Don't Ignore His Disrespect Toward Your Education",
  "GirlCode_Details": "Mocking your degree, intelligence, or educational goals is belittling."
},
"GirlCode356": {
  "GirlCode_Title": "Know That Your Intelligence Is Attractive",
  "GirlCode_Details": "A secure man is turned on by your competence, not threatened by it."
},
"GirlCode357": {
  "GirlCode_Title": "Don't Accept His Attempts to Make You Feel Stupid",
  "GirlCode_Details": "Correcting you constantly or making you feel dumb is emotional abuse."
},
"GirlCode358": {
  "GirlCode_Title": "Support Her Continuing Her Education",
  "GirlCode_Details": "Whether it's a degree, certification, or personal learning—encourage her growth."
},
"GirlCode359": {
  "GirlCode_Title": "Don't Ignore His Disinterest in Your Thoughts",
  "GirlCode_Details": "A man who doesn't engage with your ideas or opinions doesn't truly value you."
},
"GirlCode360": {
  "GirlCode_Title": "Know That Your Voice Deserves to Be Heard",
  "GirlCode_Details": "In conversations, decisions, and life—your opinions matter equally."
},
"GirlCode361": {
  "GirlCode_Title": "Don't Accept His Dismissal of Your Feelings as 'Emotional'",
  "GirlCode_Details": "Having emotions isn't a weakness. It's human, and it deserves respect."
},
"GirlCode362": {
  "GirlCode_Title": "Celebrate Her Expressing Her Emotions Freely",
  "GirlCode_Details": "When she cries, gets angry, or laughs—let her feel without judgment."
},
"GirlCode363": {
  "GirlCode_Title": "Don't Ignore When He Uses Your Emotions Against You",
  "GirlCode_Details": "Calling you crazy, dramatic, or emotional to dismiss your valid concerns is gaslighting."
},
"GirlCode364": {
  "GirlCode_Title": "Know That Your Emotions Are Valid",
  "GirlCode_Details": "What you feel is real and deserves to be acknowledged."
},
"GirlCode365": {
  "GirlCode_Title": "Don't Accept His Refusal to Acknowledge Your Feelings",
  "GirlCode_Details": "A partner should validate your emotions, even if he doesn't fully understand them."
},
"GirlCode366": {
  "GirlCode_Title": "Be Her Safe Space to Feel Everything",
  "GirlCode_Details": "Let her cry, rage, laugh, and process without trying to fix it."
},
"GirlCode367": {
  "GirlCode_Title": "Don't Ignore His Mockery of Your Emotions",
  "GirlCode_Details": "Laughing at your feelings or making fun of how you express them is cruel."
},
"GirlCode368": {
  "GirlCode_Title": "Know That Your Sensitivities Aren't Flaws",
  "GirlCode_Details": "Being sensitive, empathetic, or intuitive are strengths, not weaknesses."
},
"GirlCode369": {
  "GirlCode_Title": "Don't Accept His Pressure to Suppress Your Emotions",
  "GirlCode_Details": "A healthy partner won't ask you to stop feeling or become 'less emotional.'"
},
"GirlCode370": {
  "GirlCode_Title": "Support Her Emotional Intelligence",
  "GirlCode_Details": "Encourage her to understand, name, and process her emotions healthily."
},
"GirlCode371": {
  "GirlCode_Title": "Don't Ignore When He Weaponizes Your Vulnerabilities",
  "GirlCode_Details": "Using things you confided in him against you is betrayal and abuse."
},
"GirlCode372": {
  "GirlCode_Title": "Know That Trust Is Earned Through Consistency",
  "GirlCode_Details": "A man who respects what you share will protect it, not weaponize it."
},
"GirlCode373": {
  "GirlCode_Title": "Don't Accept His Disrespect of Your Vulnerabilities",
  "GirlCode_Details": "When you open up, he should hold that trust carefully and kindly."
},
"GirlCode374": {
  "GirlCode_Title": "Be Her Keeper of Secrets",
  "GirlCode_Details": "What she confides in you stays with you. Loyalty means protecting her vulnerability."
},
"GirlCode375": {
  "GirlCode_Title": "Don't Ignore When He Shares Your Secrets",
  "GirlCode_Details": "Gossiping about private things you told him is a betrayal of trust."
},
"GirlCode376": {
  "GirlCode_Title": "Know That Vulnerability Is a Gift",
  "GirlCode_Details": "When he opens up emotionally, that shows trust. Respect that."
},
"GirlCode377": {
  "GirlCode_Title": "Don't Accept His Use of Your Vulnerabilities Against You",
  "GirlCode_Details": "A man who uses your insecurities to hurt or control you is emotionally abusive."
},
"GirlCode378": {
  "GirlCode_Title": "Support Her Setting Boundaries on Vulnerability",
  "GirlCode_Details": "She can be open while still protecting her peace. Healthy vulnerability has limits."
},
"GirlCode379": {
  "GirlCode_Title": "Don't Ignore His Pattern of Breaking Confidentiality",
  "GirlCode_Details": "If he's shared your secrets with others, he's shown you he can't be trusted."
},
"GirlCode380": {
  "GirlCode_Title": "Know That You Deserve Someone Trustworthy",
  "GirlCode_Details": "A partner should be your safe person, your confidant, your sanctuary."
},
"GirlCode381": {
  "GirlCode_Title": "Don't Accept His Gaslighting About Your Reality",
  "GirlCode_Details": "If he denies things that happened, you're not going crazy—he's manipulating you."
},
"GirlCode382": {
  "GirlCode_Title": "Celebrate Her Trusting Her Memory",
  "GirlCode_Details": "When she stops doubting herself and trusts her recollection, that's empowerment."
},
"GirlCode383": {
  "GirlCode_Title": "Don't Ignore When He Questions Your Sanity",
  "GirlCode_Details": "Suggesting you're crazy, paranoid, or irrational to avoid accountability is abuse."
},
"GirlCode384": {
  "GirlCode_Title": "Know That Your Reality Is Valid",
  "GirlCode_Details": "What you experience, witness, and remember is real. Don't let him rewrite it."
},
"GirlCode385": {
  "GirlCode_Title": "Don't Accept His Version of Events Over Yours",
  "GirlCode_Details": "If there's a conflict about what happened, hear him out but trust yourself."
},
"GirlCode386": {
  "GirlCode_Title": "Be Her Validator When She Questions Herself",
  "GirlCode_Details": "Remind her of what actually happened when gaslighting makes her doubt reality."
},
"GirlCode387": {
  "GirlCode_Title": "Don't Ignore His Subtle Rewrites of Events",
  "GirlCode_Details": "Small corrections or his version becoming 'the truth' is a slippery slope to gaslighting."
},
"GirlCode388": {
  "GirlCode_Title": "Know That Gaslighting Is Abuse",
  "GirlCode_Details": "It's psychological manipulation designed to make you question your sanity. It's a dealbreaker."
},
"GirlCode389": {
  "GirlCode_Title": "Don't Accept His Dismissal of Your Experiences",
  "GirlCode_Details": "Your life, your stories, and your experiences are valid and deserve respect."
},
"GirlCode390": {
  "GirlCode_Title": "Support Her Standing Firm in Her Truth",
  "GirlCode_Details": "When she stops allowing her reality to be negotiated, that's strength."
},
"GirlCode391": {
  "GirlCode_Title": "Don't Ignore His Pattern of Inconsistency",
  "GirlCode_Details": "Constantly changing his story or denying he said something is deliberate confusion."
},
"GirlCode392": {
  "GirlCode_Title": "Know That You're Not Overreacting",
  "GirlCode_Details": "Trust your gut when something feels off. Your reaction is usually proportional."
},
"GirlCode393": {
  "GirlCode_Title": "Don't Accept His Excuses for Contradicting Himself",
  "GirlCode_Details": "If he constantly says one thing then does another, he's showing you who he is."
},
"GirlCode394": {
  "GirlCode_Title": "Be Her Reality Check When She's Confused",
  "GirlCode_Details": "Use facts and timeline to help her see through the fog of gaslighting."
},
"GirlCode395": {
  "GirlCode_Title": "Don't Ignore His Need to Always Be Right",
  "GirlCode_Details": "A man who can't admit he's wrong or apologize has a character flaw."
},
"GirlCode396": {
  "GirlCode_Title": "Know That Flexibility Is a Sign of Maturity",
  "GirlCode_Details": "A man secure enough to be wrong and admit it is rare and valuable."
},
"GirlCode397": {
  "GirlCode_Title": "Don't Accept His Competitive Energy in Conversations",
  "GirlCode_Details": "Some men turn conversations into debates to 'win.' That's exhausting and disrespectful."
},
"GirlCode398": {
  "GirlCode_Title": "Support Her Choosing Peace Over Being Right",
  "GirlCode_Details": "Sometimes agreeing to disagree or letting it go is the healthier choice."
},
"GirlCode399": {
  "GirlCode_Title": "Don't Ignore His Inability to Accept Criticism",
  "GirlCode_Details": "If he can't hear feedback without defensiveness, he won't grow or improve."
},
"GirlCode400": {
  "GirlCode_Title": "Know That You Deserve Someone Humble",
  "GirlCode_Details": "A man who can admit mistakes, learn, and improve is someone worth keeping."
},

"GirlCode401": {
  "GirlCode_Title": "Don't Accept His Refusal to Apologize Sincerely",
  "GirlCode_Details": "A real apology includes accountability, not excuses or deflection."
},
"GirlCode402": {
  "GirlCode_Title": "Celebrate Her Setting Consequences",
  "GirlCode_Details": "When she stops tolerating disrespect and actually follows through with boundaries, that's power."
},
"GirlCode403": {
  "GirlCode_Title": "Don't Ignore His Pattern of 'Forgetting' Important Dates",
  "GirlCode_Details": "Consistently forgetting your birthday, anniversary, or important events shows lack of care."
},
"GirlCode404": {
  "GirlCode_Title": "Know That Remembering Matters",
  "GirlCode_Details": "A man who cares will remember what matters to you without being reminded."
},
"GirlCode405": {
  "GirlCode_Title": "Don't Accept His Last-Minute Gift-Giving",
  "GirlCode_Details": "Thoughtless or rushed gifts show he didn't prioritize celebrating you."
},
"GirlCode406": {
  "GirlCode_Title": "Be Her Reminder That She's Worth Celebrating",
  "GirlCode_Details": "Make sure she knows her milestones matter, even if he forgets."
},
"GirlCode407": {
  "GirlCode_Title": "Don't Ignore When He Makes Plans and Cancels",
  "GirlCode_Details": "A pattern of cancellations shows you're not a priority."
},
"GirlCode408": {
  "GirlCode_Title": "Know That Reliability Is Attractive",
  "GirlCode_Details": "A man who follows through on what he says builds trust and security."
},
"GirlCode409": {
  "GirlCode_Title": "Don't Accept His Excuses for Not Planning Dates",
  "GirlCode_Details": "After months together, he should be initiating romantic plans, not just showing up."
},
"GirlCode410": {
  "GirlCode_Title": "Support Her Planning Her Own Life",
  "GirlCode_Details": "She shouldn't have to organize everything. A partner shares the planning."
},
"GirlCode411": {
  "GirlCode_Title": "Don't Ignore His Disrespect During Your Achievements",
  "GirlCode_Details": "When you succeed, he should celebrate, not downplay or make it about him."
},
"GirlCode412": {
  "GirlCode_Title": "Know That Your Wins Are Yours to Own",
  "GirlCode_Details": "Don't let him steal your joy or diminish your accomplishments."
},
"GirlCode413": {
  "GirlCode_Title": "Don't Accept His Need to Be the Center of Attention",
  "GirlCode_Details": "A secure man can celebrate you without making it about himself."
},
"GirlCode414": {
  "GirlCode_Title": "Celebrate Her Owning Her Successes",
  "GirlCode_Details": "Whether big or small, every win deserves acknowledgment and celebration."
},
"GirlCode415": {
  "GirlCode_Title": "Don't Ignore His Attempts to Undermine Your Confidence",
  "GirlCode_Details": "Comments designed to make you doubt yourself are intentional sabotage."
},
"GirlCode416": {
  "GirlCode_Title": "Know That Your Confidence Is Magnetic",
  "GirlCode_Details": "A man threatened by your self-assurance isn't worth your time."
},
"GirlCode417": {
  "GirlCode_Title": "Don't Accept His Backhanded Compliments",
  "GirlCode_Details": "'You're pretty for your size' or similar insults disguised as compliments are disrespectful."
},
"GirlCode418": {
  "GirlCode_Title": "Be Her Affirmer When She's Doubting Her Worth",
  "GirlCode_Details": "Remind her of her value when her confidence wavers."
},
"GirlCode419": {
  "GirlCode_Title": "Don't Ignore His Pattern of Putting You Down",
  "GirlCode_Details": "Consistent criticism is erosion of self-esteem. It's abuse."
},
"GirlCode420": {
  "GirlCode_Title": "Know That You Don't Deserve to Feel Small",
  "GirlCode_Details": "A good relationship makes you feel bigger, not smaller."
},
"GirlCode421": {
  "GirlCode_Title": "Don't Accept His Attempts to Control Your Appearance",
  "GirlCode_Details": "Telling you what to wear, how to do your hair, or criticizing your style is control."
},
"GirlCode422": {
  "GirlCode_Title": "Support Her Experimenting With Her Style",
  "GirlCode_Details": "Encourage her to express herself through fashion, makeup, and presentation."
},
"GirlCode423": {
  "GirlCode_Title": "Don't Ignore His Disapproval of How You Dress",
  "GirlCode_Details": "Your body, your choice. His approval isn't required for your wardrobe."
},
"GirlCode424": {
  "GirlCode_Title": "Know That Your Body Belongs to You",
  "GirlCode_Details": "Dress how you want, style yourself how you want. Your autonomy is non-negotiable."
},
"GirlCode425": {
  "GirlCode_Title": "Don't Accept His Comments About Your Weight",
  "GirlCode_Details": "Negative comments about your body are disrespectful and hurtful."
},
"GirlCode426": {
  "GirlCode_Title": "Be Her Protector Against Body Shaming",
  "GirlCode_Details": "Never let anyone, including him, shame her body. Stand up for her."
},
"GirlCode427": {
  "GirlCode_Title": "Don't Ignore His Obsession With Your Physical Appearance",
  "GirlCode_Details": "If he constantly comments on or fixates on how you look, that's shallow and controlling."
},
"GirlCode428": {
  "GirlCode_Title": "Know That You're More Than Your Looks",
  "GirlCode_Details": "A man who only values your appearance doesn't truly value you."
},
"GirlCode429": {
  "GirlCode_Title": "Don't Accept His Pressure to Change Your Appearance",
  "GirlCode_Details": "Whether it's your hair, weight, or style—your body is your choice."
},
"GirlCode430": {
  "GirlCode_Title": "Support Her Loving Her Body as It Is",
  "GirlCode_Details": "Encourage body positivity and acceptance, regardless of size or shape."
},
"GirlCode431": {
  "GirlCode_Title": "Don't Ignore When He Comments on Other Women's Bodies",
  "GirlCode_Details": "Objectifying other women shows disrespect for women as a whole, including you."
},
"GirlCode432": {
  "GirlCode_Title": "Know That A Good Man Doesn't Ogle",
  "GirlCode_Details": "A secure man doesn't point out or comment on other women's bodies to you."
},
"GirlCode433": {
  "GirlCode_Title": "Don't Accept His Comparison of Your Body to Others",
  "GirlCode_Details": "Comparing you to other women is designed to make you feel insecure."
},
"GirlCode434": {
  "GirlCode_Title": "Be Her Reminder That Comparison Is Theft",
  "GirlCode_Details": "Help her see that comparing her body to anyone else steals her peace."
},
"GirlCode435": {
  "GirlCode_Title": "Don't Ignore His Fixation on Pornography",
  "GirlCode_Details": "If it's affecting his perception of real women or your intimacy, that's a problem."
},
"GirlCode436": {
  "GirlCode_Title": "Know That Your Body Is Enough",
  "GirlCode_Details": "You don't need to look like anyone else or perform like pornography."
},
"GirlCode437": {
  "GirlCode_Title": "Don't Accept His Expectations Based on Unrealistic Media",
  "GirlCode_Details": "If he expects you to look like filtered photos or edited videos, that's unrealistic and disrespectful."
},
"GirlCode438": {
  "GirlCode_Title": "Support Her Rejecting Impossible Standards",
  "GirlCode_Details": "Help her see through unrealistic beauty standards and media manipulation."
},
"GirlCode439": {
  "GirlCode_Title": "Don't Ignore His Disrespect During Your Vulnerabilities",
  "GirlCode_Details": "If you cry or show weakness and he mocks you, that's cruelty."
},
"GirlCode440": {
  "GirlCode_Title": "Know That Crying Is Not Weakness",
  "GirlCode_Details": "Emotional expression is human. A man who respects you won't mock it."
},
"GirlCode441": {
  "GirlCode_Title": "Don't Accept His Mocking of Your Pain",
  "GirlCode_Details": "Making fun of things that hurt you is cruel and disrespectful."
},
"GirlCode442": {
  "GirlCode_Title": "Be Her Comfort When She's Hurting",
  "GirlCode_Details": "Hold space for her pain without trying to minimize or fix it immediately."
},
"GirlCode443": {
  "GirlCode_Title": "Don't Ignore His Lack of Empathy",
  "GirlCode_Details": "A man who can't feel for your pain or understand your struggles is emotionally unavailable."
},
"GirlCode444": {
  "GirlCode_Title": "Know That Empathy Matters in Love",
  "GirlCode_Details": "The ability to understand and share in your feelings is essential for deep connection."
},
"GirlCode445": {
  "GirlCode_Title": "Don't Accept His Dismissal of Your Struggles",
  "GirlCode_Details": "When you're going through something hard, he should listen and support, not minimize."
},
"GirlCode446": {
  "GirlCode_Title": "Support Her Processing Her Trauma",
  "GirlCode_Details": "If she's working through past hurt, be patient and supportive."
},
"GirlCode447": {
  "GirlCode_Title": "Don't Ignore His Unwillingness to Listen",
  "GirlCode_Details": "If he's always on his phone or rushing conversations, he's not truly present."
},
"GirlCode448": {
  "GirlCode_Title": "Know That Being Heard Is Basic",
  "GirlCode_Details": "Your partner should listen to you, ask follow-up questions, and remember what matters to you."
},
"GirlCode449": {
  "GirlCode_Title": "Don't Accept His Interruption of Your Stories",
  "GirlCode_Details": "Let you finish. Don't steal the microphone or make everything about him."
},
"GirlCode450": {
  "GirlCode_Title": "Be Her Attentive Listener",
  "GirlCode_Details": "Put down your phone, make eye contact, and truly listen when she talks."
},
"GirlCode451": {
  "GirlCode_Title": "Don't Ignore His One-Sided Conversations",
  "GirlCode_Details": "If it's always about him and never about you, the relationship is imbalanced."
},
"GirlCode452": {
  "GirlCode_Title": "Know That Reciprocity Matters",
  "GirlCode_Details": "Conversations should flow both ways. Both of you should share and be heard."
},
"GirlCode453": {
  "GirlCode_Title": "Don't Accept His Attempts to Change the Subject",
  "GirlCode_Details": "When you bring up concerns, he shouldn't deflect to other topics."
},
"GirlCode454": {
  "GirlCode_Title": "Support Her Speaking Her Truth",
  "GirlCode_Details": "When she voices concerns or needs, encourage her to be heard."
},
"GirlCode455": {
  "GirlCode_Title": "Don't Ignore His Avoidance of Difficult Conversations",
  "GirlCode_Details": "Running away from conflict means problems never get solved."
},
"GirlCode456": {
  "GirlCode_Title": "Know That Communication Is the Foundation",
  "GirlCode_Details": "A relationship without open dialogue will eventually crumble."
},
"GirlCode457": {
  "GirlCode_Title": "Don't Accept His Stonewalling",
  "GirlCode_Details": "The silent treatment is a form of punishment and control. Don't accept it."
},
"GirlCode458": {
  "GirlCode_Title": "Be Her Advocate for Healthy Communication",
  "GirlCode_Details": "Help her see when patterns of avoidance are hurting the relationship."
},
"GirlCode459": {
  "GirlCode_Title": "Don't Ignore His Yelling or Aggressive Tone",
  "GirlCode_Details": "Raising his voice, getting aggressive, or intimidating you is abuse."
},
"GirlCode460": {
  "GirlCode_Title": "Know That You Shouldn't Fear Your Partner",
  "GirlCode_Details": "Love shouldn't include fear of his anger or reactions."
},
"GirlCode461": {
  "GirlCode_Title": "Don't Accept His Aggressive Communication",
  "GirlCode_Details": "Screaming, name-calling, or threatening is never okay in a relationship."
},
"GirlCode462": {
  "GirlCode_Title": "Support Her Leaving Aggressive Relationships",
  "GirlCode_Details": "If he's scary or aggressive, leaving is the right choice. Protect her."
},
"GirlCode463": {
  "GirlCode_Title": "Don't Ignore His Pattern of Blaming You for His Anger",
  "GirlCode_Details": "'You made me angry' is manipulation. His anger is his responsibility."
},
"GirlCode464": {
  "GirlCode_Title": "Know That You're Not Responsible for His Emotions",
  "GirlCode_Details": "You can't control his anger. He needs to manage his own reactions."
},
"GirlCode465": {
  "GirlCode_Title": "Don't Accept His Disrespect When He's Upset",
  "GirlCode_Details": "Even when angry, he should speak to you respectfully."
},
"GirlCode466": {
  "GirlCode_Title": "Be Her Safe Space During Conflicts",
  "GirlCode_Details": "Help her process relationship arguments without judgment."
},
"GirlCode467": {
  "GirlCode_Title": "Don't Ignore His Pattern of Escalating Arguments",
  "GirlCode_Details": "If disagreements consistently turn into big fights, that's a dysfunction to address."
},
"GirlCode468": {
  "GirlCode_Title": "Know That Healthy Couples Disagree Respectfully",
  "GirlCode_Details": "Arguments should be about solving problems, not winning or hurting."
},
"GirlCode469": {
  "GirlCode_Title": "Don't Accept His Bringing Up Old Issues",
  "GirlCode_Details": "Dragging up past mistakes during new conflicts is unfair and derails resolution."
},
"GirlCode470": {
  "GirlCode_Title": "Support Her Staying Grounded During Arguments",
  "GirlCode_Details": "Teach her to focus on current issues and not get dragged into old wounds."
},
"GirlCode471": {
  "GirlCode_Title": "Don't Ignore His Refusal to Take Breaks",
  "GirlCode_Details": "If he won't pause an argument when emotions are high, nothing gets resolved."
},
"GirlCode472": {
  "GirlCode_Title": "Know That Time-Outs During Arguments Help",
  "GirlCode_Details": "Taking space to cool down, then coming back to talk, leads to better solutions."
},
"GirlCode473": {
  "GirlCode_Title": "Don't Accept His Use of Divorce or Breaking Up as a Threat",
  "GirlCode_Details": "Using threats to leave as a weapon to control you is manipulation."
},
"GirlCode474": {
  "GirlCode_Title": "Be Her Supporter When She's Processing a Breakup",
  "GirlCode_Details": "Be present, be consistent, be her rock."
},
"GirlCode475": {
  "GirlCode_Title": "Don't Ignore His Pattern of Threatening to Leave",
  "GirlCode_Details": "If he's always threatening to walk out, he's using fear to control you."
},
"GirlCode476": {
  "GirlCode_Title": "Know That Real Breakups Happen or Don't",
  "GirlCode_Details": "Constant threats but never following through is emotional manipulation."
},
"GirlCode477": {
  "GirlCode_Title": "Don't Accept His Ultimatums",
  "GirlCode_Details": "'Do this or I'll leave' is coercion, not compromise."
},
"GirlCode478": {
  "GirlCode_Title": "Support Her Standing Up to Ultimatums",
  "GirlCode_Details": "When he issues ultimatums, she has the right to choose her own path."
},
"GirlCode479": {
  "GirlCode_Title": "Don't Ignore His Disrespect Toward Your Healing",
  "GirlCode_Details": "If you're in therapy or healing and he mocks it, that's unsupportive."
},
"GirlCode480": {
  "GirlCode_Title": "Know That Your Mental Health Comes First",
  "GirlCode_Details": "Therapy, medication, meditation—prioritize your healing over appeasing him."
},
"GirlCode481": {
  "GirlCode_Title": "Don't Accept His Attempts to Isolate You From Help",
  "GirlCode_Details": "Discouraging therapy, doctors, or support systems is abusive."
},
"GirlCode482": {
  "GirlCode_Title": "Be Her Cheerleader for Getting Help",
  "GirlCode_Details": "When she seeks therapy or support, celebrate that she's prioritizing herself."
},
"GirlCode483": {
  "GirlCode_Title": "Don't Ignore His Resistance to You Getting Help",
  "GirlCode_Details": "A secure man supports your mental health journey, not resists it."
},
"GirlCode484": {
  "GirlCode_Title": "Know That Professional Help Is Never Wrong",
  "GirlCode_Details": "Therapy isn't a sign of weakness—it's a sign of wisdom."
},
"GirlCode485": {
  "GirlCode_Title": "Don't Accept His Judgment of Your Mental Health",
  "GirlCode_Details": "Anxiety, depression, or other conditions aren't character flaws. They deserve compassion."
},
"GirlCode486": {
  "GirlCode_Title": "Support Her Mental Health Journey",
  "GirlCode_Details": "Whether it's meds, therapy, or coping strategies—support her fully."
},
"GirlCode487": {
  "GirlCode_Title": "Don't Ignore His Disrespect During Your Illness",
  "GirlCode_Details": "If you're sick or struggling and he's unsupportive or resentful, that's cruel."
},
"GirlCode488": {
  "GirlCode_Title": "Know That You Deserve Care When Struggling",
  "GirlCode_Details": "A partner should be there for you during difficult times, not absent."
},
"GirlCode489": {
  "GirlCode_Title": "Don't Accept His Resentment of Your Needs",
  "GirlCode_Details": "If you need support and he makes you feel like a burden, that's disrespect."
},
"GirlCode490": {
  "GirlCode_Title": "Be Her Caregiver When She's Vulnerable",
  "GirlCode_Details": "Show up with meals, company, and support during her struggles."
},
"GirlCode491": {
  "GirlCode_Title": "Don't Ignore His Refusal to Help When You're in Crisis",
  "GirlCode_Details": "In emergencies, a caring partner shows up. If he disappears, he's not reliable."
},
"GirlCode492": {
  "GirlCode_Title": "Know That Love Shows Up in Hard Times",
  "GirlCode_Details": "How he treats you during crisis reveals his true character."
},
"GirlCode493": {
  "GirlCode_Title": "Don't Accept His Disrespect During Grief",
  "GirlCode_Details": "If you're grieving a loss and he's impatient or unsupportive, that's cruelty."
},
"GirlCode494": {
  "GirlCode_Title": "Support Her Processing Grief",
  "GirlCode_Details": "Loss takes time. Be patient with her as she processes and heals."
},
"GirlCode495": {
  "GirlCode_Title": "Don't Ignore His Pressure to Move Forward Too Fast",
  "GirlCode_Details": "After a loss or trauma, grief has no timeline. Don't let him rush you."
},
"GirlCode496": {
  "GirlCode_Title": "Know That Your Timeline for Healing Is Valid",
  "GirlCode_Details": "Take as long as you need. Don't rush recovery for anyone."
},
"GirlCode497": {
  "GirlCode_Title": "Don't Accept His Dismissal of Your Past Trauma",
  "GirlCode_Details": "Your history matters. A compassionate partner will acknowledge and respect it."
},
"GirlCode498": {
  "GirlCode_Title": "Be Her Witness and Validator",
  "GirlCode_Details": "Acknowledge what she's been through without needing her to be over it."
},
"GirlCode499": {
  "GirlCode_Title": "Don't Ignore His Refusal to Understand Your Triggers",
  "GirlCode_Details": "If your trauma has triggers, a caring partner will learn and respect them."
},
"GirlCode500": {
  "GirlCode_Title": "Know That You Deserve Someone Patient",
  "GirlCode_Details": "Healing from trauma takes time. A good man will support that journey."
}








    

  }
}
