{
  "GirlsCode_DataBase": {
    "GirlCode1": {
      "GirlCode_Title": "Never Date Your Bestie's Ex",
      "GirlCode_Details": "This is the golden rule of girl code. When your friend tells you about her ex or someone she dated, that person becomes off-limits. It doesn't matter how much time has passed or how perfect they seem—your friendship is worth more than any romantic interest. The seriousness of their relationship determines the waiting period, but generally, exes are permanently off the table. If you find yourself catching feelings for a friend's ex, have an honest conversation with your bestie first. She deserves to know, and respecting her feelings shows that you value your friendship above all else. Remember: there are plenty of other people out there, but true friends are irreplaceable."
    },
    "GirlCode2": {
      "GirlCode_Title": "Keep Her Secrets Sacred",
      "GirlCode_Details": "When your bestie confides in you, those secrets stay between you two—no exceptions. Whether she's sharing about a crush, an embarrassing moment, or personal struggles, keeping her confidence is non-negotiable. Don't share with your partner, other friends, or anyone else unless you have explicit permission. Before spreading any information, ask yourself: would I want this shared if I were in her position? The trust you build through keeping secrets is the foundation of a strong friendship. If she wanted others to know, she would tell them herself. Protecting her privacy shows respect and loyalty."
    },
    "GirlCode3": {
      "GirlCode_Title": "Be Honest, Even When It Hurts",
      "GirlCode_Details": "Real friends tell the truth, even when it's uncomfortable. If your bestie asks for your opinion on her outfit, her new relationship, or a major life decision, give her your honest thoughts. Sugar-coating everything might seem kinder in the moment, but it doesn't help her grow or make better choices. The key is delivering honesty with love and good intentions—not being cruel or judgmental. When she asks if that dress looks good, tell her the truth. When you see red flags in her relationship, speak up. She might not want to hear it right away, but she'll appreciate your honesty later. True friendship means caring enough to say the hard things."
    },
    "GirlCode4": {
      "GirlCode_Title": "Tell Her If Her Partner Cheats",
      "GirlCode_Details": "If you discover that your friend's partner has been unfaithful or has done something seriously wrong, you have a responsibility to tell her. This is one of the hardest girl code rules to follow because you know it will hurt her. However, she deserves to know the truth so she can make informed decisions about her relationship. Don't let her be the last to know or find out from someone else. Approach the conversation with sensitivity and evidence if possible. Let her process the information in her own time and be there to support her through whatever decision she makes. It's better for her to hear it from someone who loves her than to discover it later and realize her friends knew all along."
    },
    "GirlCode5": {
      "GirlCode_Title": "Never Let a Guy Come Between You",
      "GirlCode_Details": "No romantic interest is worth losing a genuine friendship over. When conflicts arise between your friendship and a relationship, remember that boyfriends may come and go, but true friends are forever. If you find yourself constantly choosing a guy over your bestie, take a step back and reassess your priorities. Sisters before misters isn't just a catchy phrase—it's a reminder that female friendships are valuable and shouldn't be abandoned for romantic relationships. Make time for your friends even when you're in a relationship. Don't ditch plans with your bestie because a guy asked you out. A healthy relationship should enhance your life, not replace the important people in it."
    },
    "GirlCode6": {
      "GirlCode_Title": "Rescue Her From Creepy Situations",
      "GirlCode_Details": "If you see any girl—friend or stranger—looking uncomfortable with someone hitting on her, step in and help. Create an excuse to pull her away, pretend you know her, or simply ask if she's okay. This code applies to everyone, not just your close friends. Women should look out for each other, especially in potentially dangerous situations. If you notice someone giving her unwanted attention at a bar, club, or party, be the person who intervenes. A simple 'Hey girl, we need to go!' can save someone from a terrible situation. Don't hesitate to be bold—her safety is more important than being polite or not wanting to cause a scene."
    },
    "GirlCode7": {
      "GirlCode_Title": "Share the Spotlight",
      "GirlCode_Details": "Never put your friend down to make yourself look better, especially in front of guys. When you're together, you should both shine equally. Celebrate her wins as if they were your own and lift her up in social situations. If someone compliments you, redirect some of that attention to your friend and highlight her amazing qualities too. Don't compete for male attention or try to outshine each other—you're there to support one another, not to be rivals. Real friends build each other up and create opportunities for both to be seen and appreciated. The spotlight is big enough for everyone, and secure women help their friends shine."
    },
    "GirlCode8": {
      "GirlCode_Title": "Support Her Decisions Unconditionally",
      "GirlCode_Details": "Even when you don't agree with your friend's choices, provide unconditional support unless she's in danger. She needs to know that you're in her corner no matter what. Sometimes friends need to vent, and your job is to listen and validate their feelings without judgment. If she wants to text her ex, take that job across the country, or dye her hair blue, be supportive. Offer your honest opinion when asked, but respect that it's her life and her decision to make. The only exception is when her choices break another girl code or put her in harm's way. Otherwise, trust that she knows what's best for herself and be the friend who cheers her on through everything."
    },
    "GirlCode9": {
      "GirlCode_Title": "Crushes Are Off-Limits Too",
      "GirlCode_Details": "When your friend tells you about her crush, that person automatically becomes off-limits to you. Even if they're not dating yet, even if her crush doesn't know she exists, you don't pursue someone your friend has feelings for. This shows respect for her emotions and proves that your friendship matters more than a potential romance. If the person shows interest in you instead, have a conversation with your friend before making any moves. In many cases, the right thing to do is decline and protect your friendship. There are countless people to date in this world—don't choose the one person who could damage your friendship. Respecting boundaries around crushes prevents jealousy, competition, and hurt feelings."
    },
    "GirlCode10": {
      "GirlCode_Title": "Breaking Girl Code Requires an Apology",
      "GirlCode_Details": "Nobody's perfect, and sometimes you'll mess up and break girl code. The key is recognizing when you've violated these rules and offering a genuine apology. Breaking girl code doesn't automatically end a friendship, but refusing to acknowledge it and apologize does. If you dated her ex, shared her secret, or crossed any other boundary, own up to it. Don't make excuses or minimize her feelings—take full responsibility for your actions. A sincere apology shows that you value the friendship and understand why she's hurt. Real friends can work through mistakes when there's honest communication and genuine remorse. The lack of accountability is what truly destroys friendships, not the initial mistake itself."
    }
  }
}
