{
  "GirlsCode_DataBase": {
    "GirlCode1": {
      "GirlCode_Title": "Never Date Your Bestie's Ex",
      "GirlCode_Details": "Her ex is off-limits forever. No guy is worth losing your best friend over."
    },
    "GirlCode2": {
      "GirlCode_Title": "Keep Her Secrets Safe",
      "GirlCode_Details": "What she tells you about him stays between you two. Loyalty over gossip, always."
    },
    "GirlCode3": {
      "GirlCode_Title": "Be Honest About Red Flags",
      "GirlCode_Details": "If you see a red flag in her dating life, speak up—with love and honesty."
    },
    "GirlCode4": {
      "GirlCode_Title": "Hype Her Up, Don't Tear Her Down",
      "GirlCode_Details": "Celebrate her wins, support her glow-up, and never compete with her for male attention."
    },
    "GirlCode5": {
      "GirlCode_Title": "Don't Let Him Isolate Her",
      "GirlCode_Details": "If a guy is trying to cut her off from friends and family, that's a dealbreaker. Call it out."
    },
    "GirlCode6": {
      "GirlCode_Title": "Split the Bill or Offer to Pay",
      "GirlCode_Details": "Financial independence matters. Never feel obligated to let a man pay if it makes you uncomfortable."
    },
    "GirlCode7": {
      "GirlCode_Title": "Trust Your Gut Feeling",
      "GirlCode_Details": "If something feels off about him, it probably is. Your intuition is your superpower—don't ignore it."
    },
    "GirlCode8": {
      "GirlCode_Title": "Have Each Other's Backs on Dates",
      "GirlCode_Details": "Check-ins during dates, safe words for group hangouts, and always prioritize her safety over politeness."
    },
    "GirlCode9": {
      "GirlCode_Title": "Don't Chase Men, Attract Them",
      "GirlCode_Details": "Know your worth and let him put in the effort. A man worth having will show up for you consistently."
    },
    "GirlCode10": {
      "GirlCode_Title": "Prioritize Your Peace Over Relationships",
      "GirlCode_Details": "No relationship is worth your mental health, self-respect, or happiness. It's okay to walk away and start fresh."
    },

    "GirlCode11": {
  "GirlCode_Title": "Don't Settle for Breadcrumbs",
  "GirlCode_Details": "Sporadic texts and last-minute plans aren't dating. You deserve consistency and intentionality."
},
"GirlCode12": {
  "GirlCode_Title": "Call Out Disrespect Immediately",
  "GirlCode_Details": "Whether it's a joke that lands wrong or behavior that crosses the line, address it in the moment."
},
"GirlCode13": {
  "GirlCode_Title": "Don't Loan Money to Romantic Partners",
  "GirlCode_Details": "Money and romance mix poorly. If he can't afford something, that's his problem to solve."
},
"GirlCode14": {
  "GirlCode_Title": "Keep Your Girls Informed",
  "GirlCode_Details": "Let your close friends know where you're going on dates and who you're with for safety."
},
"GirlCode15": {
  "GirlCode_Title": "Never Apologize for Your Standards",
  "GirlCode_Details": "Having dealbreakers isn't being picky—it's being smart about what you accept in your life."
},
"GirlCode16": {
  "GirlCode_Title": "Don't Play Games to Keep Him Interested",
  "GirlCode_Details": "If you have to pretend to be someone else or play hard to get, he's not the one."
},
"GirlCode17": {
  "GirlCode_Title": "Watch How He Treats Service Workers",
  "GirlCode_Details": "A man's character shows in how he treats people who can't do anything for him."
},
"GirlCode18": {
  "GirlCode_Title": "Don't Ignore Patterns",
  "GirlCode_Details": "If he's lied once, cheated once, or been disrespectful once, that's usually not the last time."
},
"GirlCode19": {
  "GirlCode_Title": "Support Her Career Over Her Relationship",
  "GirlCode_Details": "A good man will lift her up professionally. Never encourage her to choose a guy over her dreams."
},
"GirlCode20": {
  "GirlCode_Title": "Don't Change Yourself for Anyone",
  "GirlCode_Details": "Your quirks, ambitions, and personality are features, not bugs. The right person will love all of you."
},
"GirlCode21": {
  "GirlCode_Title": "Know the Difference Between Love and Convenience",
  "GirlCode_Details": "Just because he's comfortable doesn't mean he loves you. Real love includes effort and growth."
},
"GirlCode22": {
  "GirlCode_Title": "Don't Compete for His Attention",
  "GirlCode_Details": "If you're fighting other women for his time, he's not worth fighting for."
},
"GirlCode23": {
  "GirlCode_Title": "Listen to Your Friends' Concerns",
  "GirlCode_Details": "Sometimes people we love see red flags we're too close to notice. Stay open to their perspective."
},
"GirlCode24": {
  "GirlCode_Title": "Require Exclusivity Conversation Early",
  "GirlCode_Details": "Don't assume you're exclusive. Have the conversation and make sure you're on the same page."
},
"GirlCode25": {
  "GirlCode_Title": "Don't Shrink Yourself for Him",
  "GirlCode_Details": "Your ambition, intelligence, and confidence are attractive. Never downplay them to make him comfortable."
},
"GirlCode26": {
  "GirlCode_Title": "Respect Boundaries Without Explanation",
  "GirlCode_Details": "You don't owe anyone access to your body, time, or energy. A boundary is enough."
},
"GirlCode27": {
  "GirlCode_Title": "Don't Accept Apologies Without Change",
  "GirlCode_Details": "Words are easy. Real apologies come with changed behavior over time."
},
"GirlCode28": {
  "GirlCode_Title": "Check In With Her During Relationship Issues",
  "GirlCode_Details": "When she's going through a breakup or relationship drama, show up consistently and listen without judgment."
},
"GirlCode29": {
  "GirlCode_Title": "Don't Stay for Potential",
  "GirlCode_Details": "He's not a fixer-upper project. Love him for who he is now, not who he might become."
},
"GirlCode30": {
  "GirlCode_Title": "Know That Trauma Bonding Isn't Love",
  "GirlCode_Details": "Going through drama together doesn't mean you're compatible. Real love is built on stability and respect."
},
"GirlCode31": {
  "GirlCode_Title": "Don't Let Him Rewrite Your Narrative",
  "GirlCode_Details": "If he constantly contradicts your memories or experiences, that's manipulation. Trust yourself."
},
"GirlCode32": {
  "GirlCode_Title": "Celebrate Single Status",
  "GirlCode_Details": "Being alone is better than being with the wrong person. Enjoy your independence and freedom."
},
"GirlCode33": {
  "GirlCode_Title": "Don't Accept Crumbs of Effort",
  "GirlCode_Details": "He should show up for you in meaningful ways, not just romantically. Check his actions, not his words."
},
"GirlCode34": {
  "GirlCode_Title": "Protect Your Peace From Drama",
  "GirlCode_Details": "Don't engage with his exes, his family drama, or unnecessary conflict. Your energy is precious."
},
"GirlCode35": {
  "GirlCode_Title": "Don't Compete With His Phone",
  "GirlCode_Details": "If he's always on his phone around you, he's not present. You deserve full attention."
},
"GirlCode36": {
  "GirlCode_Title": "Ask Direct Questions",
  "GirlCode_Details": "Stop hinting and guessing. Clear communication prevents misunderstandings and wasted time."
},
"GirlCode37": {
  "GirlCode_Title": "Don't Accept Bare Minimum",
  "GirlCode_Details": "He texting back doesn't deserve a medal. Set the bar higher than basic human decency."
},
"GirlCode38": {
  "GirlCode_Title": "Watch How He Handles Conflict",
  "GirlCode_Details": "Does he communicate or shut down? Does he take responsibility or blame you? His conflict style matters."
},
"GirlCode39": {
  "GirlCode_Title": "Don't Let Him Rush the Relationship",
  "GirlCode_Details": "Love-bombing and moving fast are red flags. Healthy relationships develop at a sustainable pace."
},
"GirlCode40": {
  "GirlCode_Title": "Maintain Financial Independence",
  "GirlCode_Details": "Never become financially dependent on a partner. Keep your own income, savings, and resources."
},
"GirlCode41": {
  "GirlCode_Title": "Don't Accept Jealousy as Love",
  "GirlCode_Details": "A possessive, controlling man isn't protecting you—he's owning you. That's not love."
},
"GirlCode42": {
  "GirlCode_Title": "Listen When She Says He's Bad News",
  "GirlCode_Details": "If your bestie sees something you don't, take it seriously. She might be the voice of reason you need."
},
"GirlCode43": {
  "GirlCode_Title": "Don't Stay in Situationships",
  "GirlCode_Details": "After a few months, if he won't define the relationship, he's deciding for you. Choose clarity and walk away."
},
"GirlCode44": {
  "GirlCode_Title": "Respect Her Timeline",
  "GirlCode_Details": "Whether she's taking time to heal or rushing into love, support her journey without judgment."
},
"GirlCode45": {
  "GirlCode_Title": "Don't Ignore Substance Abuse Issues",
  "GirlCode_Details": "If he drinks excessively, uses drugs, or has addictive behaviors, that's a dealbreaker. You can't fix it."
},
"GirlCode46": {
  "GirlCode_Title": "Know That Love Isn't Enough",
  "GirlCode_Details": "Chemistry and love matter, but so do values, goals, and compatibility. Passion fades without a solid foundation."
},
"GirlCode47": {
  "GirlCode_Title": "Don't Accept Silent Treatment",
  "GirlCode_Details": "Giving you the cold shoulder is manipulation. Demand communication or remove yourself from the situation."
},
"GirlCode48": {
  "GirlCode_Title": "Check His Relationship With His Mother",
  "GirlCode_Details": "How he treats the main woman in his life reveals how he'll eventually treat you."
},
"GirlCode49": {
  "GirlCode_Title": "Don't Share Your Passwords or Codes",
  "GirlCode_Details": "Privacy isn't secrecy. Keep your personal accounts and information to yourself for your own protection."
},
"GirlCode50": {
  "GirlCode_Title": "Normalize Asking About Exes",
  "GirlCode_Details": "His past relationships matter. Ask about breakups, patterns, and what he learned. His answers reveal character."
},
"GirlCode51": {
  "GirlCode_Title": "Don't Sacrifice Sleep for Late-Night Texts",
  "GirlCode_Details": "If he only wants to talk late at night, that's intentional. He's not prioritizing quality time with you."
},
"GirlCode52": {
  "GirlCode_Title": "Support Her Decision to Leave",
  "GirlCode_Details": "If she decides to end it, celebrate her strength. Never pressure her to stay or take him back."
},
"GirlCode53": {
  "GirlCode_Title": "Don't Ignore Online Red Flags",
  "GirlCode_Details": "Check his social media behavior. Is he respectful? Does he have shady follows? Trust what you see."
},
"GirlCode54": {
  "GirlCode_Title": "Know That Great Sex Isn't a Relationship",
  "GirlCode_Details": "Chemistry in bed doesn't mean compatibility in life. Don't confuse passion with partnership."
},
"GirlCode55": {
  "GirlCode_Title": "Don't Let Him Control Your Circle",
  "GirlCode_Details": "A good man wants you to have friends and life outside the relationship. Isolation is a control tactic."
},
"GirlCode56": {
  "GirlCode_Title": "Ask About His Future Plans",
  "GirlCode_Details": "Does he want marriage, kids, stability? Make sure his vision aligns with yours before investing deeper."
},
"GirlCode57": {
  "GirlCode_Title": "Don't Accept Mixed Signals",
  "GirlCode_Details": "Confused feelings are usually someone keeping options open. Clarity is a bare minimum."
},
"GirlCode58": {
  "GirlCode_Title": "Be There When She's Rebuilding",
  "GirlCode_Details": "After heartbreak, show up consistently. Remind her of her worth and help her find herself again."
},
"GirlCode59": {
  "GirlCode_Title": "Don't Overlook How He Speaks About Women",
  "GirlCode_Details": "Misogynistic jokes, disrespectful commentary about women—these aren't harmless. They reveal his worldview."
},
"GirlCode60": {
  "GirlCode_Title": "Trust the Relationship Feedback You Get",
  "GirlCode_Details": "If multiple people express concern about your relationship, listen. Sometimes outside perspective is clarity."
}

    

  }
}
