{
  "DatingMistake_Archive": {
    "Mistake1": {
      "Mistake_Title": "Falling for Potential, Not Reality",
      "Mistake_Details": "You saw what he could be, not who he actually was. You kept hoping he'd grow, change, or finally commit — but people only change if they truly want to. Falling for potential often leaves you stuck in a fantasy, not a relationship.",
      "Mistake_Lesson": "Love who they are today, not who you hope they’ll become.",
      "Mistake_Tag": "Expectations"
    },
    "Mistake2": {
      "Mistake_Title": "Ignoring Red Flags Because of Chemistry",
      "Mistake_Details": "The spark was strong, but the signs were louder. You laughed off the excuses, the mixed signals, the inconsistencies — because the attraction felt so real. Chemistry is exciting, but it’s not a replacement for compatibility or respect.",
      "Mistake_Lesson": "If you have to explain away bad behavior, it’s not love — it’s denial.",
      "Mistake_Tag": "Red Flags"
    },
    "Mistake3": {
      "Mistake_Title": "Texting Like You’re Already His Girlfriend",
      "Mistake_Details": "You gave emotional availability before he gave commitment. Over-texting, over-sharing, and over-caring too soon can make you feel drained when things don’t progress. Emotional investment should match effort and clarity — not assumptions.",
      "Mistake_Lesson": "Match energy, not fantasy. Let him earn your access.",
      "Mistake_Tag": "Boundaries"
    },
    "Mistake4": {
      "Mistake_Title": "Thinking You Can Fix Him",
      "Mistake_Details": "You thought your love could heal his trauma or change his ways. But healing isn’t your job — it’s his responsibility. You can support someone’s growth, but you can’t do the growing for them.",
      "Mistake_Lesson": "You’re a partner, not a project manager.",
      "Mistake_Tag": "Self-Worth"
    },
    "Mistake5": {
      "Mistake_Title": "Ignoring Your Intuition",
      "Mistake_Details": "You felt something was off — the late replies, the inconsistencies, the gut feeling that didn’t sit right — but you brushed it aside to avoid seeming ‘dramatic.’ Your intuition is your emotional GPS; ignoring it always leads to lessons.",
      "Mistake_Lesson": "Your gut is never wrong — only ignored.",
      "Mistake_Tag": "Awareness"
    },
    "Mistake6": {
      "Mistake_Title": "Confusing Attention with Intention",
      "Mistake_Details": "He texted, flirted, and made you feel wanted — but never made real plans or showed effort. It felt validating, but attention without intention is just ego fuel. Don’t confuse breadcrumbs for a meal.",
      "Mistake_Lesson": "If his actions don’t match his words, believe his silence.",
      "Mistake_Tag": "Intentions"
    },
    "Mistake7": {
      "Mistake_Title": "Overlooking Self-Care During the Relationship",
      "Mistake_Details": "You poured so much into him that you forgot to pour into yourself. Your hobbies, friends, and joy slowly faded while you prioritized the relationship. Losing yourself for love isn’t love — it’s self-abandonment.",
      "Mistake_Lesson": "Never let a relationship cost you your peace or identity.",
      "Mistake_Tag": "Self-Love"
    },
    "Mistake8": {
      "Mistake_Title": "Thinking Mixed Signals Are a Challenge to Decode",
      "Mistake_Details": "You tried to read between the lines, justify his behavior, and find meaning in his inconsistencies. Mixed signals aren’t mysterious — they’re just signals that he’s not all in. When someone wants you, you’ll know.",
      "Mistake_Lesson": "Clarity feels calm. Confusion means no.",
      "Mistake_Tag": "Clarity"
    },
    "Mistake9": {
      "Mistake_Title": "Lowering Standards Because You’re Lonely",
      "Mistake_Details": "You convinced yourself that a ‘situationship’ was better than nothing, or that being almost chosen was enough. But settling out of loneliness only creates deeper emptiness later. The right person won’t make you question your worth.",
      "Mistake_Lesson": "Loneliness passes. Regret lasts longer.",
      "Mistake_Tag": "Standards"
    },
    "Mistake10": {
      "Mistake_Title": "Apologizing for Having Boundaries",
      "Mistake_Details": "You felt guilty for saying no, for asking for consistency, or for wanting clarity — so you started apologizing for having standards. But boundaries protect your peace, not your ego. The right man respects them; the wrong one tests them.",
      "Mistake_Lesson": "Boundaries don’t scare the right person — they filter them.",
      "Mistake_Tag": "Boundaries"
    }
  }
}

