{
  "DatingMistake_Archive": {
    "Mistake1": {
      "Mistake_Title": "Falling for Potential, Not Reality",
      "Mistake_Details": "You saw what she could be, not who she actually was. You kept hoping she'd grow, change, or finally commit — but people only change if they truly want to. Falling for potential often leaves you stuck in a fantasy, not a relationship.",
      "Mistake_Lesson": "Love who they are today, not who you hope they'll become.",
      "Mistake_Tag": "Expectations"
    },
    "Mistake2": {
      "Mistake_Title": "Ignoring Red Flags Because of Chemistry",
      "Mistake_Details": "The spark was strong, but the signs were louder. You laughed off the excuses, the mixed signals, the inconsistencies — because the attraction felt so real. Chemistry is exciting, but it's not a replacement for compatibility or respect.",
      "Mistake_Lesson": "If you have to explain away bad behavior, it's not love — it's denial.",
      "Mistake_Tag": "Red Flags"
    },
    "Mistake3": {
      "Mistake_Title": "Texting Like You're Already Her Girlfriend",
      "Mistake_Details": "You gave emotional availability before she gave commitment. Over-texting, over-sharing, and over-caring too soon can make you feel drained when things don't progress. Emotional investment should match effort and clarity — not assumptions.",
      "Mistake_Lesson": "Match energy, not fantasy. Let her earn your access.",
      "Mistake_Tag": "Boundaries"
    },
    "Mistake4": {
      "Mistake_Title": "Catching Feelings for Someone Unavailable",
      "Mistake_Details": "She had a girlfriend, wasn't ready, or was already involved with someone else. You convinced yourself that waiting was love, that eventually she'd choose you. This only led to heartbreak, resentment, and wasted emotional energy on someone who couldn't give you what you needed.",
      "Mistake_Lesson": "Don't build a relationship on someone else's timeline. You deserve someone who's already yours.",
      "Mistake_Tag": "Unavailability"
    },
    "Mistake5": {
      "Mistake_Title": "Changing Yourself to Fit Her Preferences",
      "Mistake_Details": "You cut your hair the way she liked it, ditched hobbies she didn't enjoy, and adjusted your personality to seem more compatible. But relationships aren't meant to erase who you are — they're meant to celebrate it. When you lose yourself, you lose the person she actually fell for.",
      "Mistake_Lesson": "Your authentic self is your greatest asset, not your greatest flaw.",
      "Mistake_Tag": "Identity"
    },
    "Mistake6": {
      "Mistake_Title": "Dating Within Your Friend Group",
      "Mistake_Details": "You knew hooking up with her was a bad idea, but the chemistry was there. When it ended, so did your friendship — and half your social circle took sides. The aftermath lingered for years, creating tension in every group hangout.",
      "Mistake_Lesson": "Don't shit where you eat. Your friend group's peace is worth more than temporary chemistry.",
      "Mistake_Tag": "Consequences"
    },
    "Mistake7": {
      "Mistake_Title": "Not Communicating Your Needs Directly",
      "Mistake_Details": "You dropped hints, used tone, and expected her to read between the lines. When she didn't understand what you wanted, you got upset that she 'didn't care.' But she can't meet needs she doesn't know you have. Hints are just miscommunication in disguise.",
      "Mistake_Lesson": "Say what you mean. Clarity beats assumptions every single time.",
      "Mistake_Tag": "Communication"
    },
    "Mistake8": {
      "Mistake_Title": "Comparing Your Relationship to Others",
      "Mistake_Details": "You scrolled through Instagram and saw other couples getting flowers daily, fancy dates, and public declarations of love. Your relationship looked boring by comparison, so you started resenting her for not doing the same. But those curated moments aren't reality — they're performance.",
      "Mistake_Lesson": "Your relationship is only competing with your actual life, not someone else's highlight reel.",
      "Mistake_Tag": "Comparison"
    },
    "Mistake9": {
      "Mistake_Title": "Not Respecting Her Boundaries or Personal Space",
      "Mistake_Details": "She asked for alone time, but you felt rejected. She set a boundary, but you pushed back because 'it wasn't a big deal.' You monitored who she spent time with and got jealous of her friendships. Boundaries aren't punishment — they're basic respect.",
      "Mistake_Lesson": "Boundaries aren't negotiable; they're non-negotiable. Respect them or lose her.",
      "Mistake_Tag": "Boundaries"
    },
    "Mistake10": {
      "Mistake_Title": "Staying Because You're Afraid of Starting Over",
      "Mistake_Details": "Deep down, you knew she wasn't the one. But the thought of being alone, rebuilding, and putting yourself back out there felt worse than staying comfortable in an unfulfilling relationship. Fear kept you stuck, stealing years you could've spent finding someone who actually loves you.",
      "Mistake_Lesson": "A comfortable wrong is still wrong. You deserve a relationship that excites, not one that just doesn't hurt.",
      "Mistake_Tag": "Fear"
    }
  }
}
