{
  "DatingMistake_Archive": {
    "Mistake1": {
      "Mistake_Title": "Falling for Potential, Not Reality",
      "Mistake_Details": "You saw what she could be, not who she actually was. You kept hoping she'd grow, change, or finally commit — but people only change if they truly want to. Falling for potential often leaves you stuck in a fantasy, not a relationship.",
      "Mistake_Lesson": "Love who they are today, not who you hope they'll become.",
      "Mistake_Tag": "Expectations"
    },
    "Mistake2": {
      "Mistake_Title": "Ignoring Red Flags Because of Chemistry",
      "Mistake_Details": "The spark was strong, but the signs were louder. You laughed off the excuses, the mixed signals, the inconsistencies — because the attraction felt so real. Chemistry is exciting, but it's not a replacement for compatibility or respect.",
      "Mistake_Lesson": "If you have to explain away bad behavior, it's not love — it's denial.",
      "Mistake_Tag": "Red Flags"
    },
    "Mistake3": {
      "Mistake_Title": "Texting Like You're Already Her Girlfriend",
      "Mistake_Details": "You gave emotional availability before she gave commitment. Over-texting, over-sharing, and over-caring too soon can make you feel drained when things don't progress. Emotional investment should match effort and clarity — not assumptions.",
      "Mistake_Lesson": "Match energy, not fantasy. Let her earn your access.",
      "Mistake_Tag": "Boundaries"
    },
    "Mistake4": {
      "Mistake_Title": "Catching Feelings for Someone Unavailable",
      "Mistake_Details": "She had a girlfriend, wasn't ready, or was already involved with someone else. You convinced yourself that waiting was love, that eventually she'd choose you. This only led to heartbreak, resentment, and wasted emotional energy on someone who couldn't give you what you needed.",
      "Mistake_Lesson": "Don't build a relationship on someone else's timeline. You deserve someone who's already yours.",
      "Mistake_Tag": "Unavailability"
    },
    "Mistake5": {
      "Mistake_Title": "Changing Yourself to Fit Her Preferences",
      "Mistake_Details": "You cut your hair the way she liked it, ditched hobbies she didn't enjoy, and adjusted your personality to seem more compatible. But relationships aren't meant to erase who you are — they're meant to celebrate it. When you lose yourself, you lose the person she actually fell for.",
      "Mistake_Lesson": "Your authentic self is your greatest asset, not your greatest flaw.",
      "Mistake_Tag": "Identity"
    },
    "Mistake6": {
      "Mistake_Title": "Dating Within Your Friend Group",
      "Mistake_Details": "You knew hooking up with her was a bad idea, but the chemistry was there. When it ended, so did your friendship — and half your social circle took sides. The aftermath lingered for years, creating tension in every group hangout.",
      "Mistake_Lesson": "Don't shit where you eat. Your friend group's peace is worth more than temporary chemistry.",
      "Mistake_Tag": "Consequences"
    },
    "Mistake7": {
      "Mistake_Title": "Not Communicating Your Needs Directly",
      "Mistake_Details": "You dropped hints, used tone, and expected her to read between the lines. When she didn't understand what you wanted, you got upset that she 'didn't care.' But she can't meet needs she doesn't know you have. Hints are just miscommunication in disguise.",
      "Mistake_Lesson": "Say what you mean. Clarity beats assumptions every single time.",
      "Mistake_Tag": "Communication"
    },
    "Mistake8": {
      "Mistake_Title": "Comparing Your Relationship to Others",
      "Mistake_Details": "You scrolled through Instagram and saw other couples getting flowers daily, fancy dates, and public declarations of love. Your relationship looked boring by comparison, so you started resenting her for not doing the same. But those curated moments aren't reality — they're performance.",
      "Mistake_Lesson": "Your relationship is only competing with your actual life, not someone else's highlight reel.",
      "Mistake_Tag": "Comparison"
    },
    "Mistake9": {
      "Mistake_Title": "Not Respecting Her Boundaries or Personal Space",
      "Mistake_Details": "She asked for alone time, but you felt rejected. She set a boundary, but you pushed back because 'it wasn't a big deal.' You monitored who she spent time with and got jealous of her friendships. Boundaries aren't punishment — they're basic respect.",
      "Mistake_Lesson": "Boundaries aren't negotiable; they're non-negotiable. Respect them or lose her.",
      "Mistake_Tag": "Boundaries"
    },
    "Mistake10": {
      "Mistake_Title": "Staying Because You're Afraid of Starting Over",
      "Mistake_Details": "Deep down, you knew she wasn't the one. But the thought of being alone, rebuilding, and putting yourself back out there felt worse than staying comfortable in an unfulfilling relationship. Fear kept you stuck, stealing years you could've spent finding someone who actually loves you.",
      "Mistake_Lesson": "A comfortable wrong is still wrong. You deserve a relationship that excites, not one that just doesn't hurt.",
      "Mistake_Tag": "Fear"
    },

    "Mistake10": {
      "Mistake_Title": "Playing Games Instead of Being Honest",
      "Mistake_Details": "You made her jealous on purpose, ignored her texts to seem less interested, or played hard to get to keep her chasing. Games are exhausting and they don't build trust — they build resentment. Real connection requires vulnerability, not strategy.",
      "Mistake_Lesson": "Authenticity beats manipulation every time. If you have to play games, she's not the right person.",
      "Mistake_Tag": "Honesty"
    },
    "Mistake11": {
      "Mistake_Title": "Losing Yourself in Her World Completely",
      "Mistake_Details": "Your hobbies became hers, your friends became hers, your whole life revolved around her schedule. You gave up your independence thinking it would make her love you more. Instead, it made you resentful and made her lose respect for you.",
      "Mistake_Lesson": "A healthy relationship has two whole people, not two halves. Keep your own life.",
      "Mistake_Tag": "Independence"
    },
    "Mistake12": {
      "Mistake_Title": "Not Setting Standards for How You're Treated",
      "Mistake_Details": "She was late to every date, flaked on plans, and disrespected your time. You accepted it because you didn't want to seem demanding or difficult. But accepting poor treatment teaches people that they can treat you poorly.",
      "Mistake_Lesson": "Your standards aren't mean — they're your baseline. Anyone who respects you will meet them.",
      "Mistake_Tag": "Standards"
    },
    "Mistake13": {
      "Mistake_Title": "Seeking Validation Through Her Approval",
      "Mistake_Details": "Everything you did was filtered through whether she'd like it or approve of it. You changed your outfit, canceled plans with friends, and made decisions based on her reaction. Your worth became tied to her opinion.",
      "Mistake_Lesson": "Your value doesn't fluctuate based on someone else's approval. Validate yourself first.",
      "Mistake_Tag": "Self-Worth"
    },
    "Mistake14": {
      "Mistake_Title": "Staying in the Relationship for the Wrong Reasons",
      "Mistake_Details": "You stayed because of the history, because you'd invested so much time, or because leaving felt like admitting failure. But history isn't a reason to stay — it's just a reason you've already been there. Time invested in the wrong person is still time wasted.",
      "Mistake_Lesson": "Sunk cost is a fallacy. Future happiness matters more than past investment.",
      "Mistake_Tag": "Decision"
    },
    "Mistake15": {
      "Mistake_Title": "Oversharing Too Soon",
      "Mistake_Details": "You told her your deepest secrets, your trauma, your insecurities on the third date. You thought vulnerability was intimacy, but you gave her ammunition before you gave her trust. Oversharing too early can feel like pressure, not connection.",
      "Mistake_Lesson": "Build intimacy gradually. Vulnerability is earned, not given.",
      "Mistake_Tag": "Pacing"
    },
    "Mistake16": {
      "Mistake_Title": "Not Listening When She Showed You Who She Was",
      "Mistake_Details": "She told you upfront that she wasn't looking for anything serious, but you thought you'd change her mind. She showed you inconsistency, and you believed the good moments meant she was different with you. She showed you exactly who she was — you just didn't want to see it.",
      "Mistake_Lesson": "Believe people when they tell you who they are the first time.",
      "Mistake_Tag": "Red Flags"
    },
    "Mistake17": {
      "Mistake_Title": "Trying to Be Cool Instead of Being Real",
      "Mistake_Details": "You pretended to like things you hated, laughed at jokes that weren't funny, and acted like you didn't care when you actually did — all to impress her. But the person she liked was a character, not you. That's not a real relationship.",
      "Mistake_Lesson": "Authenticity attracts the right people. Performance attracts the wrong ones.",
      "Mistake_Tag": "Authenticity"
    },
    "Mistake18": {
      "Mistake_Title": "Not Having Standards for Physical Intimacy",
      "Mistake_Details": "She pressured you into physical intimacy before you were ready, and you went along with it to avoid disappointing her or losing her. Your body told you no, but your fear said yes. That's not consent — that's compliance.",
      "Mistake_Lesson": "Your body is yours. Never compromise your comfort for someone else's desires.",
      "Mistake_Tag": "Consent"
    },
    "Mistake19": {
      "Mistake_Title": "Allowing Her to Disrespect Your Family and Friends",
      "Mistake_Details": "She made comments about your family being weird or your friends being annoying. Instead of defending them, you agreed and distanced yourself. Over time, she isolated you from everyone who actually loved you.",
      "Mistake_Lesson": "A partner who respects you respects the people who matter to you.",
      "Mistake_Tag": "Loyalty"
    },
    "Mistake20": {
      "Mistake_Title": "Confusing Attention with Love",
      "Mistake_Details": "She called you constantly, wanted to know where you were, and got upset when you had time away. You thought it was passion — it was possession. Control dressed up as care is still control.",
      "Mistake_Lesson": "Love trusts. Obsession monitors. Know the difference.",
      "Mistake_Tag": "Control"
    },
    "Mistake21": {
      "Mistake_Title": "Not Addressing Problems Early",
      "Mistake_Details": "Something bothered you, but you let it slide because you didn't want conflict. Then it happened again, and you stayed silent. By the time you finally spoke up, you were furious and she had no idea why. Small problems become big resentments when left untreated.",
      "Mistake_Lesson": "Address issues when they're small. Silence never solves anything.",
      "Mistake_Tag": "Communication"
    },
    "Mistake22": {
      "Mistake_Title": "Making Excuses for Her Behavior",
      "Mistake_Details": "She stood you up and blamed work, so you accepted it. She was mean and blamed stress. She lied and blamed not wanting to hurt you. Every time, you found a reason to forgive and forget. But excuses aren't explanations — they're ways to avoid accountability.",
      "Mistake_Lesson": "Actions speak louder than reasons. Judge by what she does, not what she says.",
      "Mistake_Tag": "Accountability"
    },
    "Mistake23": {
      "Mistake_Title": "Trying to 'Fix' Her Emotional Issues",
      "Mistake_Details": "She had baggage — trauma, mental health struggles, past relationship wounds. You thought if you loved her enough, you could heal her. But you can't fix someone who doesn't want to fix themselves. Her healing isn't your responsibility.",
      "Mistake_Lesson": "You can support, but you can't save. That's on her.",
      "Mistake_Tag": "Boundaries"
    },
    "Mistake24": {
      "Mistake_Title": "Expecting Her to Read Your Mind",
      "Mistake_Details": "You got upset that she didn't know what was wrong without you telling her. You expected her to notice small changes in your mood and to intuitively understand your needs. But mind reading isn't real — communication is.",
      "Mistake_Lesson": "Tell her what you need. She's not a mind reader.",
      "Mistake_Tag": "Communication"
    },
    "Mistake25": {
      "Mistake_Title": "Using the Silent Treatment as Punishment",
      "Mistake_Details": "When she upset you, you went silent. You didn't answer calls, gave one-word responses, and made her feel like she had to earn your forgiveness. Silent treatment is emotional punishment, and it teaches her that conflict means abandonment.",
      "Mistake_Lesson": "If you're upset, say it. Don't freeze her out.",
      "Mistake_Tag": "Communication"
    },
    "Mistake26": {
      "Mistake_Title": "Comparing Her to Your Exes",
      "Mistake_Details": "You mentioned how your ex was more affectionate, more fun, or more supportive. You thought it would motivate her to be better, but instead it made her feel like she'd never measure up. Comparisons kill connection.",
      "Mistake_Lesson": "If you're thinking about an ex, she's not the right person.",
      "Mistake_Tag": "Respect"
    },
    "Mistake27": {
      "Mistake_Title": "Not Being Willing to Compromise",
      "Mistake_Details": "Everything had to be your way — where to eat, what to watch, how to spend weekends. You couldn't meet her halfway because compromise felt like losing. But relationships aren't about winning — they're about finding middle ground.",
      "Mistake_Lesson": "Compromise isn't weakness. It's how partnerships work.",
      "Mistake_Tag": "Flexibility"
    },
    "Mistake28": {
      "Mistake_Title": "Seeking Relationship Advice From the Wrong People",
      "Mistake_Details": "You asked your single, bitter friends who've never had a healthy relationship for advice. Or you listened to family members who didn't support your relationship anyway. You took guidance from people who had no stake in your happiness.",
      "Mistake_Lesson": "Ask for advice from people with successful relationships, not from your hype people.",
      "Mistake_Tag": "Wisdom"
    },
    "Mistake29": {
      "Mistake_Title": "Not Checking In With Your Own Feelings",
      "Mistake_Details": "You were so focused on making the relationship work that you stopped noticing how you felt. You were unhappy, unfulfilled, and exhausted — but you kept pushing forward. You ignored your gut because you didn't want to face the truth.",
      "Mistake_Lesson": "Your feelings are data. Listen to them.",
      "Mistake_Tag": "Intuition"
    },
    "Mistake30": {
      "Mistake_Title": "Giving Second Chances Without Seeing Change",
      "Mistake_Details": "She cheated and promised it wouldn't happen again. She lied and swore to never lie again. She repeated the same behavior, and you gave another pass. Forgiveness without change is just enabling.",
      "Mistake_Lesson": "Change is shown, not promised. Trust is rebuilt through actions, not words.",
      "Mistake_Tag": "Trust"
    },
    "Mistake31": {
      "Mistake_Title": "Not Having Your Own Life Goals",
      "Mistake_Details": "Your only goal became making the relationship work. You had no personal ambitions, no career plans, no future vision outside of her. When the relationship ended, you realized you had nothing else.",
      "Mistake_Lesson": "A full life attracts a full person. Don't make someone else your only purpose.",
      "Mistake_Tag": "Purpose"
    },
    "Mistake32": {
      "Mistake_Title": "Being Emotionally Unavailable When She Needed You",
      "Mistake_Details": "She opened up about her struggles and you shut down. When she needed emotional support, you were cold or dismissive. You showed up physically but checked out emotionally. That's not partnership.",
      "Mistake_Lesson": "Emotional presence is just as important as physical presence.",
      "Mistake_Tag": "Presence"
    },
    "Mistake33": {
      "Mistake_Title": "Letting Her Disrespect Your Career Choices",
      "Mistake_Details": "She criticized your job, your ambitions, or your career path. Instead of standing firm in your choices, you second-guessed yourself. You let her derail your professional identity.",
      "Mistake_Lesson": "Your career choices are yours. Support means respect, not sabotage.",
      "Mistake_Tag": "Respect"
    },
    "Mistake34": {
      "Mistake_Title": "Using Humor to Avoid Serious Conversations",
      "Mistake_Details": "Whenever something serious came up, you deflected with a joke. You made light of her concerns to avoid dealing with them. Eventually, she stopped bringing things up because you never took her seriously.",
      "Mistake_Lesson": "Vulnerability can't happen in comedy. Sometimes you need to be present, not funny.",
      "Mistake_Tag": "Presence"
    },
    "Mistake35": {
      "Mistake_Title": "Not Respecting Her Decision to Leave",
      "Mistake_Details": "When she said she needed a break or wanted to end things, you pushed back instead of accepting it. You tried to convince her, bargain with her, or manipulate her into staying. You didn't respect her autonomy.",
      "Mistake_Lesson": "Her 'no' is final. Respect it.",
      "Mistake_Tag": "Respect"
    },
    "Mistake36": {
      "Mistake_Title": "Creating Drama to Avoid Boredom",
      "Mistake_Details": "When things felt routine or stable, you picked a fight to create excitement. You thrived on conflict and chaos because peace felt boring. But healthy relationships need stability, not constant turbulence.",
      "Mistake_Lesson": "Real love is peaceful. If you need drama, you're not looking for love.",
      "Mistake_Tag": "Stability"
    },
    "Mistake37": {
      "Mistake_Title": "Not Being Supportive of Her Goals",
      "Mistake_Details": "She had ambitions and dreams, but you saw them as threats because they'd take time away from you. Instead of cheering her on, you subtly (or not so subtly) discouraged her. You wanted her to prioritize you over herself.",
      "Mistake_Lesson": "A partner who loves you celebrates your growth, not your smallness.",
      "Mistake_Tag": "Support"
    },
    "Mistake38": {
      "Mistake_Title": "Confusing Intensity with Depth",
      "Mistake_Details": "The relationship was all-consuming — constantly texting, always together, everything felt urgent and important. You thought that intensity meant it was real. But intensity without stability burns out quickly.",
      "Mistake_Lesson": "Real relationships deepen with time. Intensity alone isn't love.",
      "Mistake_Tag": "Depth"
    },
    "Mistake39": {
      "Mistake_Title": "Not Taking Breaks When You Needed Them",
      "Mistake_Details": "You felt drained and exhausted, but you kept showing up and giving. You didn't take space or time to yourself because you feared she'd pull away. Constant availability isn't devotion — it's desperation.",
      "Mistake_Lesson": "You can't pour from an empty cup. Self-care isn't selfish.",
      "Mistake_Tag": "Self-Care"
    },
    "Mistake40": {
      "Mistake_Title": "Blaming Her for Your Own Unhappiness",
      "Mistake_Details": "You expected her to make you happy. When you were sad or unfulfilled, you made it her fault. You wanted her to fix your insecurities and validate your worth. That's too much pressure for anyone to carry.",
      "Mistake_Lesson": "Your happiness is your responsibility. She can enhance it, not create it.",
      "Mistake_Tag": "Responsibility"
    },
    "Mistake41": {
      "Mistake_Title": "Not Asking Questions When Something Felt Off",
      "Mistake_Details": "You had a gut feeling that something was wrong — her behavior changed, her stories didn't add up, she was distant — but you didn't ask. You ignored the red flags because you didn't want to seem paranoid or insecure.",
      "Mistake_Lesson": "Your intuition is often right. Trust it enough to ask questions.",
      "Mistake_Tag": "Intuition"
    },
    "Mistake42": {
      "Mistake_Title": "Staying With Her Out of Guilt",
      "Mistake_Details": "You felt bad for her — her life was hard, she'd been hurt before, she needed you. Guilt kept you in a relationship you didn't want. But staying out of guilt isn't love, and it's not fair to either of you.",
      "Mistake_Lesson": "Guilt is not a foundation for a relationship. Compassion is, but not guilt.",
      "Mistake_Tag": "Guilt"
    },
    "Mistake43": {
      "Mistake_Title": "Not Having Difficult Conversations Early Enough",
      "Mistake_Details": "There were dealbreakers — incompatible life goals, different values, conflicting timelines — but you didn't discuss them early on. By the time they surfaced, you were already emotionally invested. Those conversations are harder the longer you wait.",
      "Mistake_Lesson": "Ask about dealbreakers before you fall. Know if you're heading the same direction.",
      "Mistake_Tag": "Communication"
    },
    "Mistake44": {
      "Mistake_Title": "Accepting Breadcrumbing as Enough",
      "Mistake_Details": "She threw you occasional attention — a text, a call, a date — just enough to keep you hoping but not enough to mean commitment. You accepted crumbs because you were hungry for her. But you deserve a full meal, not scraps.",
      "Mistake_Lesson": "Consistency matters. Breadcrumbs aren't intimacy.",
      "Mistake_Tag": "Respect"
    },
    "Mistake45": {
      "Mistake_Title": "Letting Her Be Selfish Without Speaking Up",
      "Mistake_Details": "She only wanted to talk about her problems, never asked about yours. She made plans only around her schedule. She never compromised. Instead of calling it out, you just accepted it. But relationships require reciprocity.",
      "Mistake_Lesson": "If it's one-sided, it's not a relationship — it's servitude.",
      "Mistake_Tag": "Reciprocity"
    },
    "Mistake46": {
      "Mistake_Title": "Not Recognizing When You've Outgrown Each Other",
      "Mistake_Details": "You both changed over time — your goals shifted, your values evolved, who you were becoming was incompatible with who she was becoming. But instead of acknowledging growth, you tried to make the old relationship work with new people.",
      "Mistake_Lesson": "Sometimes love isn't enough. People can grow in different directions.",
      "Mistake_Tag": "Growth"
    },
    "Mistake47": {
      "Mistake_Title": "Trying to Be Friends Immediately After Breakup",
      "Mistake_Details": "Right after the breakup, you suggested staying friends. You told yourself it was mature, but really you couldn't let go. You stayed in her life in a diminished capacity, which kept you stuck and prevented real healing.",
      "Mistake_Lesson": "Sometimes you need distance to actually move on. Friendship can come later.",
      "Mistake_Tag": "Healing"
    },
    "Mistake48": {
      "Mistake_Title": "Criticizing Her Instead of Critiquing Behavior",
      "Mistake_Details": "When she did something wrong, you attacked her character instead of addressing the action. You said things like 'You're so selfish' instead of 'That action was selfish.' Over time, she felt attacked, not heard.",
      "Mistake_Lesson": "Critique the behavior, not the person. There's a difference.",
      "Mistake_Tag": "Communication"
    },
    "Mistake49": {
      "Mistake_Title": "Not Prioritizing Physical Touch Without Pressure",
      "Mistake_Details": "Every time you hugged, kissed, or touched her, it felt like it was leading somewhere. You made affection transactional instead of natural. She started avoiding touch because it always meant pressure.",
      "Mistake_Lesson": "Physical intimacy should be about connection, not always about progression.",
      "Mistake_Tag": "Intimacy"
    },
    "Mistake50": {
      "Mistake_Title": "Expecting Her to Want the Same Things at the Same Speed",
      "Mistake_Details": "You were ready for marriage, kids, forever — but she needed more time. Instead of respecting her timeline, you pressured her or tried to convince her that your speed was the right speed. You couldn't accept that she might not want what you want.",
      "Mistake_Lesson": "You can't force someone to be ready. Either accept where they are or move on.",
      "Mistake_Tag": "Timing"
    },
    "Mistake51": {
      "Mistake_Title": "Romanticizing the Relationship More Than Living It",
      "Mistake_Details": "You spent more time talking about the relationship, analyzing it, trying to fix it, than actually enjoying it. You were so focused on the story you were telling yourself that you missed the actual reality happening around you.",
      "Mistake_Lesson": "A relationship that needs constant analysis and discussion might not be working.",
      "Mistake_Tag": "Reality"
    },
    "Mistake52": {
      "Mistake_Title": "Not Leaving When You Should Have",
      "Mistake_Details": "Deep down, you knew it was over. But you stayed because leaving felt like failure, or because you were scared of the unknown. You prolonged the suffering instead of making a clean break. Your fear trapped both of you.",
      "Mistake_Lesson": "Sometimes the bravest thing is knowing when to walk away.",
      "Mistake_Tag": "Courage"
    },
    "Mistake53": {
      "Mistake_Title": "Checking Her Phone or Social Media Obsessively",
      "Mistake_Details": "You went through her phone, checked her messages, monitored her Instagram. You told yourself you were protecting the relationship, but really you were invading her privacy. Trust broken this way takes years to rebuild.",
      "Mistake_Lesson": "Privacy is not secrecy. Respect her boundaries.",
      "Mistake_Tag": "Trust"
    },
    "Mistake54": {
      "Mistake_Title": "Not Celebrating Her Wins Because You Were Insecure",
      "Mistake_Details": "She got a promotion and you felt threatened instead of happy. She had success and instead of celebrating, you felt inferior. Your insecurity became her burden.",
      "Mistake_Lesson": "A healthy partner celebrates your growth, not competes with it.",
      "Mistake_Tag": "Support"
    },
    "Mistake55": {
      "Mistake_Title": "Hanging on to the Fantasy Instead of Accepting Reality",
      "Mistake_Details": "You kept seeing her as who you wanted her to be instead of who she actually was. You ignored evidence that contradicted your fantasy and held on to every scrap of hope. But reality was always there — you just refused to see it.",
      "Mistake_Lesson": "Love who she is, not who you imagine her to be.",
      "Mistake_Tag": "Acceptance"
    },
    "Mistake56": {
      "Mistake_Title": "Not Knowing Your Own Worth Before Entering a Relationship",
      "Mistake_Details": "You looked to the relationship to make you feel valuable. You gave her all your power and then wondered why you felt empty. Your worth has to come from within first, or you'll always be searching for it from someone else.",
      "Mistake_Lesson": "Know your value before you enter a relationship. It should enhance your life, not complete it.",
      "Mistake_Tag": "Self-Worth"
    },
    "Mistake57": {
      "Mistake_Title": "Using Sex as a Way to Resolve Conflict",
      "Mistake_Details": "After a big fight, you'd initiate sex to 'make up' without actually resolving anything. You used physical intimacy as a band-aid instead of dealing with the real problem. The conflict was still there; you just buried it temporarily.",
      "Mistake_Lesson": "Sex can't fix broken communication. Deal with the issue, not just the feeling.",
      "Mistake_Tag": "Conflict Resolution"
    },
    "Mistake58": {
      "Mistake_Title": "Apologizing Without Actually Changing",
      "Mistake_Details": "You said sorry over and over for the same mistakes. You apologized but kept doing the behavior. Your apologies became empty words, and she stopped trusting them. Words mean nothing without action.",
      "Mistake_Lesson": "An apology without change is just an excuse with better wording.",
      "Mistake_Tag": "Integrity"
    },
    "Mistake59": {
      "Mistake_Title": "Making Her Responsible for Your Emotional Regulation",
      "Mistake_Details": "When you were upset, she had to fix it. When you were anxious, she had to calm you down. You never developed your own coping skills — you just leaned on her to manage your feelings. That's emotional labor you can't ask someone else to carry forever.",
      "Mistake_Lesson": "Manage your own emotions. A partner can support, but not regulate.",
      "Mistake_Tag": "Responsibility"
    },
    "Mistake60": {
      "Mistake_Title": "Not Having the Courage to Be Honest About What You Want",
      "Mistake_Details": "You weren't sure if you wanted commitment but didn't say it. You weren't ready for the relationship to get serious but let her think you were. You hid your true feelings to avoid rocking the boat. But dishonesty eventually sinks every ship.",
      "Mistake_Lesson": "Honesty might hurt now, but dishonesty destroys everything later.",
      "Mistake_Tag": "Honesty"
    },

    "Mistake61": {
      "Mistake_Title": "Refusing to Admit When You're Wrong",
      "Mistake_Details": "Even when the evidence was clear, you couldn't say 'I was wrong.' You deflected, blamed her, brought up past issues, or went silent. Admitting fault felt like weakness, but your refusal to take responsibility destroyed trust.",
      "Mistake_Lesson": "The ability to say 'I'm sorry' is powerful, not pathetic. It shows strength.",
      "Mistake_Tag": "Accountability"
    },
    "Mistake62": {
      "Mistake_Title": "Punishing Her for Past Partners' Actions",
      "Mistake_Details": "Your ex cheated, so you were suspicious of every text she received. Your last girlfriend was selfish, so you assumed she would be too. You made her pay for crimes she didn't commit because you hadn't healed from past hurt.",
      "Mistake_Lesson": "She isn't your ex. Give her the chance to be someone new.",
      "Mistake_Tag": "Trust"
    },
    "Mistake63": {
      "Mistake_Title": "Not Recognizing Love Bombing as a Red Flag",
      "Mistake_Details": "She came on strong at the beginning — constant compliments, overwhelming attention, moving fast. You thought it was passion, but it was manipulation. Love bombing is designed to make you lower your defenses so control can follow.",
      "Mistake_Lesson": "Real love builds slowly. Intensity is not a sign of depth.",
      "Mistake_Tag": "Red Flags"
    },
    "Mistake64": {
      "Mistake_Title": "Treating Your Relationship Like a Hobby You Can Neglect",
      "Mistake_Details": "You only invested energy when it was convenient or exciting. When things got routine, you checked out. You expected the spark to stay alive without feeding the fire. Relationships need consistent attention.",
      "Mistake_Lesson": "Relationships aren't hobbies. They're priority or they're over.",
      "Mistake_Tag": "Effort"
    },
    "Mistake65": {
      "Mistake_Title": "Not Having Honest Conversations About Money",
      "Mistake_Details": "Money talk felt uncomfortable, so you avoided it. You didn't know her financial situation, her debts, or her money habits. Financial incompatibility can destroy a relationship that's otherwise solid.",
      "Mistake_Lesson": "Money conversations aren't romantic, but they're necessary.",
      "Mistake_Tag": "Compatibility"
    },
    "Mistake66": {
      "Mistake_Title": "Expecting Her to Meet All Your Emotional Needs",
      "Mistake_Details": "She was your therapist, your best friend, your emotional support system — everything. You leaned on her for all your validation. That's too much weight for one person, and it made her feel suffocated.",
      "Mistake_Lesson": "A partner enhances your life; they don't complete it. You need a full support system.",
      "Mistake_Tag": "Independence"
    },
    "Mistake67": {
      "Mistake_Title": "Not Appreciating Small Gestures",
      "Mistake_Details": "She made you dinner, texted you good morning, remembered a small detail about your day — but you brushed it off or didn't acknowledge it. Over time, she stopped making the effort because it didn't seem to matter to you.",
      "Mistake_Lesson": "Small gestures are how love shows up daily. Notice and appreciate them.",
      "Mistake_Tag": "Appreciation"
    },
    "Mistake68": {
      "Mistake_Title": "Using the Relationship as a Band-Aid for Loneliness",
      "Mistake_Details": "You weren't ready for a relationship; you were running from being alone. The relationship was about filling a void, not building something real. Once your loneliness passed or she couldn't fill the void, you lost interest.",
      "Mistake_Lesson": "You have to be okay being alone before you can be healthy in a relationship.",
      "Mistake_Tag": "Self-Awareness"
    },
    "Mistake69": {
      "Mistake_Title": "Not Standing Up for Yourself in the Relationship",
      "Mistake_Details": "She steamrolled your opinions, dismissed your feelings, and made decisions without your input. You just went along with it to keep the peace. But peace at the cost of your voice is submission, not partnership.",
      "Mistake_Lesson": "Your voice matters. Use it.",
      "Mistake_Tag": "Respect"
    },
    "Mistake70": {
      "Mistake_Title": "Keeping Score Instead of Keeping the Relationship",
      "Mistake_Details": "You tracked every favor, every sacrifice, every moment of effort. When the scales felt unbalanced, you threw it back in her face. You were so focused on fairness that you forgot about generosity.",
      "Mistake_Lesson": "Relationships aren't transactions. Don't keep score.",
      "Mistake_Tag": "Generosity"
    },
    "Mistake71": {
      "Mistake_Title": "Not Checking In With Reality When You're Unhappy",
      "Mistake_Details": "You were unhappy, but you thought it was temporary. You told yourself it would get better. You made excuses. Meanwhile, days turned into months and months into years of being unhappy. You never acknowledged that the unhappiness was chronic, not temporary.",
      "Mistake_Lesson": "Unhappiness is data. Listen to what it's telling you.",
      "Mistake_Tag": "Reality"
    },
    "Mistake72": {
      "Mistake_Title": "Competing With Her Friendships",
      "Mistake_Details": "She wanted to hang out with her friends, and you felt replaced. You made her choose between you and them. You isolated her from her support system so you'd be her only focus.",
      "Mistake_Lesson": "Healthy relationships include healthy friendships. Don't demand to be everything.",
      "Mistake_Tag": "Boundaries"
    },
    "Mistake73": {
      "Mistake_Title": "Not Recognizing Narcissistic Behavior",
      "Mistake_Details": "She needed constant validation and attention. Everything had to be about her. When you had a problem, she made it about her. She played the victim and never took responsibility. You didn't recognize narcissism until years later.",
      "Mistake_Lesson": "Watch for patterns of self-centeredness and lack of empathy. That's not love.",
      "Mistake_Tag": "Red Flags"
    },
    "Mistake74": {
      "Mistake_Title": "Sharing Intimate Details With Your Friends",
      "Mistake_Details": "You told your friends everything about your relationship — the intimate moments, the conflicts, her vulnerabilities. When things ended, they knew her secrets. She felt betrayed because you weaponized her privacy.",
      "Mistake_Lesson": "What she shares with you stays with you. Her trust is sacred.",
      "Mistake_Tag": "Trust"
    },
    "Mistake75": {
      "Mistake_Title": "Not Discussing Dealbreakers Before Getting Deep",
      "Mistake_Details": "You wanted kids; she didn't. You were religious; she wasn't. You had different life goals and visions for the future. But you didn't talk about these early on. By the time they surfaced, you were already in love.",
      "Mistake_Lesson": "Know the dealbreakers before you fall. It saves heartbreak.",
      "Mistake_Tag": "Compatibility"
    },
    "Mistake76": {
      "Mistake_Title": "Using Jealousy to Test Her Love",
      "Mistake_Details": "You told her you went out with an ex to see if she'd get jealous. You flirted with someone else to make her jealous. You thought jealousy meant she cared. But you were creating insecurity, not testing love.",
      "Mistake_Lesson": "If you need to test her love, she's not the problem — your insecurity is.",
      "Mistake_Tag": "Insecurity"
    },
    "Mistake77": {
      "Mistake_Title": "Not Having Your Own Interests Outside the Relationship",
      "Mistake_Details": "Her hobbies became your hobbies. Her friends became your friends. Her life became your life. You had no identity separate from her. When the relationship ended, you had nothing of your own left.",
      "Mistake_Lesson": "Maintain your own interests. Your individuality keeps the relationship alive.",
      "Mistake_Tag": "Identity"
    },
    "Mistake78": {
      "Mistake_Title": "Holding Grudges and Never Fully Forgiving",
      "Mistake_Details": "She apologized, and you said you forgave her, but you brought it up in every fight. You kept the offense alive and stored it as ammunition. You said you forgave but didn't actually move past it.",
      "Mistake_Lesson": "Forgive or leave. Don't torture both of you with half-measures.",
      "Mistake_Tag": "Forgiveness"
    },
    "Mistake79": {
      "Mistake_Title": "Not Knowing the Difference Between Love and Attachment",
      "Mistake_Details": "You thought you loved her, but really you were attached to the idea of having someone. You were afraid of the pain of losing her, not because you loved her, but because you feared being alone. That's not love.",
      "Mistake_Lesson": "Love is wanting her to be happy. Attachment is needing her to fill your void.",
      "Mistake_Tag": "Love"
    },
    "Mistake80": {
      "Mistake_Title": "Dismissing Her Concerns Because 'You're Being Ridiculous'",
      "Mistake_Details": "She brought up something that bothered her, and instead of listening, you told her she was being ridiculous or too sensitive. You made her feel like her concerns were invalid. That shut her down.",
      "Mistake_Lesson": "If it bothers her, it's valid — even if it doesn't make sense to you.",
      "Mistake_Tag": "Validation"
    },
    "Mistake81": {
      "Mistake_Title": "Not Investing in Quality Time",
      "Mistake_Details": "You were together, but you weren't really present. You scrolled on your phone, watched TV, or checked out mentally. You thought presence meant being in the same room. But quality time requires actual attention.",
      "Mistake_Lesson": "Presence means undivided attention. Put the phone down.",
      "Mistake_Tag": "Presence"
    },
    "Mistake82": {
      "Mistake_Title": "Expecting Her to Forgive Immediately",
      "Mistake_Details": "You hurt her, apologized, and expected her to move on right away. But healing takes time. You got frustrated with her 'bringing it up' when she was still processing the hurt. You wanted forgiveness without letting her feel her feelings.",
      "Mistake_Lesson": "Forgiveness isn't instant. Respect her healing timeline.",
      "Mistake_Tag": "Patience"
    },
    "Mistake83": {
      "Mistake_Title": "Not Recognizing When the Relationship Became One-Sided",
      "Mistake_Details": "You were doing all the work. You planned dates, you started conversations, you initiated physical affection, you fixed conflicts. She just received. But you didn't acknowledge that it was one-sided because you hoped it would change.",
      "Mistake_Lesson": "If you're the only one trying, that's not a partnership.",
      "Mistake_Tag": "Effort"
    },
    "Mistake84": {
      "Mistake_Title": "Using Her Against Her",
      "Mistake_Details": "She told you her insecurities, and in fights, you weaponized them. She told you what hurt her, and you used it to hurt her more. You used her vulnerabilities against her.",
      "Mistake_Lesson": "What she trusts you with is sacred. Never use it as ammunition.",
      "Mistake_Tag": "Respect"
    },
    "Mistake85": {
      "Mistake_Title": "Not Setting a Timeline for the Relationship",
      "Mistake_Details": "You were together for years without discussing the future. Did you want to move in? Get married? Have kids? You just drifted along without any real direction. She got frustrated waiting for clarity that never came.",
      "Mistake_Lesson": "Relationships need direction. Discuss where you're heading.",
      "Mistake_Tag": "Communication"
    },
    "Mistake86": {
      "Mistake_Title": "Making Your Insecurities Her Responsibility to Manage",
      "Mistake_Details": "You were insecure, so you needed constant reassurance from her. You checked in constantly, needed her validation, and made her responsible for managing your feelings. That's exhausting for her.",
      "Mistake_Lesson": "Work on your insecurities. Don't make them her job.",
      "Mistake_Tag": "Self-Work"
    },
    "Mistake87": {
      "Mistake_Title": "Not Calling Out Disrespect in the Moment",
      "Mistake_Details": "She said something disrespectful, and you let it slide. Then she did it again. By not addressing it immediately, you taught her that disrespecting you had no consequences.",
      "Mistake_Lesson": "Set boundaries immediately. Otherwise, she'll keep crossing them.",
      "Mistake_Tag": "Boundaries"
    },
    "Mistake88": {
      "Mistake_Title": "Forcing Intimacy When She Wasn't Interested",
      "Mistake_Details": "She wasn't in the mood, and you kept pushing. You made advances she said no to. You didn't respect when she wasn't interested. That's not okay.",
      "Mistake_Lesson": "No means no. Respect her body and her choices always.",
      "Mistake_Tag": "Consent"
    },
    "Mistake89": {
      "Mistake_Title": "Not Understanding Your Own Emotional Patterns",
      "Mistake_Details": "You repeated the same relationship mistakes with different people. You didn't understand your own triggers, your attachment style, or why you chose the partners you did. You never did the inner work.",
      "Mistake_Lesson": "Understand yourself first. Then choose better partners.",
      "Mistake_Tag": "Self-Awareness"
    },
    "Mistake90": {
      "Mistake_Title": "Treating Disagreements Like You're Enemies",
      "Mistake_Details": "When you disagreed, you treated it like a battle. You had to win. You were combative instead of collaborative. You forgot that you're on the same team.",
      "Mistake_Lesson": "You're partners, not opponents. Approach conflicts as a team, not a fight.",
      "Mistake_Tag": "Conflict Resolution"
    },
    "Mistake91": {
      "Mistake_Title": "Not Appreciating Her Vulnerability",
      "Mistake_Details": "She opened up and was vulnerable with you, and you made fun of her, dismissed her feelings, or used it against her. You showed her that being vulnerable wasn't safe. So she shut down.",
      "Mistake_Lesson": "Vulnerability is a gift. Handle it with care.",
      "Mistake_Tag": "Safety"
    },
    "Mistake92": {
      "Mistake_Title": "Staying in Contact With Exes",
      "Mistake_Details": "You told her you were 'just friends' with your exes, but you weren't. You texted them, hung out with them, kept them on the back burner. She felt threatened, and she had every right to.",
      "Mistake_Lesson": "If she's uncomfortable with your exes, there's probably a reason.",
      "Mistake_Tag": "Loyalty"
    },
    "Mistake93": {
      "Mistake_Title": "Not Taking Accountability for Your Mental Health",
      "Mistake_Details": "You had anxiety, depression, or trauma, and you made it her job to manage it. You lashed out when triggered and expected her to understand. Your mental health isn't an excuse for bad behavior.",
      "Mistake_Lesson": "Get help for your mental health. Your partner isn't your therapist.",
      "Mistake_Tag": "Responsibility"
    },
    "Mistake94": {
      "Mistake_Title": "Comparing Her to Other Women",
      "Mistake_Details": "You mentioned how other women were prettier, funnier, or more interesting. You didn't realize you were telling her she wasn't enough. Those comparisons damaged her self-esteem and her trust in you.",
      "Mistake_Lesson": "Keep other women out of your conversations about her.",
      "Mistake_Tag": "Respect"
    },
    "Mistake95": {
      "Mistake_Title": "Not Discussing How to Handle Conflict Before It Happens",
      "Mistake_Details": "You never talked about how you both prefer to handle disagreements. When conflict came, you defaulted to your own style. She needed to cool off; you needed to talk immediately. You clashed.",
      "Mistake_Lesson": "Discuss conflict styles early. Know how to fight fair together.",
      "Mistake_Tag": "Communication"
    },
    "Mistake96": {
      "Mistake_Title": "Not Accepting That Sometimes Love Isn't Enough",
      "Mistake_Details": "You loved each other, but you were incompatible. You wanted different things, were at different life stages, or just weren't right for each other. But you thought love could fix it. Sometimes it can't.",
      "Mistake_Lesson": "Love is necessary but not sufficient. Compatibility matters too.",
      "Mistake_Tag": "Reality"
    },
    "Mistake97": {
      "Mistake_Title": "Projecting Your Fears Onto Her",
      "Mistake_Details": "You were afraid she'd cheat because you had cheated before. You were afraid she'd leave because someone left you. You projected your fears onto her and made her pay for your past.",
      "Mistake_Lesson": "Your fears are yours to work through, not hers to manage.",
      "Mistake_Tag": "Projection"
    },
    "Mistake98": {
      "Mistake_Title": "Not Knowing When to Walk Away",
      "Mistake_Details": "You stayed way too long. The relationship was toxic, unhealthy, or just wrong — but you kept trying, kept hoping, kept investing. You didn't know that sometimes the most loving thing is to let go.",
      "Mistake_Lesson": "Sometimes loving her means leaving. Know when to go.",
      "Mistake_Tag": "Wisdom"
    },
    "Mistake99": {
      "Mistake_Title": "Blaming Her for Your Own Unhappiness in the Relationship",
      "Mistake_Details": "You weren't happy, and you made it her fault. But she didn't make you unhappy — the relationship did. Or more accurately, your expectations and choices did. You gave her responsibility for your emotional state.",
      "Mistake_Lesson": "You're responsible for your own happiness. She's not your therapist.",
      "Mistake_Tag": "Responsibility"
    },
    "Mistake100": {
      "Mistake_Title": "Not Learning From Past Relationship Mistakes",
      "Mistake_Details": "You repeated the same patterns with every person. You had the same fights, made the same choices, and created the same problems. You didn't reflect, didn't heal, and didn't grow.",
      "Mistake_Lesson": "Each relationship is a lesson. Learn it, or repeat it.",
      "Mistake_Tag": "Growth"
    },
    "Mistake101": {
      "Mistake_Title": "Guilt-Tripping Her Into Staying or Forgiving",
      "Mistake_Details": "When she wanted to leave or needed space, you made her feel responsible for your pain. You threatened to hurt yourself, got drunk, or acted devastated to keep her from leaving. That's emotional manipulation.",
      "Mistake_Lesson": "If she wants to leave, let her. Guilt-tripping keeps you both trapped.",
      "Mistake_Tag": "Manipulation"
    },
    "Mistake102": {
      "Mistake_Title": "Not Recognizing Emotional Cheating as a Betrayal",
      "Mistake_Details": "You had an emotional connection with someone else — deep conversations, flirtation, emotional intimacy. You told yourself it was 'nothing physical.' But emotional cheating is still cheating and still a betrayal.",
      "Mistake_Lesson": "Protect the emotional intimacy in your relationship first.",
      "Mistake_Tag": "Loyalty"
    },
    "Mistake103": {
      "Mistake_Title": "Expecting Her to Change Who She Is After the Relationship Starts",
      "Mistake_Details": "You accepted who she was, dated her, got comfortable — then asked her to change. Her family was too loud, her job wasn't ambitious enough, her style wasn't your style. You wanted her to transform into your ideal.",
      "Mistake_Lesson": "Accept her as she is. If you can't, don't date her.",
      "Mistake_Tag": "Acceptance"
    },
    "Mistake104": {
      "Mistake_Title": "Not Recognizing Passive-Aggressive Behavior",
      "Mistake_Details": "She didn't say she was mad; she just acted cold. She didn't tell you something was wrong; she just withdrew. You were left confused, trying to decode her behavior. Passive aggression isn't communication — it's punishment.",
      "Mistake_Lesson": "If she won't use words, that's a problem that needs addressing.",
      "Mistake_Tag": "Communication"
    },
    "Mistake105": {
      "Mistake_Title": "Making the Relationship Your Entire Identity",
      "Mistake_Details": "Everything about you was tied to the relationship. Your worth, your status, your identity — all of it came from being in the relationship. When it ended, you didn't know who you were.",
      "Mistake_Lesson": "You are whole on your own. The relationship enhances that, not creates it.",
      "Mistake_Tag": "Identity"
    },
    "Mistake106": {
      "Mistake_Title": "Not Asking for What You Need Directly",
      "Mistake_Details": "You wanted her to be more affectionate, but you never said it. You hoped she'd surprise you, hoped she'd figure it out. Instead, you got resentful that she wasn't meeting needs you never expressed.",
      "Mistake_Lesson": "Ask for what you need. She can't read your mind.",
      "Mistake_Tag": "Communication"
    },
    "Mistake107": {
      "Mistake_Title": "Disrespecting Her In Front of Others",
      "Mistake_Details": "You made jokes at her expense in front of friends. You undermined her in public. You didn't defend her when someone else disrespected her. Public disrespect is worse than private disrespect.",
      "Mistake_Lesson": "If you respect her, you defend her everywhere — not just in private.",
      "Mistake_Tag": "Respect"
    },
    "Mistake108": {
      "Mistake_Title": "Not Noticing When You've Become the Problem",
      "Mistake_Details": "You blamed her for everything — she was too needy, too emotional, too demanding. But you never looked in the mirror. You were the one being dismissive, unavailable, and unkind. You were the problem.",
      "Mistake_Lesson": "Sometimes the problem isn't her. It's you.",
      "Mistake_Tag": "Self-Awareness"
    },
    "Mistake109": {
      "Mistake_Title": "Using Substance Abuse to Avoid Relationship Problems",
      "Mistake_Details": "Instead of dealing with conflict or unhappiness, you got drunk or high. You numbed yourself instead of addressing issues. Avoidance through substances destroys relationships.",
      "Mistake_Lesson": "Face your problems sober. Running away doesn't fix anything.",
      "Mistake_Tag": "Responsibility"
    },
    "Mistake110": {
      "Mistake_Title": "Not Understanding That Actions Speak Louder Than Promises",
      "Mistake_Details": "You promised to change, promised to be better, promised things would be different. But you kept doing the same things. Your words meant nothing because your actions showed the truth.",
      "Mistake_Lesson": "Show, don't tell. Words without action are lies.",
      "Mistake_Tag": "Integrity"
    },

    "Mistake111": {
      "Mistake_Title": "Not Taking Responsibility for Your Own Growth",
      "Mistake_Details": "You expected her to help you become a better person. Instead of working on yourself, you looked to her for motivation, validation, and transformation. Your growth is your job, not hers.",
      "Mistake_Lesson": "Grow yourself. A partner can support, but she can't do the work for you.",
      "Mistake_Tag": "Self-Development"
    },
    "Mistake112": {
      "Mistake_Title": "Creating Unnecessary Drama to Keep Things Exciting",
      "Mistake_Details": "Stable, peaceful relationships felt boring to you. So you'd start fights, bring up old issues, or create conflict just to feel something. You mistook turbulence for passion.",
      "Mistake_Lesson": "Healthy relationships are calm. If you need chaos, work on yourself.",
      "Mistake_Tag": "Stability"
    },
    "Mistake113": {
      "Mistake_Title": "Not Having Hard Conversations About Religion or Values",
      "Mistake_Details": "You had different beliefs — about God, politics, how to live life. But you avoided talking about it because conflict felt uncomfortable. Eventually, these fundamental differences became dealbreakers.",
      "Mistake_Lesson": "Know her values early. Compatibility in core beliefs matters.",
      "Mistake_Tag": "Compatibility"
    },
    "Mistake114": {
      "Mistake_Title": "Assuming She Owes You Emotional Labor",
      "Mistake_Details": "You expected her to always be available to listen, support, and comfort you. When she was tired or needed her own space, you felt betrayed. Her emotional energy isn't your personal resource.",
      "Mistake_Lesson": "Her energy is hers. Don't treat it like you're entitled to it.",
      "Mistake_Tag": "Respect"
    },
    "Mistake115": {
      "Mistake_Title": "Not Recognizing Gaslighting When It's Happening",
      "Mistake_Details": "She'd deny things she clearly said or did. She'd make you question your own memory and perception. You felt crazy, but you didn't realize she was manipulating you on purpose.",
      "Mistake_Lesson": "Trust your reality. If she makes you doubt it constantly, that's abuse.",
      "Mistake_Tag": "Red Flags"
    },
    "Mistake116": {
      "Mistake_Title": "Expecting Her to Help You Process Your Trauma",
      "Mistake_Details": "You dumped all your emotional baggage on her and expected her to help you sort through it. You made her your unpaid therapist. That's not fair to her.",
      "Mistake_Lesson": "Get professional help for your trauma. She's not equipped to heal you.",
      "Mistake_Tag": "Boundaries"
    },
    "Mistake117": {
      "Mistake_Title": "Not Respecting Her No",
      "Mistake_Details": "When she said no to something — a date idea, a sexual advance, a commitment — you kept pushing. You tried to negotiate or convince her to change her mind. Her no meant no.",
      "Mistake_Lesson": "No is a complete sentence. Respect it the first time.",
      "Mistake_Tag": "Consent"
    },
    "Mistake118": {
      "Mistake_Title": "Treating Her Like She's Your Mother",
      "Mistake_Details": "You expected her to take care of you — clean for you, cook for you, manage your life. You acted like a child who needed managing. She became your caretaker, not your partner.",
      "Mistake_Lesson": "Be an adult. She's your partner, not your mother.",
      "Mistake_Tag": "Maturity"
    },
    "Mistake119": {
      "Mistake_Title": "Not Admitting When You're Jealous or Insecure",
      "Mistake_Details": "Instead of being honest about your jealousy, you made accusations or became cold. You took your insecurity out on her instead of owning it. She couldn't help you if she didn't know what was really wrong.",
      "Mistake_Lesson": "Be vulnerable. Say 'I'm feeling insecure.' Don't act it out.",
      "Mistake_Tag": "Vulnerability"
    },
    "Mistake120": {
      "Mistake_Title": "Not Setting Financial Boundaries Early",
      "Mistake_Details": "She asked to borrow money and you gave it. She asked again, and you gave it again. Before you knew it, you'd loaned her thousands and resented her for it. Financial imbalance breeds resentment.",
      "Mistake_Lesson": "Money conversations matter. Set boundaries early.",
      "Mistake_Tag": "Boundaries"
    },
    "Mistake121": {
      "Mistake_Title": "Confusing Familiarity With Love",
      "Mistake_Details": "You'd been together for so long that comfortable felt like love. But you weren't in love — you were just used to each other. You stayed because it was easy, not because it was right.",
      "Mistake_Lesson": "Comfort isn't love. Make sure you have both.",
      "Mistake_Tag": "Love"
    },
    "Mistake122": {
      "Mistake_Title": "Not Showing Physical Affection Consistently",
      "Mistake_Details": "You were affectionate at the beginning, but over time it faded. You rarely kissed her, hugged her, or touched her. She felt disconnected and unloved, even though you 'loved' her.",
      "Mistake_Lesson": "Physical affection is an ongoing need, not just a beginning-stage thing.",
      "Mistake_Tag": "Intimacy"
    },
    "Mistake123": {
      "Mistake_Title": "Expecting Her to Fit Into Your Life Without Compromise",
      "Mistake_Details": "She had to adjust to your schedule, your friends, your family, your hobbies. You didn't bend. A relationship requires both people to shift and make space.",
      "Mistake_Lesson": "Relationships are about creating a shared life, not fitting someone into yours.",
      "Mistake_Tag": "Compromise"
    },
    "Mistake124": {
      "Mistake_Title": "Not Discussing Family Planning Early Enough",
      "Mistake_Details": "One of you wanted kids; the other didn't. You didn't discuss it until years in. By then, resentment had built because one person felt their future was being stolen.",
      "Mistake_Lesson": "Discuss whether you want kids before you get serious. It's a dealbreaker.",
      "Mistake_Tag": "Compatibility"
    },
    "Mistake125": {
      "Mistake_Title": "Acting Like a Martyr in the Relationship",
      "Mistake_Details": "You constantly reminded her of everything you sacrificed, everything you gave up for her. You threw it in her face during fights. That's not love — that's keeping score and weaponizing your choices.",
      "Mistake_Lesson": "If you're making sacrifices you resent, that's on you. Don't use them as weapons.",
      "Mistake_Tag": "Resentment"
    },
    "Mistake126": {
      "Mistake_Title": "Not Having Your Own Coping Mechanisms",
      "Mistake_Details": "When you were stressed, you relied entirely on her to help you decompress. You had no hobbies, no outlets, no way to self-soothe. You made her responsible for your emotional well-being.",
      "Mistake_Lesson": "Have your own ways to manage stress. Don't outsource your coping.",
      "Mistake_Tag": "Independence"
    },
    "Mistake127": {
      "Mistake_Title": "Dismissing Her Accomplishments as Unimportant",
      "Mistake_Details": "She got a promotion, finished a project, hit a personal goal — but you didn't make a big deal about it. You didn't celebrate her. She felt like her wins didn't matter to you.",
      "Mistake_Lesson": "Celebrate her. Show that her accomplishments matter to you.",
      "Mistake_Tag": "Support"
    },
    "Mistake128": {
      "Mistake_Title": "Not Knowing Your Love Language or Hers",
      "Mistake_Details": "She needed quality time, but you showed love through gifts. She needed words of affirmation, but you thought your presence was enough. You were both speaking different languages and feeling unheard.",
      "Mistake_Lesson": "Learn her love language. Show love in the way she receives it.",
      "Mistake_Tag": "Communication"
    },
    "Mistake129": {
      "Mistake_Title": "Treating Breakups Like You Get Another Chance",
      "Mistake_Details": "You'd break up, wait a week, and reach out like nothing happened. You expected her to take you back. You didn't respect the breakup because you didn't think it was final.",
      "Mistake_Lesson": "When she leaves, she leaves. Respect that.",
      "Mistake_Tag": "Respect"
    },
    "Mistake130": {
      "Mistake_Title": "Not Having Difficult Conversations About Sexual Compatibility",
      "Mistake_Details": "You had different needs — different frequencies, different preferences, different boundaries. But you never talked about it openly. Sexual incompatibility silently destroyed the relationship.",
      "Mistake_Lesson": "Discuss sex openly. Sexual compatibility matters.",
      "Mistake_Tag": "Communication"
    },
    "Mistake131": {
      "Mistake_Title": "Weaponizing Her Vulnerabilities in Arguments",
      "Mistake_Details": "She opened up about her insecurities. Later, in a fight, you brought them up to hurt her. You used her trust against her. That's not fair fighting — that's abuse.",
      "Mistake_Lesson": "What she trusts you with stays safe. Never weaponize intimacy.",
      "Mistake_Tag": "Trust"
    },
    "Mistake132": {
      "Mistake_Title": "Not Respecting Her Professional Boundaries",
      "Mistake_Details": "You'd call her constantly while she was at work. You got upset when she couldn't text back immediately. You didn't respect that she had a job and couldn't be available on your timeline.",
      "Mistake_Lesson": "Respect her work time. She has a life outside of you.",
      "Mistake_Tag": "Respect"
    },
    "Mistake133": {
      "Mistake_Title": "Expecting Her to Want Sex When You Want It",
      "Mistake_Details": "Your desire for sex didn't align with hers. When she wasn't interested, you got upset or made her feel guilty. You didn't respect that her body is hers, and she gets to decide.",
      "Mistake_Lesson": "Consent is continuous. No means no, always.",
      "Mistake_Tag": "Consent"
    },
    "Mistake134": {
      "Mistake_Title": "Criticizing Her Body or Appearance",
      "Mistake_Details": "You made comments about her weight, her clothes, her hair. You meant it as 'helpful,' but it made her feel inadequate and unattractive — to you, the person who should make her feel beautiful.",
      "Mistake_Lesson": "Never criticize her body. Especially not to her face.",
      "Mistake_Tag": "Respect"
    },
    "Mistake135": {
      "Mistake_Title": "Not Asking Her About Her Day or Her Life",
      "Mistake_Details": "Conversations were always about you. Your problems, your work, your interests. You never asked about her day or showed genuine interest in her life. She felt invisible.",
      "Mistake_Lesson": "Show interest. Ask about her. Listen to the answer.",
      "Mistake_Tag": "Attention"
    },
    "Mistake136": {
      "Mistake_Title": "Making Promises You Can't Keep",
      "Mistake_Details": "You promised the world — trips you couldn't afford, commitments you couldn't make, a future you weren't sure about. When you didn't follow through, she lost trust in your word.",
      "Mistake_Lesson": "Only promise what you can deliver. Your word is your bond.",
      "Mistake_Tag": "Integrity"
    },
    "Mistake137": {
      "Mistake_Title": "Not Recognizing When She's Losing Interest",
      "Mistake_Details": "She was pulling away, her texts got shorter, she seemed less engaged. But you didn't ask or address it. You ignored the signs until she finally said she wanted to leave.",
      "Mistake_Lesson": "Notice the shift. Address it before she's completely gone.",
      "Mistake_Tag": "Awareness"
    },
    "Mistake138": {
      "Mistake_Title": "Expecting Her to Be Everything to You",
      "Mistake_Details": "She was your girlfriend, your therapist, your best friend, your entertainment, your motivation. You had no one else. That's too much pressure for one person.",
      "Mistake_Lesson": "Have a full life with friends, hobbies, and support outside of her.",
      "Mistake_Tag": "Balance"
    },
    "Mistake139": {
      "Mistake_Title": "Not Taking Mental Health Seriously in the Relationship",
      "Mistake_Details": "You struggled with anxiety, depression, or other issues but refused to get help. You expected her to support you while you did nothing to help yourself. That's unfair.",
      "Mistake_Lesson": "Get professional help. Your mental health affects the relationship.",
      "Mistake_Tag": "Responsibility"
    },
    "Mistake140": {
      "Mistake_Title": "Allowing Substance Abuse to Control Your Behavior",
      "Mistake_Details": "When you drank or used, your personality changed. You became mean, absent, or unreliable. The relationship suffered because of your choices, and she couldn't fix it.",
      "Mistake_Lesson": "If substances control you, get help before entering a relationship.",
      "Mistake_Tag": "Responsibility"
    },
    "Mistake141": {
      "Mistake_Title": "Not Knowing When to Apologize Without Conditions",
      "Mistake_Details": "Your apologies always had a 'but.' 'I'm sorry, but you made me do it.' 'I'm sorry, but you're overreacting.' A real apology has no conditions.",
      "Mistake_Lesson": "Apologize fully. No 'buts.' No explanations that excuse your behavior.",
      "Mistake_Tag": "Accountability"
    },
    "Mistake142": {
      "Mistake_Title": "Expecting Her to Be Grateful for Basic Decency",
      "Mistake_Details": "You did basic things like show up or listen and expected her to be grateful. You didn't understand that basic respect and attention aren't gifts — they're the bare minimum.",
      "Mistake_Lesson": "Show up. Listen. That's what you should do. Don't expect a medal for it.",
      "Mistake_Tag": "Expectations"
    },
    "Mistake143": {
      "Mistake_Title": "Not Having Standards for How You're Treated Either",
      "Mistake_Details": "You accepted disrespect from her because you didn't think you deserved better. You stayed in a relationship where you weren't valued, not realizing you deserve respect too.",
      "Mistake_Lesson": "You deserve to be treated well. Don't stay where you're not valued.",
      "Mistake_Tag": "Self-Worth"
    },
    "Mistake144": {
      "Mistake_Title": "Refusing to Admit the Relationship Was Wrong",
      "Mistake_Details": "Deep down, you knew it was toxic, unhealthy, or just wrong. But you couldn't admit it. Admitting it meant admitting you made a mistake, and that felt like failure.",
      "Mistake_Lesson": "Staying in a wrong relationship is the real failure. Leaving is strength.",
      "Mistake_Tag": "Honesty"
    },
    "Mistake145": {
      "Mistake_Title": "Not Prioritizing Her Happiness",
      "Mistake_Details": "You made decisions based on what made you happy, what was convenient for you, what served you. Her happiness didn't factor in. That's selfish.",
      "Mistake_Lesson": "In a partnership, her happiness should matter as much as yours.",
      "Mistake_Tag": "Partnership"
    },
    "Mistake146": {
      "Mistake_Title": "Creating an Us-vs-Them Dynamic With Her Family",
      "Mistake_Details": "You positioned yourself as against her family. You got mad if she wanted to see them, criticized them constantly, or made her choose. You isolated her.",
      "Mistake_Lesson": "Her family will always be part of her life. Accept that.",
      "Mistake_Tag": "Respect"
    },
    "Mistake147": {
      "Mistake_Title": "Not Understanding That She's Not Your Reward",
      "Mistake_Details": "You treated the relationship like something you 'earned' for being good or working hard. But she's not a prize. She's a person who deserves to choose you freely.",
      "Mistake_Lesson": "She's not a reward for your good behavior. She's a choice.",
      "Mistake_Tag": "Respect"
    },
    "Mistake148": {
      "Mistake_Title": "Expecting Her to Change Her Values for You",
      "Mistake_Details": "She didn't want marriage or kids. You said you were fine with it, but deep down, you expected her to change her mind. When she didn't, you felt betrayed.",
      "Mistake_Lesson": "Accept her as she is. Don't date expecting her to transform.",
      "Mistake_Tag": "Acceptance"
    },
    "Mistake149": {
      "Mistake_Title": "Not Celebrating Milestones or Special Moments",
      "Mistake_Details": "Anniversaries, birthdays, achievements — you forgot or didn't make a big deal about them. She felt like these moments didn't matter to you. They did to her.",
      "Mistake_Lesson": "Remember and celebrate the moments that matter to her.",
      "Mistake_Tag": "Attention"
    },
    "Mistake150": {
      "Mistake_Title": "Refusing to Evolve or Grow Within the Relationship",
      "Mistake_Details": "She changed, she grew, she evolved — but you stayed stagnant. You refused to work on yourself or adapt to her growth. Eventually, you grew apart.",
      "Mistake_Lesson": "Grow together. If you're not evolving, the relationship stalls.",
      "Mistake_Tag": "Growth"
    },
    "Mistake151": {
      "Mistake_Title": "Not Having a Plan for Your Future Together",
      "Mistake_Details": "You just drifted along with no real plan. Where were you heading? Did you want to move in together, get married, travel? You never discussed it, so she felt like you weren't serious.",
      "Mistake_Lesson": "Have a vision for the future. Discuss where you're headed.",
      "Mistake_Tag": "Planning"
    },
    "Mistake152": {
      "Mistake_Title": "Allowing Resentment to Build Without Addressing It",
      "Mistake_Details": "Small annoyances turned into big resentments because you never addressed them. By the time you finally spoke up, you were angry and the damage was done.",
      "Mistake_Lesson": "Address issues early before resentment takes over.",
      "Mistake_Tag": "Communication"
    },
    "Mistake153": {
      "Mistake_Title": "Not Understanding That Vulnerability Is Strength",
      "Mistake_Details": "You thought being vulnerable was weak. So you stayed closed off, never let her in, never showed your true self. She couldn't love the real you because she never got to know you.",
      "Mistake_Lesson": "Vulnerability builds intimacy. Being open is brave, not weak.",
      "Mistake_Tag": "Vulnerability"
    },
    "Mistake154": {
      "Mistake_Title": "Making It All About What You Need",
      "Mistake_Details": "Every conversation circled back to you. Every decision was about your needs. She was just a supporting character in your story, not a main character in her own.",
      "Mistake_Lesson": "Make space for her needs. Relationships are about both of you.",
      "Mistake_Tag": "Balance"
    },
    "Mistake155": {
      "Mistake_Title": "Not Recognizing Her Worth Before It's Too Late",
      "Mistake_Details": "You took her for granted. You didn't appreciate her until she was gone. Only then did you realize what you'd lost.",
      "Mistake_Lesson": "Appreciate her now. Don't wait until she leaves to see her value.",
      "Mistake_Tag": "Appreciation"
    },
    "Mistake156": {
      "Mistake_Title": "Expecting Her to Solve Problems You Created",
      "Mistake_Details": "You made a mess of something — at work, with friends, in your family — and expected her to help you fix it. Your problems became her problems.",
      "Mistake_Lesson": "Own your messes. Don't dump them on her to solve.",
      "Mistake_Tag": "Responsibility"
    },
    "Mistake157": {
      "Mistake_Title": "Not Setting Emotional Availability Standards",
      "Mistake_Details": "She was emotionally unavailable — cold, distant, unresponsive to your needs — but you stayed anyway. You hoped she'd change. Emotional unavailability doesn't improve without work.",
      "Mistake_Lesson": "Don't date someone hoping they'll become emotionally available. They won't.",
      "Mistake_Tag": "Standards"
    },
    "Mistake158": {
      "Mistake_Title": "Treating Commitment Like a Trap Instead of a Gift",
      "Mistake_Details": "You viewed commitment as losing your freedom instead of gaining her. You acted resentful about being with one person. That made her feel like a burden.",
      "Mistake_Lesson": "If you see commitment as a trap, you're with the wrong person.",
      "Mistake_Tag": "Mindset"
    },
    "Mistake159": {
      "Mistake_Title": "Not Being Willing to Fight for the Relationship",
      "Mistake_Details": "When things got hard, you gave up. You didn't try to fix it, didn't have difficult conversations, didn't put in effort. You just let it die.",
      "Mistake_Lesson": "Healthy relationships require effort. Show up when things get hard.",
      "Mistake_Tag": "Effort"
    },
    "Mistake160": {
      "Mistake_Title": "Never Truly Forgiving Yourself for Your Mistakes",
      "Mistake_Details": "You made a mistake in the relationship, and you never forgave yourself. You carried guilt, shame, and self-punishment into every interaction with her. That energy poisoned the relationship.",
      "Mistake_Lesson": "Forgive yourself. Work to be better. Don't carry the shame forever.",
      "Mistake_Tag": "Self-Compassion"
    }







    
  }
}
