{
  "DatingMistake_Archive": {
    "Mistake1": {
      "Mistake_Title": "Falling for Potential, Not Reality",
      "Mistake_Details": "You saw what he could be, not who he actually was. You kept hoping he'd grow, change, or finally commit — but people only change if they truly want to. Falling for potential often leaves you stuck in a fantasy, not a relationship.",
      "Mistake_Lesson": "Love who he is today, not who you hope he'll become.",
      "Mistake_Tag": "Expectations"
    },
    "Mistake2": {
      "Mistake_Title": "Ignoring Red Flags Because of Chemistry",
      "Mistake_Details": "The spark was strong, but the signs were louder. You laughed off the excuses, the mixed signals, the inconsistencies — because the attraction felt so real. Chemistry is exciting, but it's not a replacement for compatibility or respect.",
      "Mistake_Lesson": "If you have to explain away bad behavior, it's not love — it's denial.",
      "Mistake_Tag": "Red Flags"
    },
    "Mistake3": {
      "Mistake_Title": "Texting Like You're Already His Girlfriend",
      "Mistake_Details": "You gave emotional availability before he gave commitment. Over-texting, over-sharing, and over-caring too soon can make you feel drained when things don't progress. Emotional investment should match effort and clarity — not assumptions.",
      "Mistake_Lesson": "Match energy, not fantasy. Let him earn your access.",
      "Mistake_Tag": "Boundaries"
    },
    "Mistake4": {
      "Mistake_Title": "Moving Into Bed Too Soon",
      "Mistake_Details": "You slept with him early thinking it would deepen the connection or lock him in. But giving up sex too quickly without commitment lowers your value in his eyes. He loses the incentive to invest because he already got what he came for.",
      "Mistake_Lesson": "Make him earn intimacy. Your body is not a bargaining chip for commitment.",
      "Mistake_Tag": "Pacing"
    },
    "Mistake5": {
      "Mistake_Title": "Settling for Being His Option Instead of His Priority",
      "Mistake_Details": "He said 'I like you, but...' and you stayed anyway. You became his backup plan while he kept looking. You made yourself available whenever he wanted, and he treated you like you had nowhere else to be.",
      "Mistake_Lesson": "You're not an option. If he doesn't make you his priority, make yourself your own priority.",
      "Mistake_Tag": "Self-Worth"
    },
    "Mistake6": {
      "Mistake_Title": "Changing Yourself to Fit His Preferences",
      "Mistake_Details": "He liked girls a certain way, so you became that. You dyed your hair, changed your style, ditched your hobbies, softened your personality. But the woman he fell for was a version of you, not the real you.",
      "Mistake_Lesson": "Your authenticity is your power. Don't shrink to fit someone else's ideal.",
      "Mistake_Tag": "Identity"
    },
    "Mistake7": {
      "Mistake_Title": "Talking Too Much and Observing Too Little",
      "Mistake_Details": "You were so excited that you overshared everything on the first few dates. You didn't ask questions, didn't observe his behavior, didn't give yourself time to figure out if he was actually good for you.",
      "Mistake_Lesson": "Ask questions. Observe more than you talk. Let him show you who he is.",
      "Mistake_Tag": "Awareness"
    },
    "Mistake8": {
      "Mistake_Title": "Thinking You Can Change Him",
      "Mistake_Details": "He had habits, attitudes, or behaviors you didn't like — but you thought love and time would fix him. You believed you were special enough to transform him into the man you wanted.",
      "Mistake_Lesson": "Don't date a man with the intention of changing him. Accept him as he is or leave.",
      "Mistake_Tag": "Acceptance"
    },
    "Mistake9": {
      "Mistake_Title": "Losing Yourself in the Relationship",
      "Mistake_Details": "Your entire life became about him. Your friends took a backseat, your goals paused, your hobbies disappeared. You molded yourself around his life and forgot who you were outside of being his girlfriend.",
      "Mistake_Lesson": "Maintain your identity. A healthy relationship enhances your life, not replaces it.",
      "Mistake_Tag": "Independence"
    },
    "Mistake10": {
      "Mistake_Title": "Ignoring His Mixed Signals and Hoping for Clarity",
      "Mistake_Details": "He was hot and cold — sometimes he was all-in, sometimes he disappeared. Instead of recognizing this as a red flag and walking away, you stayed hoping he'd finally commit to you consistently.",
      "Mistake_Lesson": "Inconsistency is a message. A man who loves you is consistent.",
      "Mistake_Tag": "Red Flags"
    },
"Mistake11": {
      "Mistake_Title": "Accepting Breadcrumbs Instead of Whole Commitment",
      "Mistake_Details": "He texts you sporadically, calls when it's convenient for him, and only makes plans last-minute. You accept these crumbs because you're hoping he'll eventually commit. But inconsistent attention is a sign he's not that invested.",
      "Mistake_Lesson": "A man who wants you will make time for you. Breadcrumbs aren't love.",
      "Mistake_Tag": "Standards"
    },
    "Mistake12": {
      "Mistake_Title": "Trying to Make Him Jealous to Get His Attention",
      "Mistake_Details": "You posted pictures with other men, mentioned dates, or flirted openly hoping he'd realize what he was missing. But games push good men away and attract the wrong ones.",
      "Mistake_Lesson": "Real men don't respond to games. They respond to clarity and self-respect.",
      "Mistake_Tag": "Honesty"
    },
    "Mistake13": {
      "Mistake_Title": "Investing Emotionally Before He Invests Financially",
      "Mistake_Details": "You made time for every date he suggested but he never paid or planned anything. You were emotionally all-in while he treated dating like a casual hang. Financial effort shows he values you.",
      "Mistake_Lesson": "A man who values you pays. He shows up with effort and investment.",
      "Mistake_Tag": "Effort"
    },
    "Mistake14": {
      "Mistake_Title": "Staying Silent When He Disrespects You",
      "Mistake_Details": "He said something hurtful or dismissive, and instead of calling it out, you let it slide. You told yourself it wasn't a big deal. But silence teaches him that disrespect is acceptable.",
      "Mistake_Lesson": "Speak up immediately. Your silence gives him permission.",
      "Mistake_Tag": "Boundaries"
    },
    "Mistake15": {
      "Mistake_Title": "Accepting Apologies Without Action",
      "Mistake_Details": "He hurt you, said 'I'm sorry,' and you forgave him. But he never changed the behavior. He repeated the same mistake and apologized again. Sorry without change is just manipulation.",
      "Mistake_Lesson": "Watch for change, not just words. Actions reveal truth.",
      "Mistake_Tag": "Trust"
    },
    "Mistake16": {
      "Mistake_Title": "Sleeping With Him Before You Know His Character",
      "Mistake_Details": "You were attracted and curious, so you slept with him early. But you barely knew him — his intentions, his values, his patterns. Intimacy without knowledge is vulnerability.",
      "Mistake_Lesson": "Let him earn intimacy. Know his character before you give your body.",
      "Mistake_Tag": "Pacing"
    },
    "Mistake17": {
      "Mistake_Title": "Believing His 'I Love You' Too Soon",
      "Mistake_Details": "He said 'I love you' after a few weeks, and you believed it. But words come easy. Love is shown through consistent actions, time, and sacrifice.",
      "Mistake_Lesson": "Love is a verb. Let him show it, not just say it.",
      "Mistake_Tag": "Trust"
    },
    "Mistake18": {
      "Mistake_Title": "Making Excuses for Why He's Flaking",
      "Mistake_Details": "He canceled plans last-minute, and you made excuses for him — work was crazy, he was stressed, he had family stuff. But a man who values you finds a way to show up.",
      "Mistake_Lesson": "If he wanted to be there, he would be. Stop making excuses for him.",
      "Mistake_Tag": "Reality"
    },
    "Mistake19": {
      "Mistake_Title": "Giving Him All Your Attention While He Gives You Crumbs",
      "Mistake_Details": "You were available whenever he wanted, canceled plans for him, dropped everything for his call. But he rarely did the same. Your energy was unmatched.",
      "Mistake_Lesson": "Match his energy. If he doesn't prioritize you, don't prioritize him.",
      "Mistake_Tag": "Balance"
    },
    "Mistake20": {
      "Mistake_Title": "Not Walking Away When He Showed You Who He Was",
      "Mistake_Details": "He lied to you, cheated, or treated you poorly — he showed you his character. But you stayed, thinking it was a one-time mistake. He did it again because you didn't leave.",
      "Mistake_Lesson": "Believe him the first time he shows you who he is.",
      "Mistake_Tag": "Red Flags"
    },
    "Mistake21": {
      "Mistake_Title": "Competing With Other Women Instead of Walking Away",
      "Mistake_Details": "He was texting another girl, and instead of leaving, you tried harder — looked better, acted nicer, proved you were worth more than her. You made yourself the competition.",
      "Mistake_Lesson": "Don't compete. If he's looking elsewhere, leave. You deserve undivided attention.",
      "Mistake_Tag": "Self-Worth"
    },
    "Mistake22": {
      "Mistake_Title": "Confiding in Him About Your Insecurities Too Early",
      "Mistake_Details": "You shared your deepest fears and insecurities early on. But he wasn't trustworthy, and he later used them to hurt you or control you. Vulnerability given too soon is ammunition.",
      "Mistake_Lesson": "Build trust before you're vulnerable. Let him earn your secrets.",
      "Mistake_Tag": "Boundaries"
    },
    "Mistake23": {
      "Mistake_Title": "Not Having Standards for How He Treats You",
      "Mistake_Details": "He was rude to servers, disrespectful to your friends, dismissive of your feelings. But you didn't see these as red flags because you were focused on how he treated you specifically.",
      "Mistake_Lesson": "Watch how he treats everyone. That's who he really is.",
      "Mistake_Tag": "Character"
    },
    "Mistake24": {
      "Mistake_Title": "Accepting 'Maybe' Instead of Demanding 'Yes'",
      "Mistake_Details": "He said 'I'm not sure about us,' 'I don't know what I want,' or 'Let's just see where this goes.' You stayed hoping he'd figure it out. But unclear men keep you in limbo.",
      "Mistake_Lesson": "If he's unsure about you, be sure about yourself. Leave.",
      "Mistake_Tag": "Clarity"
    },
    "Mistake25": {
      "Mistake_Title": "Paying for Dates to Prove You're Independent",
      "Mistake_Details": "You insisted on splitting bills or paying entirely to show you didn't need him. But this confused your investment level and diminished his sense of providing for you.",
      "Mistake_Lesson": "Let him invest. It's not about independence; it's about allowing him to show he values you.",
      "Mistake_Tag": "Investment"
    },
    "Mistake26": {
      "Mistake_Title": "Not Setting a Timeline for Exclusivity",
      "Mistake_Details": "You were acting exclusive while he was still dating other people. You never asked to define the relationship. You assumed after a certain amount of time he'd automatically commit.",
      "Mistake_Lesson": "Ask for clarity. Don't assume exclusivity without agreement.",
      "Mistake_Tag": "Communication"
    },
    "Mistake27": {
      "Mistake_Title": "Staying Because You Invested So Much Time",
      "Mistake_Details": "You'd been together for years even though it wasn't right. You didn't want to 'waste' the time you already spent. But staying because of past time is sunk cost fallacy.",
      "Mistake_Lesson": "Time already spent is gone. Don't waste more time on what's wrong.",
      "Mistake_Tag": "Decision"
    },
    "Mistake28": {
      "Mistake_Title": "Not Believing Him When He Said He Wasn't Ready",
      "Mistake_Details": "He said he didn't want marriage or kids, but you thought if he loved you enough, he'd change his mind. He meant what he said. You spent years waiting for something he never wanted.",
      "Mistake_Lesson": "Believe what he tells you about his future. Don't expect him to change.",
      "Mistake_Tag": "Honesty"
    },
    "Mistake29": {
      "Mistake_Title": "Asking Him for Constant Reassurance",
      "Mistake_Details": "You were insecure, so you needed him to constantly tell you he loved you, found you attractive, and wanted to be with you. Your neediness pushed him away.",
      "Mistake_Lesson": "Work on your insecurity. Don't make him responsible for your self-worth.",
      "Mistake_Tag": "Self-Worth"
    },
    "Mistake30": {
      "Mistake_Title": "Not Walking Away From Red Flags Early",
      "Mistake_Details": "On the second date, he was rude, controlling, or made you uncomfortable. You ignored it because the chemistry was strong. Red flags early in dating only get worse.",
      "Mistake_Lesson": "Red flags in the beginning are deal-breakers. Don't ignore them.",
      "Mistake_Tag": "Red Flags"
    },
    "Mistake31": {
      "Mistake_Title": "Doing All the Emotional Labor in the Relationship",
      "Mistake_Details": "You managed his emotions, fixed his problems, and made him feel better. He leaned on you while you carried everything alone. He became dependent on your emotional support.",
      "Mistake_Lesson": "He's a grown man. He should manage his own emotions.",
      "Mistake_Tag": "Boundaries"
    },
    "Mistake32": {
      "Mistake_Title": "Accepting Half-Efforts and Calling Them Love",
      "Mistake_Details": "He did the bare minimum — occasionally texted, showed up when convenient, barely planned anything — and you told yourself that was enough. But enough isn't love.",
      "Mistake_Lesson": "Love shows up consistently. Half-efforts aren't acceptable.",
      "Mistake_Tag": "Standards"
    },
    "Mistake33": {
      "Mistake_Title": "Not Being Honest About Your Own Intentions",
      "Mistake_Details": "You wanted commitment, but you pretended to be cool with casual dating hoping he'd develop feelings. You were dishonest about your needs, and it created confusion.",
      "Mistake_Lesson": "Be clear about what you want. Don't pretend to want less.",
      "Mistake_Tag": "Honesty"
    },
    "Mistake34": {
      "Mistake_Title": "Seeking Validation Through His Validation",
      "Mistake_Details": "Your worth became tied to whether he thought you were beautiful, smart, or worthy. When he withdrew validation, you felt worthless. His opinion became your identity.",
      "Mistake_Lesson": "Validate yourself. Your worth comes from within, not from him.",
      "Mistake_Tag": "Self-Worth"
    },
    "Mistake35": {
      "Mistake_Title": "Not Respecting Your Own Boundaries With Him",
      "Mistake_Details": "You said you weren't comfortable with something, but when he pushed back, you gave in. You didn't enforce your own boundaries because you prioritized his comfort.",
      "Mistake_Lesson": "Your boundaries are non-negotiable. Stand firm.",
      "Mistake_Tag": "Boundaries"
    },
    "Mistake36": {
      "Mistake_Title": "Treating His Bad Mood as Your Responsibility",
      "Mistake_Details": "When he was upset, you tried to fix it and make him feel better. You walked on eggshells, compromised your needs, and made his emotions your responsibility.",
      "Mistake_Lesson": "His mood is his responsibility. You're not responsible for managing his feelings.",
      "Mistake_Tag": "Responsibility"
    },
    "Mistake37": {
      "Mistake_Title": "Not Observing Whether He Keeps His Promises to You",
      "Mistake_Details": "He promised to call and didn't. He said he'd help with something and flaked. Small broken promises showed you his character, but you overlooked them.",
      "Mistake_Lesson": "Small promises reveal character. If he breaks them, bigger ones will too.",
      "Mistake_Tag": "Consistency"
    },
    "Mistake38": {
      "Mistake_Title": "Dismissing Your Friends' Concerns About Him",
      "Mistake_Details": "Your friends saw red flags you couldn't see. They warned you, but you defended him instead. You trusted your feelings over their perspective.",
      "Mistake_Lesson": "Listen to your friends. They see things you might miss.",
      "Mistake_Tag": "Wisdom"
    },
    "Mistake39": {
      "Mistake_Title": "Not Discussing Money and Future Financial Goals Early",
      "Mistake_Details": "You never talked about money, spending habits, or financial goals. When these issues surfaced later, you discovered you wanted different things.",
      "Mistake_Lesson": "Discuss finances early. Money compatibility matters.",
      "Mistake_Tag": "Compatibility"
    },
    "Mistake40": {
      "Mistake_Title": "Accepting Being His Secret",
      "Mistake_Details": "He didn't post you, didn't introduce you to friends, and kept the relationship private. You told yourself it was personal preference, but you were being hidden.",
      "Mistake_Lesson": "A man proud of you shows you off. If he hides you, question why.",
      "Mistake_Tag": "Red Flags"
    },
    "Mistake41": {
      "Mistake_Title": "Not Following Your Gut When Something Felt Off",
      "Mistake_Details": "Your intuition told you something was wrong — his story didn't add up, his behavior changed, something felt off. But you ignored it and believed his explanations.",
      "Mistake_Lesson": "Trust your gut. It's rarely wrong.",
      "Mistake_Tag": "Intuition"
    },
    "Mistake42": {
      "Mistake_Title": "Staying in a Relationship Out of Obligation",
      "Mistake_Details": "You felt obligated because he'd been there for you, or because you felt bad for him, or because you didn't want to hurt him. But obligation isn't love.",
      "Mistake_Lesson": "Stay because you want to, not because you feel you have to.",
      "Mistake_Tag": "Choice"
    },
    "Mistake43": {
      "Mistake_Title": "Overlooking How He Talks About Other Women",
      "Mistake_Details": "He constantly criticized other women or compared you to them. He was disrespectful about his exes or flirted openly with others. These are character flaws.",
      "Mistake_Lesson": "How he talks about women shows his respect level for women generally, including you.",
      "Mistake_Tag": "Character"
    },
    "Mistake44": {
      "Mistake_Title": "Not Taking His Lack of Effort to Meet Your Family",
      "Mistake_Details": "He kept making excuses to avoid meeting your family. He showed no interest in being integrated into your life. This suggested the relationship wasn't serious to him.",
      "Mistake_Lesson": "A man serious about you wants to meet your family and be part of your life.",
      "Mistake_Tag": "Commitment"
    },
    "Mistake45": {
      "Mistake_Title": "Adjusting Your Standards to Keep Him",
      "Mistake_Details": "Your standards said you wanted X, but he was Y, so you lowered your standards to keep him. You convinced yourself he was 'good enough.'",
      "Mistake_Lesson": "Don't lower your standards. Find someone who meets them.",
      "Mistake_Tag": "Standards"
    },
    "Mistake46": {
      "Mistake_Title": "Expecting Him to Prioritize You Over Everything",
      "Mistake_Details": "He had work, friends, and family — legitimate priorities. But you got upset if he wasn't available the moment you wanted him. You wanted to be his only focus.",
      "Mistake_Lesson": "Healthy relationships involve balance. He should have other priorities.",
      "Mistake_Tag": "Perspective"
    },
    "Mistake47": {
      "Mistake_Title": "Using Sex to Try to Keep Him",
      "Mistake_Details": "You thought if you were good enough in bed, he'd stay. If you were sexually available enough, he wouldn't leave. But sex isn't glue for a weak relationship.",
      "Mistake_Lesson": "Sex doesn't keep a relationship. Connection and commitment do.",
      "Mistake_Tag": "Reality"
    },
    "Mistake48": {
      "Mistake_Title": "Not Acknowledging When He Showed Disrespect",
      "Mistake_Details": "He made jokes at your expense, interrupted you constantly, or dismissed your opinions. You laughed it off instead of addressing it. Disrespect grows when unchallenged.",
      "Mistake_Lesson": "Address disrespect immediately. It only gets worse if ignored.",
      "Mistake_Tag": "Respect"
    },
    "Mistake49": {
      "Mistake_Title": "Hoping He'd Change His Mind About You",
      "Mistake_Details": "He said 'I don't see a future with you' or 'I don't think we're compatible,' but you stayed hoping he'd change his mind. He told you the truth. You didn't listen.",
      "Mistake_Lesson": "Believe what he says about the future. Don't wait for him to change his mind.",
      "Mistake_Tag": "Acceptance"
    },
    "Mistake50": {
      "Mistake_Title": "Not Leaving When the Relationship Stopped Serving You",
      "Mistake_Details": "Deep down, you knew it wasn't right anymore. You were unhappy, unfulfilled, and drained. But you stayed because leaving felt harder than staying.",
      "Mistake_Lesson": "Your happiness matters. Don't stay in something that makes you unhappy.",
      "Mistake_Tag": "Self-Worth"
    },
    "Mistake51": {
      "Mistake_Title": "Ignoring Financial Red Flags",
      "Mistake_Details": "He had money but was cheap with you. He never wanted to spend on dates, asked you to pay, or expected you to split everything equally. This showed you weren't valued.",
      "Mistake_Lesson": "A man who values you will invest financially in the relationship.",
      "Mistake_Tag": "Investment"
    },
    "Mistake52": {
      "Mistake_Title": "Accepting That 'Relationships Take Work' as an Excuse",
      "Mistake_Details": "The relationship felt like constant work — you were always fixing things, managing conflict, trying to make it work. But healthy relationships have ease too.",
      "Mistake_Lesson": "Relationships should have ease alongside effort. Constant strain is a sign.",
      "Mistake_Tag": "Balance"
    },
    "Mistake53": {
      "Mistake_Title": "Not Having the Conversation About What He Wants",
      "Mistake_Details": "You never actually asked him if he wanted marriage, kids, or commitment. You assumed based on his actions. Clarity requires conversation, not assumptions.",
      "Mistake_Lesson": "Ask directly about his goals and intentions. Don't assume.",
      "Mistake_Tag": "Communication"
    },
    "Mistake54": {
      "Mistake_Title": "Giving Him Chances to Apologize for the Same Thing",
      "Mistake_Details": "He kept doing the same hurtful thing and apologizing each time. You kept forgiving, hoping this time would be different. But he never actually changed.",
      "Mistake_Lesson": "Forgiveness without change is just permission to repeat.",
      "Mistake_Tag": "Patterns"
    },
    "Mistake55": {
      "Mistake_Title": "Not Verifying His Stories",
      "Mistake_Details": "He told you things about his past, his family, his situation. You believed him without verification. Later, you discovered he'd lied about several things.",
      "Mistake_Lesson": "Verify before you trust. Actions and stories should align.",
      "Mistake_Tag": "Trust"
    },
    "Mistake56": {
      "Mistake_Title": "Accepting His Explanation for Why He's Late or Absent",
      "Mistake_Details": "He was always late or missed plans. Each time, he had an explanation that sounded reasonable. But his actions showed you weren't a priority.",
      "Mistake_Lesson": "Words explain; actions reveal. Judge by his actions.",
      "Mistake_Tag": "Reality"
    },
    "Mistake57": {
      "Mistake_Title": "Letting Him Control How You Dress or Look",
      "Mistake_Details": "He didn't like your style or criticized how you looked. Over time, you started dressing differently to please him. You lost your own style.",
      "Mistake_Lesson": "Your appearance is yours. Don't change for his preferences.",
      "Mistake_Tag": "Identity"
    },
    "Mistake58": {
      "Mistake_Title": "Not Taking Time to Grieve the Relationship",
      "Mistake_Details": "The relationship ended, and you immediately jumped into the next one. You didn't process, heal, or learn. You just repeated the same patterns.",
      "Mistake_Lesson": "Take time to heal. Learn from the relationship before moving on.",
      "Mistake_Tag": "Growth"
    },
    "Mistake59": {
      "Mistake_Title": "Believing That Love is Enough to Make It Work",
      "Mistake_Details": "You loved him deeply, and you believed that love would be enough to overcome any problem. But love without compatibility, effort, and mutual investment doesn't sustain a relationship.",
      "Mistake_Lesson": "Love is necessary but not sufficient. Compatibility and effort matter too.",
      "Mistake_Tag": "Reality"
    },
    "Mistake60": {
      "Mistake_Title": "Not Walking Away When He Showed He Didn't Respect You",
      "Mistake_Details": "He belittled you, talked down to you, or treated your feelings as invalid. His actions showed disrespect, but you stayed hoping he'd change his behavior.",
      "Mistake_Lesson": "Respect is foundational. Without it, nothing else matters.",
      "Mistake_Tag": "Dealbreaker"
    },

    "Mistake61": {
      "Mistake_Title": "Chasing Him When He's Pulling Away",
      "Mistake_Details": "When he started acting distant, you chased harder. You texted more, called more, tried to convince him you were worth his time. But chasing pushes quality men further away.",
      "Mistake_Lesson": "If he's pulling away, pull back. Let him realize what he's losing.",
      "Mistake_Tag": "Energy"
    },
    "Mistake62": {
      "Mistake_Title": "Not Addressing His Lack of Effort Early On",
      "Mistake_Details": "From the beginning, he put in minimal effort — short texts, no real dates, last-minute plans. Instead of walking away, you accepted it and invested more yourself.",
      "Mistake_Lesson": "Establish standards early. Low effort early means it won't improve.",
      "Mistake_Tag": "Standards"
    },
    "Mistake63": {
      "Mistake_Title": "Believing Him When He Said He's 'Not a Text Person'",
      "Mistake_Details": "He barely texted you but was constantly on his phone. He said he wasn't into texting, but the truth is he just wasn't that interested in communicating with you.",
      "Mistake_Lesson": "If he wants to talk to you, he'll find a way. 'Not a text person' is an excuse.",
      "Mistake_Tag": "Reality"
    },
    "Mistake64": {
      "Mistake_Title": "Making Yourself Available All the Time",
      "Mistake_Details": "He knew he could always reach you, get you to reschedule, and call you anytime. You were too available, so he lost motivation to plan or pursue.",
      "Mistake_Lesson": "Create some scarcity. Don't always be available on his timeline.",
      "Mistake_Tag": "Value"
    },
    "Mistake65": {
      "Mistake_Title": "Bringing Up the Future on Early Dates",
      "Mistake_Details": "On your second or third date, you asked about his intentions, timeline for marriage, or what he wanted long-term. You scared him off before giving him time to develop feelings.",
      "Mistake_Lesson": "Let the connection develop before you discuss the future.",
      "Mistake_Tag": "Timing"
    },
    "Mistake66": {
      "Mistake_Title": "Not Knowing Your Own Worth Before Dating",
      "Mistake_Details": "You had low self-esteem and insecurity going into the relationship. You looked to him to make you feel worthy. That desperation showed, and he couldn't fill that void.",
      "Mistake_Lesson": "Know your worth before you date. A man can't give you self-esteem.",
      "Mistake_Tag": "Self-Worth"
    },
    "Mistake67": {
      "Mistake_Title": "Accepting Excuses for Why He Didn't Introduce You to Friends",
      "Mistake_Details": "He said 'I don't really mix dating and friends' or 'My friends are too immature.' But really, he didn't want to commit to the label you represented.",
      "Mistake_Lesson": "A man who's serious about you wants you in all parts of his life.",
      "Mistake_Tag": "Integration"
    },
    "Mistake68": {
      "Mistake_Title": "Thinking That Being 'Perfect' Would Keep Him",
      "Mistake_Details": "You worked hard to be the perfect girlfriend — perfect looks, perfect behavior, perfect support. But being perfect doesn't make a man loyal if he doesn't want to be.",
      "Mistake_Lesson": "You can't perfect your way into a man's loyalty. He either chooses you or he doesn't.",
      "Mistake_Tag": "Reality"
    },
    "Mistake69": {
      "Mistake_Title": "Not Asking Him Direct Questions",
      "Mistake_Details": "You had questions about his behavior, his intentions, or his feelings, but you didn't ask. You waited for him to volunteer information or bring things up.",
      "Mistake_Lesson": "Ask direct questions. He won't volunteer information you need.",
      "Mistake_Tag": "Communication"
    },
    "Mistake70": {
      "Mistake_Title": "Confusing Attention With Affection",
      "Mistake_Details": "He paid attention to you sexually and physically, but emotionally he was distant. You thought the physical attention meant he cared, but it was just physical.",
      "Mistake_Lesson": "True affection includes emotional connection, not just physical attention.",
      "Mistake_Tag": "Connection"
    },
    "Mistake71": {
      "Mistake_Title": "Staying With Him Because You'd Already Given Him Sex",
      "Mistake_Details": "You slept with him, and then felt obligated to stay or try to make it work. You thought since you'd been intimate, you should give the relationship a real chance.",
      "Mistake_Lesson": "Sex doesn't create obligation. You can end things anytime.",
      "Mistake_Tag": "Choice"
    },
    "Mistake72": {
      "Mistake_Title": "Not Believing His Actions Over His Words",
      "Mistake_Details": "He said all the right things, but his actions contradicted his words. You believed the words and ignored the actions. Words are cheap.",
      "Mistake_Lesson": "Watch what he does, not what he says. Actions show truth.",
      "Mistake_Tag": "Discernment"
    },
    "Mistake73": {
      "Mistake_Title": "Trying to Make Him Jealous Through Social Media",
      "Mistake_Details": "You posted pictures with other men, made your life look extra fabulous, or flirted openly hoping he'd see it and realize what he was missing.",
      "Mistake_Lesson": "Games on social media make you look unstable, not desirable.",
      "Mistake_Tag": "Maturity"
    },
    "Mistake74": {
      "Mistake_Title": "Not Talking About Boundaries Around Exes",
      "Mistake_Details": "He was still in contact with his ex, they hung out, or he checked in with her regularly. You didn't want to seem insecure so you said nothing. But your boundary was being crossed.",
      "Mistake_Lesson": "Your discomfort with his ex is valid. Address it.",
      "Mistake_Tag": "Boundaries"
    },
    "Mistake75": {
      "Mistake_Title": "Assuming He Wanted a Relationship After Sex",
      "Mistake_Details": "You thought if you slept with him, he'd want to commit. But sex to him didn't mean what it meant to you. You overestimated what intimacy meant.",
      "Mistake_Lesson": "Never assume intimacy creates commitment. Verbal commitment does.",
      "Mistake_Tag": "Clarity"
    },
    "Mistake76": {
      "Mistake_Title": "Being Too Accommodating to His Schedule",
      "Mistake_Details": "He was always busy, and you fit yourself into his schedule. You never asked him to make time; you just adjusted your life around his availability.",
      "Mistake_Lesson": "If he wants to see you, he'll make time. Don't rearrange your life for crumbs.",
      "Mistake_Tag": "Respect"
    },
    "Mistake77": {
      "Mistake_Title": "Letting Him Control How You Spend Your Time",
      "Mistake_Details": "He didn't like you going out with friends, wasn't happy when you had plans without him, and made you feel guilty for having other interests.",
      "Mistake_Lesson": "Your time and your friendships are yours. He doesn't get to control them.",
      "Mistake_Tag": "Independence"
    },
    "Mistake78": {
      "Mistake_Title": "Not Setting a Deadline for Commitment",
      "Mistake_Details": "You dated for years waiting for him to propose or define the relationship. You never said 'I need commitment by X date or I'm moving on.'",
      "Mistake_Lesson": "Set a timeline for what you want. If he can't meet it, move on.",
      "Mistake_Tag": "Clarity"
    },
    "Mistake79": {
      "Mistake_Title": "Taking His Moodiness Personally",
      "Mistake_Details": "When he was in a bad mood, you assumed it was about you or the relationship. You tried to fix it by being nicer or more accommodating.",
      "Mistake_Lesson": "His mood isn't about you. Don't take responsibility for his emotions.",
      "Mistake_Tag": "Boundaries"
    },
    "Mistake80": {
      "Mistake_Title": "Not Having Backup Options",
      "Mistake_Details": "He was your only option, so you clung to him desperately. You had no other men interested, no dating prospects, so you tolerated his poor treatment.",
      "Mistake_Lesson": "Date multiple people early on. Don't put all your hope in one man.",
      "Mistake_Tag": "Strategy"
    },
    "Mistake81": {
      "Mistake_Title": "Discussing Relationship Problems With Friends Instead of Him",
      "Mistake_Details": "When he upset you, you vented to your friends instead of talking to him. Your friends became your support system instead of him being your partner.",
      "Mistake_Lesson": "Address issues with him first. Don't circumvent communication.",
      "Mistake_Tag": "Communication"
    },
    "Mistake82": {
      "Mistake_Title": "Accepting That He Wasn't Affectionate Because 'That's Just How He Is'",
      "Mistake_Details": "He never said 'I love you,' rarely showed affection, and you normalized it. You told yourself he just showed love differently.",
      "Mistake_Lesson": "If his love language doesn't align with your needs, it's incompatibility.",
      "Mistake_Tag": "Compatibility"
    },
    "Mistake83": {
      "Mistake_Title": "Not Taking Rejection Well",
      "Mistake_Details": "When he said he wasn't interested in commitment, you pushed harder. You couldn't accept his 'no' and tried to convince him otherwise.",
      "Mistake_Lesson": "Accept rejection gracefully. His 'no' is final. Don't negotiate.",
      "Mistake_Tag": "Acceptance"
    },
    "Mistake84": {
      "Mistake_Title": "Giving Him Multiple Chances to Hurt You in the Same Way",
      "Mistake_Details": "He cheated, you took him back. He did it again. He lied, you forgave him. He lied again. You enabled his bad behavior.",
      "Mistake_Lesson": "One chance for mistakes. Repeated hurt is a pattern, not an accident.",
      "Mistake_Tag": "Patterns"
    },
    "Mistake85": {
      "Mistake_Title": "Not Having Other Interests Besides Him",
      "Mistake_Details": "Everything you did was designed to appeal to him or revolve around him. You had no passions, hobbies, or pursuits of your own.",
      "Mistake_Lesson": "Have your own life. A man is attracted to a woman with her own world.",
      "Mistake_Tag": "Appeal"
    },
    "Mistake86": {
      "Mistake_Title": "Asking Him to Prove His Love Through Actions You Define",
      "Mistake_Details": "You decided what love should look like and demanded he prove it that way. But he showed love differently, and you rejected his efforts.",
      "Mistake_Lesson": "Appreciate love in the way it's given. You don't get to define his expression.",
      "Mistake_Tag": "Appreciation"
    },
    "Mistake87": {
      "Mistake_Title": "Not Paying Attention to How He Talked About His Mother",
      "Mistake_Details": "He was disrespectful to his mother, didn't appreciate her, or treated her poorly. This was a reflection of how he'd eventually treat you.",
      "Mistake_Lesson": "How a man treats his mother often predicts how he'll treat women.",
      "Mistake_Tag": "Character"
    },
    "Mistake88": {
      "Mistake_Title": "Assuming He'd Change After Marriage or Commitment",
      "Mistake_Details": "He had habits or behaviors you didn't like, but you thought once he committed, he'd change. Marriage doesn't change people.",
      "Mistake_Lesson": "Accept him as he is now. Don't marry him hoping for transformation.",
      "Mistake_Tag": "Reality"
    },
    "Mistake89": {
      "Mistake_Title": "Not Knowing What Your Deal-Breakers Actually Are",
      "Mistake_Details": "You didn't have clear standards for what you would and wouldn't tolerate. You adjusted your boundaries as you went, never drawing a firm line.",
      "Mistake_Lesson": "Know your deal-breakers before you date. Stick to them.",
      "Mistake_Tag": "Clarity"
    },
    "Mistake90": {
      "Mistake_Title": "Feeling Guilty for Having Boundaries",
      "Mistake_Details": "You had a boundary, but when he pushed back, you felt bad for having it. You apologized or softened your stance because you didn't want to upset him.",
      "Mistake_Lesson": "Never apologize for your boundaries. They exist for good reason.",
      "Mistake_Tag": "Boundaries"
    },
    "Mistake91": {
      "Mistake_Title": "Not Observing How He Treated People He Didn't Need",
      "Mistake_Details": "He was charming to you and to people he could benefit from, but rude to servers, unkind to people 'below' him. His true character showed in how he treated everyone.",
      "Mistake_Lesson": "Judge character by how he treats people who can't benefit him.",
      "Mistake_Tag": "Character"
    },
    "Mistake92": {
      "Mistake_Title": "Staying Silent When He Lied",
      "Mistake_Details": "You caught him in a lie — about where he was, who he was with, or what he was doing. But you didn't confront him about it.",
      "Mistake_Lesson": "Address lies immediately. Silence teaches him you'll tolerate dishonesty.",
      "Mistake_Tag": "Trust"
    },
    "Mistake93": {
      "Mistake_Title": "Assuming His Reluctance to Meet Your Family Meant He Was Shy",
      "Mistake_Details": "He kept making excuses to avoid meeting your family. You thought he was nervous or introverted, but really, he wasn't invested enough to take that step.",
      "Mistake_Lesson": "A man who wants you wants to be part of your world.",
      "Mistake_Tag": "Integration"
    },
    "Mistake94": {
      "Mistake_Title": "Not Having a Life Separate From Him",
      "Mistake_Details": "You existed in relation to him. Your happiness depended on his presence, your worth came from his validation, your plans revolved around him.",
      "Mistake_Lesson": "Build a life you love with or without him. He should enhance it.",
      "Mistake_Tag": "Independence"
    },
    "Mistake95": {
      "Mistake_Title": "Accepting Surface Apologies Without Real Change",
      "Mistake_Details": "He'd say 'I'm sorry' quickly and move on, but he'd never actually discuss what he did wrong or commit to changing.",
      "Mistake_Lesson": "An apology isn't complete without understanding and change.",
      "Mistake_Tag": "Accountability"
    },
    "Mistake96": {
      "Mistake_Title": "Not Addressing When He Made You Feel Small",
      "Mistake_Details": "He made comments that diminished you, your accomplishments, or your abilities. You laughed it off instead of telling him it hurt.",
      "Mistake_Lesson": "Never let anyone make you feel small. Address it immediately.",
      "Mistake_Tag": "Self-Worth"
    },
    "Mistake97": {
      "Mistake_Title": "Assuming He Didn't Want Commitment Because He Was Scared",
      "Mistake_Details": "He said he didn't want marriage or exclusivity, but you told yourself he was just scared and would come around. He meant what he said.",
      "Mistake_Lesson": "Believe what he says about his intentions. Don't reinterpret.",
      "Mistake_Tag": "Honesty"
    },
    "Mistake98": {
      "Mistake_Title": "Competing With His Friends or Family",
      "Mistake_Details": "You resented that he wanted to spend time with his friends or family. You wanted to be his only priority and made him choose.",
      "Mistake_Lesson": "A healthy man has balance. Don't ask him to choose between you and his loved ones.",
      "Mistake_Tag": "Perspective"
    },
    "Mistake99": {
      "Mistake_Title": "Not Leaving When You Realized You Wanted Different Things",
      "Mistake_Details": "He didn't want kids; you did. He wanted to travel; you wanted stability. You ignored the incompatibility hoping it would work out.",
      "Mistake_Lesson": "Fundamental incompatibility is a deal-breaker. Don't ignore it.",
      "Mistake_Tag": "Reality"
    },
    "Mistake100": {
      "Mistake_Title": "Staying In a Relationship That Doesn't Make You Happy",
      "Mistake_Details": "You were unhappy, unfulfilled, and drained. But you stayed because leaving seemed harder than staying in misery.",
      "Mistake_Lesson": "Your happiness is non-negotiable. Don't sacrifice it for anyone.",
      "Mistake_Tag": "Self-Worth"
    },
    "Mistake101": {
      "Mistake_Title": "Not Understanding That You Can't Fix a Man's Commitment Issues",
      "Mistake_Details": "He had fear of commitment from his past, and you thought you could be the one to change that. But his issues weren't your responsibility to fix.",
      "Mistake_Lesson": "You're not a therapist. His commitment issues are his to work on.",
      "Mistake_Tag": "Boundaries"
    },
    "Mistake102": {
      "Mistake_Title": "Assuming Every Man Has Good Intentions",
      "Mistake_Details": "You gave every man the benefit of the doubt, even when his behavior showed otherwise. You were trusting to a fault.",
      "Mistake_Lesson": "Trust is earned, not given. Watch his behavior carefully.",
      "Mistake_Tag": "Discernment"
    },
    "Mistake103": {
      "Mistake_Title": "Staying Too Long After You Knew It Was Over",
      "Mistake_Details": "Deep down, you knew the relationship had ended. But you held on, hoping he'd come back, hoping things would improve.",
      "Mistake_Lesson": "Trust your gut. If it feels over, it probably is.",
      "Mistake_Tag": "Intuition"
    },
    "Mistake104": {
      "Mistake_Title": "Not Discussing Past Trauma or Baggage Early",
      "Mistake_Details": "He had unresolved trauma or baggage, and you didn't discuss it until you were already invested. You realized later that his issues affected the relationship significantly.",
      "Mistake_Lesson": "Discuss past trauma early. Know what you're dealing with.",
      "Mistake_Tag": "Communication"
    },
    "Mistake105": {
      "Mistake_Title": "Letting Him Determine Your Self-Worth",
      "Mistake_Details": "When he pulled away, you felt worthless. When he showed affection, you felt valuable. Your sense of self depended on his mood.",
      "Mistake_Lesson": "Your worth comes from within. Don't let anyone else define it.",
      "Mistake_Tag": "Self-Worth"
    },
    "Mistake106": {
      "Mistake_Title": "Not Having Standards During the Dating Phase",
      "Mistake_Details": "You didn't set boundaries or expectations early. You just went along with whatever he wanted. This set a pattern of low standards for the entire relationship.",
      "Mistake_Lesson": "Set standards from date one. Don't compromise early on.",
      "Mistake_Tag": "Standards"
    },
    "Mistake107": {
      "Mistake_Title": "Sacrificing Your Goals for His",
      "Mistake_Details": "You turned down a job, moved closer to him, or paused your education because he asked you to. You made his goals the priority.",
      "Mistake_Lesson": "Your goals matter. Don't sacrifice them for a man.",
      "Mistake_Tag": "Ambition"
    },
    "Mistake108": {
      "Mistake_Title": "Not Listening to the Red Flags Your Body Gave You",
      "Mistake_Details": "Your gut felt off, something seemed wrong, but you ignored the feeling. Your intuition was warning you, but you overrode it.",
      "Mistake_Lesson": "Your body knows. Listen to your gut feeling.",
      "Mistake_Tag": "Intuition"
    },
    "Mistake109": {
      "Mistake_Title": "Thinking You Could Love Him Out of His Issues",
      "Mistake_Details": "He had depression, anxiety, addiction, or other issues. You thought your love would heal him. But love isn't therapy.",
      "Mistake_Lesson": "You can support, but you can't fix him. That's his work.",
      "Mistake_Tag": "Boundaries"
    },
    "Mistake110": {
      "Mistake_Title": "Not Leaving When He Repeatedly Disrespected You",
      "Mistake_Details": "He disrespected you repeatedly — through words, actions, or how he treated you. You stayed, hoping he'd respect you eventually.",
      "Mistake_Lesson": "Respect is foundational. Without it, there's no foundation.",
      "Mistake_Tag": "Non-Negotiable"
    },
    "Mistake111": {
      "Mistake_Title": "Not Recognizing Breadcrumbing as a Pattern",
      "Mistake_Details": "He'd text sporadically — sometimes for weeks, then nothing. He'd send messages like 'thinking of you' but never ask you out. You accepted this cycle thinking it meant something.",
      "Mistake_Lesson": "Breadcrumbing is intentional. A man interested makes concrete plans.",
      "Mistake_Tag": "Patterns"
    },
    "Mistake112": {
      "Mistake_Title": "Believing He'd Commit Once You Lived Together",
      "Mistake_Details": "You moved in with him thinking it would lead to marriage. But living together was comfortable for him—no incentive to commit further.",
      "Mistake_Lesson": "Living together doesn't guarantee commitment. Get clarity before moving.",
      "Mistake_Tag": "Commitment"
    },
    "Mistake113": {
      "Mistake_Title": "Not Having Serious Conversations Early",
      "Mistake_Details": "You avoided discussing dealbreakers, expectations, and non-negotiables early because you didn't want to seem intense. By the time you did, you were already attached.",
      "Mistake_Lesson": "Early conversations reveal incompatibility. Have them before investing.",
      "Mistake_Tag": "Communication"
    },
    "Mistake114": {
      "Mistake_Title": "Accepting That He Was 'Just Not Ready' for Years",
      "Mistake_Details": "He said he wasn't ready for commitment for years. You waited, hoping he'd eventually be ready. But 'not ready' often means 'not ready with you.'",
      "Mistake_Lesson": "If he's 'not ready' after a year, he's not ready with you. Move on.",
      "Mistake_Tag": "Timeline"
    },
    "Mistake115": {
      "Mistake_Title": "Letting Him Make You the Problem",
      "Mistake_Details": "When things went wrong, he blamed you. He made you feel crazy, like you were the needy one, the emotional one. You internalized this criticism.",
      "Mistake_Lesson": "Don't accept blame for his behavior. You're not the problem.",
      "Mistake_Tag": "Gaslighting"
    },
    "Mistake116": {
      "Mistake_Title": "Not Trusting Your Friends' First Impressions",
      "Mistake_Details": "Your friends didn't like him from the start. They saw something you didn't. Instead of listening, you defended him and eventually lost friendships.",
      "Mistake_Lesson": "Your friends' instincts about him matter. They see clearly.",
      "Mistake_Tag": "Wisdom"
    },
    "Mistake117": {
      "Mistake_Title": "Thinking Marriage Would Fix the Problems",
      "Mistake_Details": "You had relationship issues, but you thought getting married would make things better. Marriage doesn't fix dysfunction—it amplifies it.",
      "Mistake_Lesson": "Fix problems before marriage. Marriage won't heal a broken foundation.",
      "Mistake_Tag": "Reality"
    },
    "Mistake118": {
      "Mistake_Title": "Not Standing Up for Yourself in Arguments",
      "Mistake_Details": "When he raised his voice or got aggressive during arguments, you backed down. You conceded points just to end the conflict.",
      "Mistake_Lesson": "Stand firm. Don't back down just to keep peace.",
      "Mistake_Tag": "Strength"
    },
    "Mistake119": {
      "Mistake_Title": "Assuming He Knew How His Actions Affected You",
      "Mistake_Details": "He hurt you repeatedly, but you assumed he understood how much it hurt. You never explicitly told him the impact of his behavior.",
      "Mistake_Lesson": "Tell him clearly how his actions affect you. Don't assume he knows.",
      "Mistake_Tag": "Communication"
    },
    "Mistake120": {
      "Mistake_Title": "Staying Because Leaving Would Be Admitting Failure",
      "Mistake_Details": "The relationship was clearly wrong, but you couldn't leave because it felt like admitting you'd made a mistake. Ego kept you trapped.",
      "Mistake_Lesson": "Leaving a wrong relationship isn't failure—staying is.",
      "Mistake_Tag": "Pride"
    },
    "Mistake121": {
      "Mistake_Title": "Not Having Conversations About Family Planning",
      "Mistake_Details": "You wanted kids; he was ambivalent. You assumed once you got married, he'd be ready. He never was, and you sacrificed your dreams.",
      "Mistake_Lesson": "Discuss family goals early and explicitly. Don't assume.",
      "Mistake_Tag": "Compatibility"
    },
    "Mistake122": {
      "Mistake_Title": "Enabling His Bad Behavior by Covering for Him",
      "Mistake_Details": "When he messed up, you made excuses to others. When he lied, you stayed quiet. You protected his image instead of holding him accountable.",
      "Mistake_Lesson": "Stop protecting him. Let his behavior speak for itself.",
      "Mistake_Tag": "Accountability"
    },
    "Mistake123": {
      "Mistake_Title": "Not Seeing Potential Abuse as a Red Flag",
      "Mistake_Details": "He made you feel small, controlled where you went, checked your phone, or got aggressive. But you normalized it as 'just how he is.'",
      "Mistake_Lesson": "Control and aggression are forms of abuse. Leave immediately.",
      "Mistake_Tag": "Safety"
    },
    "Mistake124": {
      "Mistake_Title": "Accepting That He'd Change 'Someday'",
      "Mistake_Details": "He had a drinking problem, was unemployed, or was emotionally unavailable. You believed 'someday' he'd get his life together.",
      "Mistake_Lesson": "People change when they want to. Don't wait for 'someday.'",
      "Mistake_Tag": "Reality"
    },
    "Mistake125": {
      "Mistake_Title": "Not Having a Support System Outside the Relationship",
      "Mistake_Details": "You isolated yourself from friends and family to focus on him. When things got hard, you had no one to confide in.",
      "Mistake_Lesson": "Maintain your friendships and family connections always.",
      "Mistake_Tag": "Independence"
    },
    "Mistake126": {
      "Mistake_Title": "Believing That Physical Intimacy Equals Emotional Connection",
      "Mistake_Details": "After sex, you felt close to him. But he could be intimate physically and distant emotionally. You confused the two.",
      "Mistake_Lesson": "Physical intimacy without emotional intimacy is just sex.",
      "Mistake_Tag": "Connection"
    },
    "Mistake127": {
      "Mistake_Title": "Not Walking Away When He Disrespected Your Family",
      "Mistake_Details": "He was rude to your parents, dismissive of your siblings, or made mean comments about your family. You didn't defend them.",
      "Mistake_Lesson": "A man who disrespects your family doesn't respect you.",
      "Mistake_Tag": "Loyalty"
    },
    "Mistake128": {
      "Mistake_Title": "Assuming His Jealousy Meant He Cared",
      "Mistake_Details": "He got jealous when you talked to other men, wanted to know where you were all the time, or got upset about your friendships. You interpreted this as caring.",
      "Mistake_Lesson": "Jealousy is control, not love.",
      "Mistake_Tag": "Red Flags"
    },
    "Mistake129": {
      "Mistake_Title": "Not Taking Your Own Needs Seriously",
      "Mistake_Details": "Your needs always came second. You put his comfort, his schedule, his feelings first. You neglected yourself.",
      "Mistake_Lesson": "Your needs are just as important as his. Prioritize yourself.",
      "Mistake_Tag": "Self-Care"
    },
    "Mistake130": {
      "Mistake_Title": "Believing He'd Stop Comparing You to His Ex",
      "Mistake_Details": "He mentioned his ex constantly, compared you to her, or kept photos of her. You thought he'd stop over time. He didn't.",
      "Mistake_Lesson": "If he's constantly referencing his ex, he's not over her.",
      "Mistake_Tag": "Red Flags"
    },
    "Mistake131": {
      "Mistake_Title": "Not Addressing His Drinking or Drug Use Early",
      "Mistake_Details": "You noticed he drank too much or used substances, but you didn't bring it up. You hoped it would resolve itself.",
      "Mistake_Lesson": "Addiction won't fix itself. Address it immediately or leave.",
      "Mistake_Tag": "Dealbreaker"
    },
    "Mistake132": {
      "Mistake_Title": "Accepting Financial Irresponsibility Without Question",
      "Mistake_Details": "He had debt, didn't pay bills, or handled money recklessly. You didn't discuss it and eventually got tangled in his financial problems.",
      "Mistake_Lesson": "Financial habits reveal character. Address them early.",
      "Mistake_Tag": "Compatibility"
    },
    "Mistake133": {
      "Mistake_Title": "Not Believing Him When He Said He Cheated",
      "Mistake_Details": "He confessed to cheating, but you didn't really believe it or accept it. You minimized it or made excuses for him.",
      "Mistake_Lesson": "If he cheated once, he can cheat again. Accept this truth.",
      "Mistake_Tag": "Trust"
    },
    "Mistake134": {
      "Mistake_Title": "Trying to Be 'Cool Girl' About His Boundary Violations",
      "Mistake_Details": "He flirted with other women, and you pretended to be fine with it. You didn't want to seem jealous or insecure.",
      "Mistake_Lesson": "Have standards. Don't pretend to be okay with disrespect.",
      "Mistake_Tag": "Boundaries"
    },
    "Mistake135": {
      "Mistake_Title": "Not Asking Direct Questions About His Feelings",
      "Mistake_Details": "You wanted to know if he loved you, if he was serious about the relationship, but you never asked directly. You fished for answers.",
      "Mistake_Lesson": "Ask direct questions. Get direct answers.",
      "Mistake_Tag": "Communication"
    },
    "Mistake136": {
      "Mistake_Title": "Accepting Sporadic Affection as Proof of Love",
      "Mistake_Details": "He was affectionate occasionally—on special occasions or after a fight. You accepted these moments as proof he loved you.",
      "Mistake_Lesson": "Real love is consistent, not sporadic.",
      "Mistake_Tag": "Consistency"
    },
    "Mistake137": {
      "Mistake_Title": "Not Leaving When He Showed Signs of Narcissism",
      "Mistake_Details": "He needed constant attention, couldn't handle criticism, and made everything about himself. You didn't recognize these as narcissistic traits.",
      "Mistake_Lesson": "Narcissists don't change. Leave before you're completely drained.",
      "Mistake_Tag": "Character"
    },
    "Mistake138": {
      "Mistake_Title": "Giving Him All Your Vulnerability Without Reciprocation",
      "Mistake_Details": "You were open, vulnerable, and emotionally available. But he was closed off, defended, and rarely shared. The vulnerability was one-sided.",
      "Mistake_Lesson": "Vulnerability should be reciprocal. If he won't be vulnerable, don't be either.",
      "Mistake_Tag": "Reciprocity"
    },
    "Mistake139": {
      "Mistake_Title": "Not Leaving When He Proved He Didn't Prioritize You",
      "Mistake_Details": "When you needed him, he wasn't there. When you were sick, he was absent. His actions repeatedly showed you weren't a priority.",
      "Mistake_Lesson": "Notice patterns. If he's not there when you need him, he won't be.",
      "Mistake_Tag": "Patterns"
    },
    "Mistake140": {
      "Mistake_Title": "Accepting That He 'Wasn't Good With Words'",
      "Mistake_Details": "He never said 'I love you' or expressed his feelings verbally. You accepted that he 'wasn't good with words' but his actions didn't show love either.",
      "Mistake_Lesson": "Love is both shown and said. If he does neither, he doesn't love you.",
      "Mistake_Tag": "Expression"
    },
    "Mistake141": {
      "Mistake_Title": "Not Recognizing When He Started Checking Out",
      "Mistake_Details": "He became distant, less affectionate, less engaged. Instead of addressing it, you tried to win him back by being better.",
      "Mistake_Lesson": "When he checks out, let him go. Don't chase.",
      "Mistake_Tag": "Dignity"
    },
    "Mistake142": {
      "Mistake_Title": "Thinking Your Love Was Enough to Make It Work",
      "Mistake_Details": "You loved him deeply, and you believed that if you loved hard enough, the relationship would survive. Love alone isn't enough.",
      "Mistake_Lesson": "You can love someone and it still not work. Love is necessary but insufficient.",
      "Mistake_Tag": "Reality"
    },
    "Mistake143": {
      "Mistake_Title": "Not Taking His Comments About Other Women Seriously",
      "Mistake_Details": "He complimented other women in front of you, made comments about attractive women, or compared you to them. You didn't address it.",
      "Mistake_Lesson": "A man who respects you doesn't compliment other women in front of you.",
      "Mistake_Tag": "Respect"
    },
    "Mistake144": {
      "Mistake_Title": "Accepting Blame for His Bad Mood",
      "Mistake_Details": "When he was upset, he'd say it was because of something you did. You felt responsible for managing his emotions.",
      "Mistake_Lesson": "You're not responsible for his emotions. He needs to manage them.",
      "Mistake_Tag": "Responsibility"
    },
    "Mistake145": {
      "Mistake_Title": "Not Leaving When You Realized You Were Unhappy",
      "Mistake_Details": "You'd been unhappy for months or years, but you stayed because leaving felt too hard. Staying was more painful than leaving.",
      "Mistake_Lesson": "Your happiness matters. Leave rather than be miserable.",
      "Mistake_Tag": "Self-Worth"
    },
    "Mistake146": {
      "Mistake_Title": "Not Having Financial Independence",
      "Mistake_Details": "You became financially dependent on him. This made it harder to leave when you needed to. Financial dependence keeps you trapped.",
      "Mistake_Lesson": "Always maintain financial independence. It's your freedom.",
      "Mistake_Tag": "Independence"
    },
    "Mistake147": {
      "Mistake_Title": "Letting His Past Relationship Define Him",
      "Mistake_Details": "He was hurt in his last relationship, and you made excuses for his bad behavior. You tried to heal his past wounds.",
      "Mistake_Lesson": "His past is his to heal. Don't take that responsibility on.",
      "Mistake_Tag": "Boundaries"
    },
    "Mistake148": {
      "Mistake_Title": "Not Questioning When He Avoided Meeting Your Friends",
      "Mistake_Details": "He consistently made excuses to avoid meeting your friends or socializing with them. This was a sign he wasn't serious.",
      "Mistake_Lesson": "A man invested in you wants to be part of your world.",
      "Mistake_Tag": "Integration"
    },
    "Mistake149": {
      "Mistake_Title": "Accepting Half-Truths as Full Honesty",
      "Mistake_Details": "He'd tell you partial truths or leave out important details. You accepted these as honesty instead of demanding full transparency.",
      "Mistake_Lesson": "Half-truth is still a lie. Require full honesty.",
      "Mistake_Tag": "Trust"
    },
    "Mistake150": {
      "Mistake_Title": "Not Celebrating Your Own Wins Without Him",
      "Mistake_Details": "When you had success, you needed him to validate it. You couldn't celebrate your wins independently because his approval mattered too much.",
      "Mistake_Lesson": "Celebrate yourself. You don't need his approval for your success.",
      "Mistake_Tag": "Self-Worth"
    },
    "Mistake151": {
      "Mistake_Title": "Assuming He'd Be Faithful Because He Said So",
      "Mistake_Details": "He promised he'd be faithful, and you didn't verify through his behavior. You took his word and got hurt.",
      "Mistake_Lesson": "Faithfulness is shown, not promised. Watch his actions.",
      "Mistake_Tag": "Trust"
    },
    "Mistake152": {
      "Mistake_Title": "Not Listening When Your Gut Said 'No'",
      "Mistake_Details": "Your intuition screamed 'something's wrong,' but you ignored it because you didn't want to lose him. Your gut was right.",
      "Mistake_Lesson": "Your intuition is your superpower. Trust it.",
      "Mistake_Tag": "Intuition"
    },
    "Mistake153": {
      "Mistake_Title": "Accepting That He Wasn't 'A Relationship Person'",
      "Mistake_Details": "He said he wasn't good at relationships, didn't believe in marriage, or didn't see himself settling down. But you thought you'd change his mind.",
      "Mistake_Lesson": "Believe what he says about relationships. Don't expect to be the exception.",
      "Mistake_Tag": "Honesty"
    },
    "Mistake154": {
      "Mistake_Title": "Not Addressing His Double Standards",
      "Mistake_Details": "He had different rules for you than for himself. He could do things but you couldn't. This inequality was unfair.",
      "Mistake_Lesson": "A healthy relationship has equal rules for both people.",
      "Mistake_Tag": "Equality"
    },
    "Mistake155": {
      "Mistake_Title": "Staying Too Long After Red Flags Appeared",
      "Mistake_Details": "You saw the red flags early but dismissed them. You stayed hoping they'd disappear. They only got worse.",
      "Mistake_Lesson": "Red flags are warnings. Heed them immediately.",
      "Mistake_Tag": "Warning"
    },
    "Mistake156": {
      "Mistake_Title": "Not Taking Care of Yourself During the Relationship",
      "Mistake_Details": "You neglected your health, your hobbies, your appearance. You became a shell of yourself to fit into the relationship.",
      "Mistake_Lesson": "Taking care of yourself is non-negotiable. Always prioritize your well-being.",
      "Mistake_Tag": "Self-Care"
    },
    "Mistake157": {
      "Mistake_Title": "Believing That Marriage Would Make Him Faithful",
      "Mistake_Details": "He had been unfaithful while dating. You thought marriage would make him faithful. It didn't.",
      "Mistake_Lesson": "Past infidelity predicts future infidelity. Don't marry a cheater.",
      "Mistake_Tag": "Dealbreaker"
    },
    "Mistake158": {
      "Mistake_Title": "Not Leaving When He Made You Feel Unwelcome in His Home",
      "Mistake_Details": "At his place, he was distant, cold, or made you feel like you were imposing. This was a sign you weren't truly welcome.",
      "Mistake_Lesson": "You should feel welcome and comfortable in his space.",
      "Mistake_Tag": "Belonging"
    },
    "Mistake159": {
      "Mistake_Title": "Accepting That 'This Is Just How He Is'",
      "Mistake_Details": "He was rude, dismissive, or unkind. You accepted it as his personality instead of recognizing it as mistreatment.",
      "Mistake_Lesson": "His personality isn't an excuse for treating you badly. Ever.",
      "Mistake_Tag": "Non-Negotiable"
    },
    "Mistake160": {
      "Mistake_Title": "Not Preparing an Exit Plan",
      "Mistake_Details": "You stayed in a bad relationship because you didn't know where to go or how to leave. You felt trapped.",
      "Mistake_Lesson": "Always have an exit plan. Know you can leave anytime.",
      "Mistake_Tag": "Safety"
    },




    "Mistake161": {
      "Mistake_Title": "Not Verifying His Employment or Financial Stability",
      "Mistake_Details": "He said he had a good job, but you never verified it. Later you discovered he was unemployed or had serious money problems he hid from you.",
      "Mistake_Lesson": "Know his financial situation before you get invested. It affects your future.",
      "Mistake_Tag": "Verification"
    },
    "Mistake162": {
      "Mistake_Title": "Accepting His Excuses for Not Using Protection",
      "Mistake_Details": "He asked you to have sex without protection, and you agreed because you didn't want to seem paranoid or difficult. You risked your health.",
      "Mistake_Lesson": "Your health is non-negotiable. Always use protection.",
      "Mistake_Tag": "Health"
    },
    "Mistake163": {
      "Mistake_Title": "Not Recognizing Emotional Infidelity as Cheating",
      "Mistake_Details": "He was emotionally connected to another woman — constant texting, deep conversations, emotional intimacy. You didn't call it cheating, but it was.",
      "Mistake_Lesson": "Emotional infidelity is cheating. Your intuition knows.",
      "Mistake_Tag": "Loyalty"
    },
    "Mistake164": {
      "Mistake_Title": "Letting Him Define Your Relationship Status",
      "Mistake_Details": "He decided whether you were exclusive, whether you were dating, or what the relationship meant. You never got a say.",
      "Mistake_Lesson": "Relationship status is a mutual decision. Don't let him dictate it.",
      "Mistake_Tag": "Agency"
    },
    "Mistake165": {
      "Mistake_Title": "Not Asking About His Mental Health History",
      "Mistake_Details": "He had untreated depression, anxiety, or other mental health issues that affected the relationship. You didn't know early on.",
      "Mistake_Lesson": "Understand his mental health. It impacts the relationship.",
      "Mistake_Tag": "Communication"
    },
    "Mistake166": {
      "Mistake_Title": "Accepting That He'd 'Figure Out' His Life Eventually",
      "Mistake_Details": "He had no direction, no goals, no plan for the future. But you believed 'eventually' he'd get motivated and get his life together.",
      "Mistake_Lesson": "People with no direction rarely find it. Don't wait for eventual motivation.",
      "Mistake_Tag": "Reality"
    },
    "Mistake167": {
      "Mistake_Title": "Not Taking His Comments About Your Body Seriously",
      "Mistake_Details": "He made comments about your weight, your appearance, or your body. You brushed it off instead of recognizing it as disrespect.",
      "Mistake_Lesson": "Comments about your body are disrespectful. Address them immediately.",
      "Mistake_Tag": "Respect"
    },
    "Mistake168": {
      "Mistake_Title": "Believing That Couples Therapy Would Fix Everything",
      "Mistake_Details": "The relationship was fundamentally broken, but you thought couples therapy would fix it. Therapy can't fix unwillingness.",
      "Mistake_Lesson": "Therapy helps when both people want to improve. If he doesn't, it won't work.",
      "Mistake_Tag": "Reality"
    },
    "Mistake169": {
      "Mistake_Title": "Not Discussing His Relationship With His Family",
      "Mistake_Details": "He had a complicated relationship with his family — estranged, toxic, or hostile. This pattern often repeats in romantic relationships.",
      "Mistake_Lesson": "His family relationships reveal how he'll eventually treat you.",
      "Mistake_Tag": "Patterns"
    },
    "Mistake170": {
      "Mistake_Title": "Accepting That He Wasn't 'Emotionally Available'",
      "Mistake_Details": "He couldn't do emotional intimacy, couldn't share feelings, couldn't be vulnerable. You accepted this as his personality.",
      "Mistake_Lesson": "Emotional unavailability is incompatibility. You need someone available.",
      "Mistake_Tag": "Dealbreaker"
    },
    "Mistake171": {
      "Mistake_Title": "Not Asking About His Previous Relationships",
      "Mistake_Details": "You never asked why his previous relationships ended. If he doesn't discuss it, he might be hiding something or repeating patterns.",
      "Mistake_Lesson": "Ask about past relationships. His explanations reveal his character.",
      "Mistake_Tag": "History"
    },
    "Mistake172": {
      "Mistake_Title": "Letting Him Blame You for His Mistakes",
      "Mistake_Details": "When he messed up, he blamed you. 'If you hadn't done X, I wouldn't have done Y.' You internalized the blame.",
      "Mistake_Lesson": "He's responsible for his own choices. Don't accept misplaced blame.",
      "Mistake_Tag": "Accountability"
    },
    "Mistake173": {
      "Mistake_Title": "Not Walking Away When He Threatened to Leave",
      "Mistake_Details": "He threatened to break up with you to control you. He'd say things like 'If you don't change, I'll leave.' You complied out of fear.",
      "Mistake_Lesson": "Anyone who uses threats to control you is manipulative. Leave first.",
      "Mistake_Tag": "Manipulation"
    },
    "Mistake174": {
      "Mistake_Title": "Accepting His Lack of Effort to Remember Important Dates",
      "Mistake_Details": "He forgot your birthday, your anniversary, or other important dates repeatedly. You tried to excuse it.",
      "Mistake_Lesson": "A man who cares remembers what matters to you.",
      "Mistake_Tag": "Consistency"
    },
    "Mistake175": {
      "Mistake_Title": "Not Setting Consequences for Disrespect",
      "Mistake_Details": "When he disrespected you, you didn't set consequences. You just forgave him and hoped it wouldn't happen again.",
      "Mistake_Lesson": "Consequences teach more than words. Set them and enforce them.",
      "Mistake_Tag": "Boundaries"
    },
    "Mistake176": {
      "Mistake_Title": "Believing His 'I Love You' When His Actions Say Otherwise",
      "Mistake_Details": "He said he loved you but his actions contradicted it — flaking, being disrespectful, prioritizing others. Words without action are empty.",
      "Mistake_Lesson": "Love is an action. Words without action are lies.",
      "Mistake_Tag": "Truth"
    },
    "Mistake177": {
      "Mistake_Title": "Not Asking About His Attitude Toward Commitment",
      "Mistake_Details": "You never asked him directly what he wanted from the relationship or if he believed in commitment. You assumed.",
      "Mistake_Lesson": "Ask directly about his intentions. Don't assume.",
      "Mistake_Tag": "Clarity"
    },
    "Mistake178": {
      "Mistake_Title": "Accepting His Need to 'Keep His Options Open'",
      "Mistake_Details": "He wanted to keep dating other people while seeing you. You accepted this because you didn't want to seem demanding.",
      "Mistake_Lesson": "If he needs to keep options open, you're not his choice. Walk away.",
      "Mistake_Tag": "Respect"
    },
    "Mistake179": {
      "Mistake_Title": "Not Noticing When He Started Taking You for Granted",
      "Mistake_Details": "Early on, he was attentive and caring. Over time, he stopped making effort. You didn't recognize this pattern.",
      "Mistake_Lesson": "Notice when effort decreases. Address it immediately.",
      "Mistake_Tag": "Awareness"
    },
    "Mistake180": {
      "Mistake_Title": "Thinking His Potential Was More Important Than His Present",
      "Mistake_Details": "He wasn't good right now, but he had potential. You invested in his potential instead of accepting his present reality.",
      "Mistake_Lesson": "Live with who he is now, not who he might become.",
      "Mistake_Tag": "Reality"
    },
    "Mistake181": {
      "Mistake_Title": "Not Discussing What 'Love' Means to Each of You",
      "Mistake_Details": "You had different definitions of love and what a relationship should look like. You never discussed these fundamental differences.",
      "Mistake_Lesson": "Define love and relationship together early on.",
      "Mistake_Tag": "Communication"
    },
    "Mistake182": {
      "Mistake_Title": "Accepting That He 'Needed Space' But Never Gave You Space Back",
      "Mistake_Details": "He needed space when things got tough, but when you needed space, he got upset. The boundary was one-sided.",
      "Mistake_Lesson": "Healthy boundaries work both ways.",
      "Mistake_Tag": "Equality"
    },
    "Mistake183": {
      "Mistake_Title": "Not Questioning His Friendships With Exes",
      "Mistake_Details": "He maintained close friendships with multiple exes. You didn't question this or express discomfort.",
      "Mistake_Lesson": "Be suspicious of men who stay close with all their exes.",
      "Mistake_Tag": "Red Flags"
    },
    "Mistake184": {
      "Mistake_Title": "Letting Him Isolate You From Support Systems",
      "Mistake_Details": "He didn't like your friends or family, and over time you saw them less. You became dependent only on him.",
      "Mistake_Lesson": "Anyone who isolates you from support is dangerous. Run.",
      "Mistake_Tag": "Warning"
    },
    "Mistake185": {
      "Mistake_Title": "Not Addressing Misaligned Sexual Expectations",
      "Mistake_Details": "Your sexual needs and desires didn't align with his. You never discussed it openly, so you both stayed unfulfilled.",
      "Mistake_Lesson": "Sexual compatibility is important. Discuss it openly.",
      "Mistake_Tag": "Communication"
    },
    "Mistake186": {
      "Mistake_Title": "Believing That Being Pregnant Would Make Him Commit",
      "Mistake_Details": "You thought if you got pregnant, he'd commit. But pregnancy doesn't create commitment in a man who isn't already committed.",
      "Mistake_Lesson": "Never use pregnancy as a trap. It doesn't work.",
      "Mistake_Tag": "Reality"
    },
    "Mistake187": {
      "Mistake_Title": "Not Recognizing When He Started Gaslighting You",
      "Mistake_Details": "He'd deny things he said, make you question your memory, and convince you that you were crazy. You didn't recognize this abuse.",
      "Mistake_Lesson": "Gaslighting is abuse. Leave immediately.",
      "Mistake_Tag": "Abuse"
    },
    "Mistake188": {
      "Mistake_Title": "Accepting His Jealousy of Your Achievements",
      "Mistake_Details": "When you succeeded, he didn't celebrate — he got jealous or competitive. He felt threatened by your wins.",
      "Mistake_Lesson": "A healthy partner celebrates your success.",
      "Mistake_Tag": "Support"
    },
    "Mistake189": {
      "Mistake_Title": "Not Asking About His Views on Women's Rights",
      "Mistake_Details": "He held sexist views, didn't respect women's autonomy, or believed women should be submissive. You didn't address this.",
      "Mistake_Lesson": "Know his views on women. They predict how he'll treat you.",
      "Mistake_Tag": "Values"
    },
    "Mistake190": {
      "Mistake_Title": "Staying in a Relationship Out of Familiarity",
      "Mistake_Details": "You stayed because you were used to him, not because you wanted to be with him. Comfort mistaken for love.",
      "Mistake_Lesson": "Familiarity isn't a reason to stay. Love and respect are.",
      "Mistake_Tag": "Honesty"
    },
    "Mistake191": {
      "Mistake_Title": "Not Verifying His Claims About His Past",
      "Mistake_Details": "He told you stories about his past relationships, his career, his family. You believed them without verification.",
      "Mistake_Lesson": "Verify claims. Liars build narratives early.",
      "Mistake_Tag": "Truth"
    },
    "Mistake192": {
      "Mistake_Title": "Accepting That He 'Doesn't Do' Apologies",
      "Mistake_Details": "He refused to apologize when he hurt you. He saw apologies as weakness. This refusal caused continued hurt.",
      "Mistake_Lesson": "A man who won't apologize won't take responsibility. Leave.",
      "Mistake_Tag": "Dealbreaker"
    },
    "Mistake193": {
      "Mistake_Title": "Not Discussing His Stance on Fidelity",
      "Mistake_Details": "You never asked what fidelity meant to him, whether he believed in it, or how he handled temptation. You assumed.",
      "Mistake_Lesson": "Discuss fidelity explicitly. Know where he stands.",
      "Mistake_Tag": "Clarity"
    },
    "Mistake194": {
      "Mistake_Title": "Letting His Insecurity Become Your Problem",
      "Mistake_Details": "He was insecure, so he controlled you, checked on you constantly, and demanded reassurance. You became his emotional support animal.",
      "Mistake_Lesson": "His insecurity is his to work on. Don't manage it.",
      "Mistake_Tag": "Boundaries"
    },
    "Mistake195": {
      "Mistake_Title": "Not Taking Your Safety Seriously",
      "Mistake_Details": "He made you feel unsafe — physically, emotionally, or mentally. You dismissed these feelings as being too sensitive.",
      "Mistake_Lesson": "Your safety is paramount. If you feel unsafe, leave.",
      "Mistake_Tag": "Safety"
    },
    "Mistake196": {
      "Mistake_Title": "Believing That Love Conquers All Obstacles",
      "Mistake_Details": "You had incompatibility, different life goals, and core value differences. But you believed love would overcome everything.",
      "Mistake_Lesson": "Love doesn't conquer incompatibility. It just postpones the inevitable.",
      "Mistake_Tag": "Reality"
    },
    "Mistake197": {
      "Mistake_Title": "Not Questioning His Lack of Ambition",
      "Mistake_Details": "He had no goals, no drive, no direction. He was content being stagnant. You accepted this.",
      "Mistake_Lesson": "A man without ambition won't build a life with you.",
      "Mistake_Tag": "Compatibility"
    },
    "Mistake198": {
      "Mistake_Title": "Accepting That He Needed 'Alone Time' But Never Reciprocated",
      "Mistake_Details": "He needed space, but when you asked for alone time, he got upset. The need for space was one-directional.",
      "Mistake_Lesson": "Healthy relationships have reciprocal boundaries.",
      "Mistake_Tag": "Reciprocity"
    },
    "Mistake199": {
      "Mistake_Title": "Not Addressing His Porn Addiction",
      "Mistake_Details": "He watched excessive porn and it affected his attraction to you and your sex life. You didn't address it.",
      "Mistake_Lesson": "Address addiction early. It only gets worse.",
      "Mistake_Tag": "Dealbreaker"
    },
    "Mistake200": {
      "Mistake_Title": "Believing You Were Special and Different From His Exes",
      "Mistake_Details": "He said you were different from all his exes, more special, the one he'd always wanted. But his exes probably heard the same thing.",
      "Mistake_Lesson": "If he says this, be cautious. It's manipulation.",
      "Mistake_Tag": "Warning"
    },
    "Mistake201": {
      "Mistake_Title": "Not Discussing His Relationship With Money",
      "Mistake_Details": "He was financially irresponsible — overspending, debt, poor planning. You didn't discuss how this would affect you.",
      "Mistake_Lesson": "Financial responsibility matters. Discuss it early.",
      "Mistake_Tag": "Compatibility"
    },
    "Mistake202": {
      "Mistake_Title": "Accepting His Excuses for Why He Didn't Meet Your Family",
      "Mistake_Details": "He kept postponing meeting your family. Every excuse he gave, you accepted. His reluctance was a sign.",
      "Mistake_Lesson": "A man serious about you wants to meet your family.",
      "Mistake_Tag": "Integration"
    },
    "Mistake203": {
      "Mistake_Title": "Not Questioning His Excessive Anger",
      "Mistake_Details": "He had uncontrolled anger — yelling, throwing things, being aggressive. You didn't recognize this as abuse.",
      "Mistake_Lesson": "Uncontrolled anger is abuse. Leave immediately.",
      "Mistake_Tag": "Safety"
    },
    "Mistake204": {
      "Mistake_Title": "Letting Him Take Credit for Your Accomplishments",
      "Mistake_Details": "You achieved something, and he took credit or claimed he was part of it when he wasn't. You let it slide.",
      "Mistake_Lesson": "Never let anyone diminish or steal your accomplishments.",
      "Mistake_Tag": "Respect"
    },
    "Mistake205": {
      "Mistake_Title": "Not Asking Him About His Sexual History",
      "Mistake_Details": "You never discussed his sexual history, STI history, or past behavior. This information is important for your health.",
      "Mistake_Lesson": "Ask about sexual history. Your health depends on it.",
      "Mistake_Tag": "Health"
    },
    "Mistake206": {
      "Mistake_Title": "Accepting That He Was 'Too Busy' for You",
      "Mistake_Details": "He was always too busy for dates, calls, or quality time. But he wasn't too busy for other things that mattered to him.",
      "Mistake_Lesson": "If he's too busy for you, he's not that into you.",
      "Mistake_Tag": "Reality"
    },
    "Mistake207": {
      "Mistake_Title": "Not Recognizing Love-Bombing as Manipulation",
      "Mistake_Details": "Early on, he was overwhelming — constant attention, expensive gifts, declarations of love. This was manipulation, not romance.",
      "Mistake_Lesson": "Love-bombing is a red flag. Real love develops gradually.",
      "Mistake_Tag": "Warning"
    },
    "Mistake208": {
      "Mistake_Title": "Believing That Your Support Would Fix Him",
      "Mistake_Details": "He had problems — with his career, his health, his family. You thought your support and love would fix everything.",
      "Mistake_Lesson": "Your support can't fix someone who doesn't want to fix themselves.",
      "Mistake_Tag": "Boundaries"
    },
    "Mistake209": {
      "Mistake_Title": "Not Leaving When He Made You Doubt Your Reality",
      "Mistake_Details": "He'd contradict you about things you knew to be true, making you question your memory and perception. This is gaslighting.",
      "Mistake_Lesson": "Questioning your sanity is abuse. Leave immediately.",
      "Mistake_Tag": "Abuse"
    },
    "Mistake210": {
      "Mistake_Title": "Staying In a Relationship That Slowly Killed Your Spirit",
      "Mistake_Details": "The relationship dimmed your light, killed your joy, made you smaller. But you stayed because leaving felt harder.",
      "Mistake_Lesson": "Your spirit matters more than staying comfortable. Choose yourself.",
      "Mistake_Tag": "Self-Preservation"
    },
    "Mistake211": {
      "Mistake_Title": "Not Asking What He Wanted From the Relationship",
      "Mistake_Details": "You never had the direct conversation about what he actually wanted. You assumed you knew based on his behavior.",
      "Mistake_Lesson": "Ask direct questions about his intentions and expectations.",
      "Mistake_Tag": "Communication"
    },
    "Mistake212": {
      "Mistake_Title": "Accepting His Inconsistency as 'Just How He Is'",
      "Mistake_Details": "One day he was loving, the next distant. One day he wanted commitment, the next he was unsure. You normalized this.",
      "Mistake_Lesson": "Consistency reveals commitment. Inconsistency reveals indecision.",
      "Mistake_Tag": "Patterns"
    },
    "Mistake213": {
      "Mistake_Title": "Not Taking His Wandering Eye Seriously",
      "Mistake_Details": "He constantly looked at other women, checked out their bodies, or made comments. You didn't address this disrespect.",
      "Mistake_Lesson": "A man who respects you doesn't check out other women in front of you.",
      "Mistake_Tag": "Respect"
    },
    "Mistake214": {
      "Mistake_Title": "Believing That Marrying Him Would Prevent Cheating",
      "Mistake_Details": "He flirted with others, had questionable friendships with exes. You thought marriage would stop this behavior.",
      "Mistake_Lesson": "A ring doesn't prevent infidelity. Character does.",
      "Mistake_Tag": "Reality"
    },
    "Mistake215": {
      "Mistake_Title": "Not Recognizing When He Became Your Entire World",
      "Mistake_Details": "Your friends, hobbies, interests, and goals disappeared. He became your life. You lost yourself.",
      "Mistake_Lesson": "Maintain your identity. Don't lose yourself in a relationship.",
      "Mistake_Tag": "Balance"
    },
    "Mistake216": {
      "Mistake_Title": "Accepting That He Needed 'Permission' to Do Things",
      "Mistake_Details": "He acted like he needed your approval for everything. You realized later this was manipulation to make you feel powerful.",
      "Mistake_Lesson": "Healthy adults don't need permission. This is a red flag.",
      "Mistake_Tag": "Control"
    },
    "Mistake217": {
      "Mistake_Title": "Not Discussing His Relationship With His Mother",
      "Mistake_Details": "He was either overly attached to his mother or had a poor relationship with her. This dynamic predicts how he'll treat you.",
      "Mistake_Lesson": "A man's relationship with his mother matters. Pay attention.",
      "Mistake_Tag": "Family Dynamics"
    },
    "Mistake218": {
      "Mistake_Title": "Believing That Your Presence Would Prevent Him From Cheating",
      "Mistake_Details": "You tried to be present enough, attractive enough, and available enough that he wouldn't cheat. But he did anyway.",
      "Mistake_Lesson": "You can't prevent cheating. His choices are his own.",
      "Mistake_Tag": "Reality"
    },
    "Mistake219": {
      "Mistake_Title": "Not Acknowledging When He Stopped Trying",
      "Mistake_Details": "He stopped initiating dates, stopped planning, stopped putting in effort. You carried the entire relationship.",
      "Mistake_Lesson": "Notice when effort stops. It's often the beginning of the end.",
      "Mistake_Tag": "Awareness"
    },
    "Mistake220": {
      "Mistake_Title": "Staying In a Relationship Because You Couldn't Stand Being Alone",
      "Mistake_Details": "Your fear of being alone was bigger than your desire to leave. You stayed in an unhappy relationship for companionship.",
      "Mistake_Lesson": "Being alone is better than being with the wrong person.",
      "Mistake_Tag": "Self-Worth"
    },
    "Mistake221": {
      "Mistake_Title": "Not Asking Him About His Deal-Breakers",
      "Mistake_Details": "You never asked what would cause him to leave. This information would have shown you his priorities.",
      "Mistake_Lesson": "Know his deal-breakers. They reveal his values.",
      "Mistake_Tag": "Communication"
    },
    "Mistake222": {
      "Mistake_Title": "Accepting That He 'Couldn't Help' Flirting",
      "Mistake_Details": "He flirted with other women and said he 'couldn't help it.' You accepted this as his nature.",
      "Mistake_Lesson": "Men who respect you don't flirt with others. This is a choice.",
      "Mistake_Tag": "Respect"
    },
    "Mistake223": {
      "Mistake_Title": "Not Having a Prenup Conversation Before Marriage",
      "Mistake_Details": "You got married without discussing finances, prenup, or what would happen if you divorced. This left you vulnerable.",
      "Mistake_Lesson": "Discuss finances and prenup before marriage.",
      "Mistake_Tag": "Protection"
    },
    "Mistake224": {
      "Mistake_Title": "Believing That You Could Make Him Love You More",
      "Mistake_Details": "He loved you, but not enough. You thought if you tried harder, loved deeper, or were better, he'd love you more.",
      "Mistake_Lesson": "You can't make someone love you more. Love isn't proportional to effort.",
      "Mistake_Tag": "Reality"
    },
    "Mistake225": {
      "Mistake_Title": "Not Discussing What Would Happen if You Couldn't Have Kids",
      "Mistake_Details": "You wanted kids but never discussed what would happen if you were infertile. This could have been a dealbreaker.",
      "Mistake_Lesson": "Discuss contingencies early. Know if you're aligned.",
      "Mistake_Tag": "Planning"
    },
    "Mistake226": {
      "Mistake_Title": "Accepting That He 'Wasn't Good With Communication'",
      "Mistake_Details": "He didn't communicate about his feelings, wasn't responsive to your needs, and shut down conversations. You accepted this.",
      "Mistake_Lesson": "Communication is essential. If he won't do it, that's incompatibility.",
      "Mistake_Tag": "Dealbreaker"
    },
    "Mistake227": {
      "Mistake_Title": "Not Setting Expectations for How You'd Be Treated",
      "Mistake_Details": "You never explicitly said 'This is how I need to be treated.' You expected him to know through your behavior.",
      "Mistake_Lesson": "Set expectations clearly. Don't assume he knows.",
      "Mistake_Tag": "Clarity"
    },
    "Mistake228": {
      "Mistake_Title": "Believing That Couples Who Started Bad Could End Good",
      "Mistake_Details": "You met in an unethical way — he was with someone when you started. You thought if you stayed loyal, it would be different.",
      "Mistake_Lesson": "How a relationship starts often predicts how it ends.",
      "Mistake_Tag": "Reality"
    },
    "Mistake229": {
      "Mistake_Title": "Not Leaving When You Found Evidence of Betrayal",
      "Mistake_Details": "You found messages, emails, or other evidence he was deceiving you. But instead of leaving, you confronted and stayed.",
      "Mistake_Lesson": "Evidence of betrayal is reason to leave. Don't negotiate.",
      "Mistake_Tag": "Self-Respect"
    },
    "Mistake230": {
      "Mistake_Title": "Accepting His Version of Events Over Your Experience",
      "Mistake_Details": "Something happened, and you experienced it one way. He told a different story. You believed him over your own memory.",
      "Mistake_Lesson": "Your experience is valid. Don't let him rewrite your reality.",
      "Mistake_Tag": "Truth"
    },
    "Mistake231": {
      "Mistake_Title": "Not Taking His Substance Abuse Seriously",
      "Mistake_Details": "He drank too much, used drugs, or had an addiction. You didn't recognize it as a serious issue affecting the relationship.",
      "Mistake_Lesson": "Addiction is a dealbreaker. He needs to want to change.",
      "Mistake_Tag": "Health"
    },
    "Mistake232": {
      "Mistake_Title": "Believing That a Baby Would Fix the Relationship",
      "Mistake_Details": "Things weren't working, so you thought having a baby would bring you closer and make him commit.",
      "Mistake_Lesson": "A baby doesn't fix a broken relationship. It complicates it.",
      "Mistake_Tag": "Reality"
    },
    "Mistake233": {
      "Mistake_Title": "Not Recognizing Coercive Control",
      "Mistake_Details": "He controlled your finances, your friendships, what you wore, where you went. You didn't recognize this as abuse.",
      "Mistake_Lesson": "Control is abuse. Leave immediately.",
      "Mistake_Tag": "Abuse"
    },
    "Mistake234": {
      "Mistake_Title": "Accepting That He Had 'Baggage' From His Past",
      "Mistake_Details": "He had unresolved trauma, and you made excuses for his bad behavior because of it. His past isn't an excuse.",
      "Mistake_Lesson": "Past trauma explains behavior but doesn't excuse it.",
      "Mistake_Tag": "Accountability"
    },
    "Mistake235": {
      "Mistake_Title": "Not Asking Him About His Expectations for Marriage",
      "Mistake_Details": "You assumed you wanted the same things from marriage. You never discussed expectations for roles, finances, or lifestyle.",
      "Mistake_Lesson": "Discuss marriage expectations explicitly before saying yes.",
      "Mistake_Tag": "Planning"
    },
    "Mistake236": {
      "Mistake_Title": "Staying Because You Thought It Would Get Better 'Eventually'",
      "Mistake_Details": "Things were bad, but you stayed thinking 'eventually' it would improve. Eventually never came.",
      "Mistake_Lesson": "If it's not working now, waiting won't fix it.",
      "Mistake_Tag": "Hope"
    },
    "Mistake237": {
      "Mistake_Title": "Not Taking His Lies About Small Things Seriously",
      "Mistake_Details": "He lied about small things — where he was, what he was doing, who he was with. You didn't realize these were signs of bigger lies.",
      "Mistake_Lesson": "Small lies predict big lies. Take all dishonesty seriously.",
      "Mistake_Tag": "Trust"
    },
    "Mistake238": {
      "Mistake_Title": "Accepting His Refusal to Introduce You as His Girlfriend",
      "Mistake_Details": "He'd say 'This is my friend' or give you a vague introduction instead of claiming you as his girlfriend. You didn't push back.",
      "Mistake_Lesson": "A man serious about you claims you publicly.",
      "Mistake_Tag": "Status"
    },
    "Mistake239": {
      "Mistake_Title": "Not Recognizing When He Started Planning His Exit",
      "Mistake_Details": "He talked about moving, getting a new job, or going back to school but didn't include you in these plans. You ignored the signs.",
      "Mistake_Lesson": "A man planning his future should include you in it.",
      "Mistake_Tag": "Signs"
    },
    "Mistake240": {
      "Mistake_Title": "Staying In a Relationship Because Leaving Would Disappoint Others",
      "Mistake_Details": "Your family and friends loved him, so you stayed even though you were unhappy. Their opinions mattered more than your happiness.",
      "Mistake_Lesson": "Your happiness is your responsibility. Leave despite others' opinions.",
      "Mistake_Tag": "Self-Worth"
    },
    "Mistake241": {
      "Mistake_Title": "Not Discussing His Religious or Spiritual Beliefs",
      "Mistake_Details": "He had different beliefs than you, but you assumed it wouldn't matter. It affected major life decisions.",
      "Mistake_Lesson": "Religious/spiritual compatibility matters. Discuss it early.",
      "Mistake_Tag": "Values"
    },
    "Mistake242": {
      "Mistake_Title": "Accepting That He 'Needed' to Check His Phone Constantly",
      "Mistake_Details": "He was always on his phone, messaging someone, or distracted. He said he 'needed' to stay connected for work.",
      "Mistake_Lesson": "Constant phone use during quality time is disrespectful.",
      "Mistake_Tag": "Presence"
    },
    "Mistake243": {
      "Mistake_Title": "Not Leaving When He Became Your Therapist's Main Topic",
      "Mistake_Details": "Your therapist kept bringing up concerns about the relationship. You ignored the professional opinion.",
      "Mistake_Lesson": "Listen to your therapist. They see patterns you miss.",
      "Mistake_Tag": "Wisdom"
    },
    "Mistake244": {
      "Mistake_Title": "Believing That He'd Change After Getting Married",
      "Mistake_Details": "He had annoying habits or character flaws before marriage. You thought marriage would motivate him to change.",
      "Mistake_Lesson": "Marriage amplifies problems. It doesn't fix them.",
      "Mistake_Tag": "Reality"
    },
    "Mistake245": {
      "Mistake_Title": "Not Asking About His Financial Goals and Plans",
      "Mistake_Details": "You never discussed his financial future, savings, investments, or retirement plans. This information is crucial.",
      "Mistake_Lesson": "Know his financial goals. They affect your shared future.",
      "Mistake_Tag": "Planning"
    },
    "Mistake246": {
      "Mistake_Title": "Accepting Conditional Love",
      "Mistake_Details": "His love came with conditions — you had to look a certain way, act a certain way, do certain things. It wasn't unconditional.",
      "Mistake_Lesson": "Real love isn't conditional. It doesn't come with requirements.",
      "Mistake_Tag": "Love"
    },
    "Mistake247": {
      "Mistake_Title": "Not Walking Away When He Refused to Take You Seriously",
      "Mistake_Details": "When you tried to have serious conversations about the relationship, he joked or changed the subject. He wouldn't engage.",
      "Mistake_Lesson": "A man who won't take you seriously won't respect you.",
      "Mistake_Tag": "Respect"
    },
    "Mistake248": {
      "Mistake_Title": "Staying In a Relationship You'd Never Recommend to a Friend",
      "Mistake_Details": "You'd never tell your friend to date this man, yet you stayed. This contradiction shows you knew it was wrong.",
      "Mistake_Lesson": "If you wouldn't recommend it to a friend, why is it good enough for you?",
      "Mistake_Tag": "Red Flag"
    },
    "Mistake249": {
      "Mistake_Title": "Not Recognizing When He Started Weaponizing Your Insecurities",
      "Mistake_Details": "He knew your insecurities and used them against you in arguments. He deliberately hurt you.",
      "Mistake_Lesson": "A man who weaponizes your insecurities is cruel. Leave.",
      "Mistake_Tag": "Abuse"
    },
    "Mistake250": {
      "Mistake_Title": "Staying Until You Had No Choice But to Leave",
      "Mistake_Details": "You stayed until the relationship became unbearable. Until you were broken. Until leaving was the only way to survive.",
      "Mistake_Lesson": "Don't wait until you're shattered. Leave before you lose yourself completely.",
      "Mistake_Tag": "Self-Preservation"
    },

    "Mistake261": {
      "Mistake_Title": "Not Verifying His Social Media Before Dating",
      "Mistake_Details": "You didn't check his social media until deep into dating. When you finally did, you found pictures with exes, suspicious posts, or evidence he was hiding things.",
      "Mistake_Lesson": "Check social media early. It reveals a lot about who he is.",
      "Mistake_Tag": "Verification"
    },
    "Mistake262": {
      "Mistake_Title": "Accepting His Version of Why Relationships Ended",
      "Mistake_Details": "He told you why his exes broke up with him. You believed his story without considering his role. Later, you realized the pattern was him.",
      "Mistake_Lesson": "A man's explanation of past breakups reveals his perspective, not always the truth.",
      "Mistake_Tag": "Red Flags"
    },
    "Mistake263": {
      "Mistake_Title": "Not Asking About His Relationship With Food or Body Image",
      "Mistake_Details": "He had unhealthy relationships with food, his body, or exercise. This affected his mental health and moods.",
      "Mistake_Lesson": "Understand his relationship with his body. It affects the relationship.",
      "Mistake_Tag": "Compatibility"
    },
    "Mistake264": {
      "Mistake_Title": "Staying With Him Despite Constant Betrayals",
      "Mistake_Details": "He betrayed you repeatedly — emotionally, physically, or financially. You stayed hoping he'd stop.",
      "Mistake_Lesson": "Betrayal is a dealbreaker. Once is enough.",
      "Mistake_Tag": "Dealbreaker"
    },
    "Mistake265": {
      "Mistake_Title": "Not Recognizing When He Was Using You",
      "Mistake_Details": "He used you for sex, money, housing, or emotional support. You gave freely thinking it was love.",
      "Mistake_Lesson": "Real love isn't transactional. If he's only there when he needs something, he's using you.",
      "Mistake_Tag": "Warning"
    },
    "Mistake266": {
      "Mistake_Title": "Accepting That He Needed to 'Grow Up'",
      "Mistake_Details": "He was immature, irresponsible, and you thought maturity would come with time or your influence.",
      "Mistake_Lesson": "Men don't mature in relationships. They mature on their own or not at all.",
      "Mistake_Tag": "Reality"
    },
    "Mistake267": {
      "Mistake_Title": "Not Having Standards for His Treatment of Service Workers",
      "Mistake_Details": "He was rude to servers, impatient with cashiers, dismissive of people 'below' him. This showed his true character.",
      "Mistake_Lesson": "How he treats service workers is how he'll treat you when the honeymoon fades.",
      "Mistake_Tag": "Character"
    },
    "Mistake268": {
      "Mistake_Title": "Believing That You Could Be Enough for Him",
      "Mistake_Details": "He had issues — with drinking, with anger, with commitment. You thought your love would be enough to fix him.",
      "Mistake_Lesson": "You can't be enough for someone broken. He has to fix himself.",
      "Mistake_Tag": "Boundaries"
    },
    "Mistake269": {
      "Mistake_Title": "Not Asking About His Voting History and Political Views",
      "Mistake_Details": "You never discussed politics or his voting record. Later, you discovered fundamental value differences.",
      "Mistake_Lesson": "Know his political values. They predict how he'll treat people and the world.",
      "Mistake_Tag": "Values"
    },
    "Mistake270": {
      "Mistake_Title": "Staying With Him Because You Felt You Owed Him",
      "Mistake_Details": "He did things for you early on, and you felt indebted. You stayed out of obligation, not love.",
      "Mistake_Lesson": "Gifts and kindness don't create obligation to stay.",
      "Mistake_Tag": "Guilt"
    },
    "Mistake271": {
      "Mistake_Title": "Not Recognizing Selective Vulnerability as Manipulation",
      "Mistake_Details": "He'd be vulnerable, cry, and share stories designed to make you feel protective. It was calculated manipulation.",
      "Mistake_Lesson": "Real vulnerability isn't strategic. Selective sharing is manipulation.",
      "Mistake_Tag": "Warning"
    },
    "Mistake272": {
      "Mistake_Title": "Accepting That He Wasn't 'The Marriage Type'",
      "Mistake_Details": "He said marriage wasn't for him, but you believed that with you it would be different. It wasn't.",
      "Mistake_Lesson": "Believe what he says about his views on marriage. Don't expect to change his mind.",
      "Mistake_Tag": "Honesty"
    },
    "Mistake273": {
      "Mistake_Title": "Not Setting Boundaries Around His Friendships",
      "Mistake_Details": "He had friendships with women that made you uncomfortable. You didn't voice it or set boundaries.",
      "Mistake_Lesson": "Your discomfort matters. Address it if it's a problem.",
      "Mistake_Tag": "Boundaries"
    },
    "Mistake274": {
      "Mistake_Title": "Believing That Distance Would Make Him Miss You",
      "Mistake_Details": "You thought if you withdrew, he'd pursue you and realize what he was missing. Instead, he replaced you.",
      "Mistake_Lesson": "Playing games with distance doesn't work. It just pushes him away permanently.",
      "Mistake_Tag": "Games"
    },
    "Mistake275": {
      "Mistake_Title": "Not Leaving When He Consistently Failed at Meeting Needs",
      "Mistake_Details": "You expressed needs repeatedly. He acknowledged them but never changed. You stayed hoping this time would be different.",
      "Mistake_Lesson": "Repeated failure to meet your needs is intentional, not accidental.",
      "Mistake_Tag": "Patterns"
    },
    "Mistake276": {
      "Mistake_Title": "Accepting His Insistence That You Were Too Sensitive",
      "Mistake_Details": "When you expressed hurt, he said you were overreacting or too sensitive. You internalized this criticism.",
      "Mistake_Lesson": "Your feelings are valid. Don't let him invalidate them.",
      "Mistake_Tag": "Validation"
    },
    "Mistake277": {
      "Mistake_Title": "Not Asking About His Relationship With Honesty",
      "Mistake_Details": "You never discussed his philosophy on honesty and lying. You assumed he valued the truth.",
      "Mistake_Lesson": "Know where he stands on honesty before you give him your trust.",
      "Mistake_Tag": "Trust"
    },
    "Mistake278": {
      "Mistake_Title": "Staying Despite Knowing He Doesn't Respect You",
      "Mistake_Details": "His actions, words, and behavior showed disrespect. Yet you stayed, hoping he'd change.",
      "Mistake_Lesson": "Respect is foundational. Without it, nothing else matters.",
      "Mistake_Tag": "Non-Negotiable"
    },
    "Mistake279": {
      "Mistake_Title": "Not Recognizing When He Started Resenting You",
      "Mistake_Details": "His tone changed, his affection diminished, he criticized you more. He started resenting you, and you didn't address it.",
      "Mistake_Lesson": "Resentment grows when unaddressed. Address it early or accept the relationship is over.",
      "Mistake_Tag": "Patterns"
    },
    "Mistake280": {
      "Mistake_Title": "Believing That His Promises of Change Were Real",
      "Mistake_Details": "He promised to change, to be better, to treat you differently. You believed him. He didn't change.",
      "Mistake_Lesson": "Change requires action. Promises are just words.",
      "Mistake_Tag": "Reality"
    },
    "Mistake281": {
      "Mistake_Title": "Not Taking His Flirtation With Other Women as a Sign",
      "Mistake_Details": "He flirted with waitresses, bartenders, or other women when you were together. You didn't recognize this as disrespect.",
      "Mistake_Lesson": "Flirting with others in front of you is disrespect. Don't tolerate it.",
      "Mistake_Tag": "Red Flags"
    },
    "Mistake282": {
      "Mistake_Title": "Accepting His Excuse That His Ex Was 'Crazy'",
      "Mistake_Details": "He said his ex was crazy, unstable, or unreasonable. This is what he'll say about you to the next woman.",
      "Mistake_Lesson": "Men who blame exes are showing you their pattern. Don't be the next 'crazy' ex.",
      "Mistake_Tag": "Warning"
    },
    "Mistake283": {
      "Mistake_Title": "Not Leaving When Your Gut Screamed to Run",
      "Mistake_Details": "Every fiber of your being said 'run.' But you stayed because you loved him or were afraid of being alone.",
      "Mistake_Lesson": "Your gut doesn't lie. When it screams, listen.",
      "Mistake_Tag": "Intuition"
    },
    "Mistake284": {
      "Mistake_Title": "Believing That Marrying Him Would Finally Make Him Faithful",
      "Mistake_Details": "He was unfaithful while dating. You thought marriage would stop it. It didn't.",
      "Mistake_Lesson": "A ring doesn't change his character. If he cheated before, he'll cheat again.",
      "Mistake_Tag": "Reality"
    },
    "Mistake285": {
      "Mistake_Title": "Not Recognizing Intermittent Reinforcement as Manipulation",
      "Mistake_Details": "Sometimes he was wonderful, sometimes he was cold. The unpredictability kept you addicted to the relationship.",
      "Mistake_Lesson": "Intermittent reinforcement is a manipulation tactic. It's designed to keep you hooked.",
      "Mistake_Tag": "Manipulation"
    },
    "Mistake286": {
      "Mistake_Title": "Accepting That He Needed Space While Denying It to You",
      "Mistake_Details": "He took space whenever he needed it, but when you asked, he made you feel guilty. The boundary was one-sided.",
      "Mistake_Lesson": "Healthy boundaries work both ways.",
      "Mistake_Tag": "Equality"
    },
    "Mistake287": {
      "Mistake_Title": "Not Asking What His Ideal Woman Looks Like",
      "Mistake_Details": "You never asked his ideal of beauty or personality. Later, you realized you didn't meet his standards.",
      "Mistake_Lesson": "Know if you fit his ideal. If not, you'll always feel less-than.",
      "Mistake_Tag": "Clarity"
    },
    "Mistake288": {
      "Mistake_Title": "Staying Because You Didn't Want to Be a Failure",
      "Mistake_Details": "You viewed the breakup as personal failure. You stayed to 'prove' the relationship could work.",
      "Mistake_Lesson": "Ending a bad relationship isn't failure. It's wisdom.",
      "Mistake_Tag": "Pride"
    },
    "Mistake289": {
      "Mistake_Title": "Not Recognizing His Entitlement",
      "Mistake_Details": "He felt entitled to your time, your body, your attention. He saw your boundaries as obstacles.",
      "Mistake_Lesson": "Entitlement is a red flag. A man who feels entitled will take what he wants.",
      "Mistake_Tag": "Warning"
    },
    "Mistake290": {
      "Mistake_Title": "Accepting His Explanation That He 'Forgot' Important Things",
      "Mistake_Details": "He forgot your birthday, your anniversary, your needs. You accepted that he 'just forgets things.'",
      "Mistake_Lesson": "He remembers what matters to him. If he forgets you, you don't matter.",
      "Mistake_Tag": "Reality"
    },
    "Mistake291": {
      "Mistake_Title": "Not Leaving When He Made You Feel Small and Powerless",
      "Mistake_Details": "His presence made you feel small. You second-guessed yourself constantly. You lost your confidence.",
      "Mistake_Lesson": "A healthy relationship makes you feel bigger, not smaller.",
      "Mistake_Tag": "Self-Worth"
    },
    "Mistake292": {
      "Mistake_Title": "Believing That More Money Would Make Him Happier With You",
      "Mistake_Details": "You thought if you made more money or had more status, he'd value you more and treat you better.",
      "Mistake_Lesson": "Your worth isn't tied to your paycheck. A man who values you respects you regardless.",
      "Mistake_Tag": "Self-Worth"
    },
    "Mistake293": {
      "Mistake_Title": "Not Asking About His Habits and Rituals Early",
      "Mistake_Details": "You didn't know his daily habits, rituals, or lifestyle until you moved in. Incompatibilities surfaced.",
      "Mistake_Lesson": "Understand his lifestyle and habits early. They affect compatibility.",
      "Mistake_Tag": "Communication"
    },
    "Mistake294": {
      "Mistake_Title": "Accepting That He Had 'Bad Days' That Became 'Bad Weeks'",
      "Mistake_Details": "His bad days turned into bad weeks, which turned into bad months. You accommodated his moods indefinitely.",
      "Mistake_Lesson": "His moods aren't your responsibility to fix.",
      "Mistake_Tag": "Boundaries"
    },
    "Mistake295": {
      "Mistake_Title": "Not Leaving When He Stopped Trying to Understand You",
      "Mistake_Details": "He stopped asking about your day, your feelings, your dreams. He became indifferent to your inner world.",
      "Mistake_Lesson": "A partner who stops trying to understand you has emotionally left.",
      "Mistake_Tag": "Signs"
    },
    "Mistake296": {
      "Mistake_Title": "Believing That Couples With Secrets Were Still Connected",
      "Mistake_Details": "You kept secrets from each other, thinking it was protecting the relationship. It was eroding it.",
      "Mistake_Lesson": "Trust requires transparency. Secrets destroy intimacy.",
      "Mistake_Tag": "Trust"
    },
    "Mistake297": {
      "Mistake_Title": "Not Recognizing When He Became Your Entire Purpose",
      "Mistake_Details": "Your purpose, your goals, your life became about making him happy. You lost your own direction.",
      "Mistake_Lesson": "Never lose your purpose. A relationship should enhance your life, not become it.",
      "Mistake_Tag": "Identity"
    },
    "Mistake298": {
      "Mistake_Title": "Accepting His Excuse That He Was 'Going Through Something'",
      "Mistake_Details": "He was going through something — stress, family issues, work problems. You accepted mistreatment because of it.",
      "Mistake_Lesson": "Going through something isn't an excuse for bad behavior.",
      "Mistake_Tag": "Accountability"
    },
    "Mistake299": {
      "Mistake_Title": "Not Leaving When the Relationship Started Affecting Your Health",
      "Mistake_Details": "You developed anxiety, depression, or physical ailments from the stress of the relationship.",
      "Mistake_Lesson": "Your health is more important than staying. Leave if it's harming you.",
      "Mistake_Tag": "Health"
    },
    "Mistake300": {
      "Mistake_Title": "Staying Until You Hated Him More Than You Loved Him",
      "Mistake_Details": "By the end, you stayed until resentment and hate outweighed love. You should have left years earlier.",
      "Mistake_Lesson": "Don't wait until you hate him to leave. Leave when it's no longer serving you.",
      "Mistake_Tag": "Timing"
    },

    "Mistake301": {
      "Mistake_Title": "Not Asking About His Relationship With Alcohol Early",
      "Mistake_Details": "You never discussed his relationship with drinking. He seemed to drink socially, but it escalated into dependency during the relationship.",
      "Mistake_Lesson": "Know his drinking habits early. Alcohol abuse gets worse, not better.",
      "Mistake_Tag": "Health"
    },
    "Mistake302": {
      "Mistake_Title": "Believing His Excuses for Why He Couldn't Commit",
      "Mistake_Details": "He gave reasons why he couldn't commit — past trauma, work stress, family issues. You accepted these as temporary obstacles.",
      "Mistake_Lesson": "If he can't commit after a reasonable time, he won't commit. Period.",
      "Mistake_Tag": "Reality"
    },
    "Mistake303": {
      "Mistake_Title": "Not Recognizing When He Started Checking Out Emotionally",
      "Mistake_Details": "He became emotionally distant, stopped sharing, and withdrew. You didn't address it; you just accepted the coldness.",
      "Mistake_Lesson": "Emotional withdrawal is a sign the relationship is dying. Address it or accept it's over.",
      "Mistake_Tag": "Signs"
    },
    "Mistake304": {
      "Mistake_Title": "Staying in a Relationship That Made You Feel Crazy",
      "Mistake_Details": "He manipulated you so much that you questioned your own sanity. You felt crazy trying to make sense of his behavior.",
      "Mistake_Lesson": "If he makes you feel crazy, he's abusive. Leave.",
      "Mistake_Tag": "Abuse"
    },
    "Mistake305": {
      "Mistake_Title": "Not Having Clear Financial Expectations Before Marriage",
      "Mistake_Details": "You married without discussing finances, debt, savings, or financial goals. Financial misalignment destroyed the relationship.",
      "Mistake_Lesson": "Discuss finances explicitly before marriage.",
      "Mistake_Tag": "Planning"
    },
    "Mistake306": {
      "Mistake_Title": "Accepting His Narrative That You Were 'Too Much'",
      "Mistake_Details": "He said you were too needy, too emotional, too demanding. You believed him and tried to be less.",
      "Mistake_Lesson": "Your needs are valid. Don't shrink yourself to fit his comfort.",
      "Mistake_Tag": "Self-Worth"
    },
    "Mistake307": {
      "Mistake_Title": "Not Leaving When He Showed Zero Interest in Your Life",
      "Mistake_Details": "He never asked about your work, your dreams, your family. He was only interested in himself.",
      "Mistake_Lesson": "A partner interested in you asks about your life. If he doesn't, he's not interested.",
      "Mistake_Tag": "Interest"
    },
    "Mistake308": {
      "Mistake_Title": "Staying With Him Because Breaking Up Would Be Messy",
      "Mistake_Details": "You knew the relationship was wrong, but breaking up seemed complicated — shared finances, shared apartment, mutual friends.",
      "Mistake_Lesson": "Staying miserable because leaving is messy is worse than dealing with the mess.",
      "Mistake_Tag": "Courage"
    },
    "Mistake309": {
      "Mistake_Title": "Not Asking About His Stance on Compromise",
      "Mistake_Details": "You never discussed how he felt about compromise. He turned out to be unwilling to compromise on anything.",
      "Mistake_Lesson": "Know if he's willing to meet you halfway. If not, you're incompatible.",
      "Mistake_Tag": "Compatibility"
    },
    "Mistake310": {
      "Mistake_Title": "Accepting That He Had 'Unresolved Issues' as Excuse",
      "Mistake_Details": "His unresolved trauma excused his bad behavior. You accepted mistreatment because of his past.",
      "Mistake_Lesson": "His past explains behavior but doesn't excuse it. He needs to work on himself.",
      "Mistake_Tag": "Accountability"
    },
    "Mistake311": {
      "Mistake_Title": "Not Recognizing Consistent Cancellations as a Pattern",
      "Mistake_Details": "He cancelled plans repeatedly. Each time had an excuse. You accepted the cancellations instead of recognizing the pattern.",
      "Mistake_Lesson": "Repeated cancellations show he doesn't prioritize you.",
      "Mistake_Tag": "Patterns"
    },
    "Mistake312": {
      "Mistake_Title": "Believing That Staying Small Would Keep Him",
      "Mistake_Details": "You downplayed your achievements, your ambitions, and your intelligence to make him feel comfortable.",
      "Mistake_Lesson": "Never shrink yourself. A man worth keeping wants you to shine.",
      "Mistake_Tag": "Self-Worth"
    },
    "Mistake313": {
      "Mistake_Title": "Not Asking About His Previous Infidelities",
      "Mistake_Details": "You never asked if he'd cheated before. He had, and you didn't know until much later.",
      "Mistake_Lesson": "Ask about past infidelities. Past behavior predicts future behavior.",
      "Mistake_Tag": "History"
    },
    "Mistake314": {
      "Mistake_Title": "Staying Because You Thought You Could Help Him",
      "Mistake_Details": "He had problems that made him mess up the relationship. You thought your help and support would fix it.",
      "Mistake_Lesson": "You can't help someone who doesn't want help. He has to do the work.",
      "Mistake_Tag": "Boundaries"
    },
    "Mistake315": {
      "Mistake_Title": "Not Recognizing When He Started Showing Contempt",
      "Mistake_Details": "His tone toward you became contemptuous. He rolled his eyes, dismissed you, and showed disdain.",
      "Mistake_Lesson": "Contempt is often the beginning of the end. It's corrosive.",
      "Mistake_Tag": "Warning"
    },
    "Mistake316": {
      "Mistake_Title": "Accepting That He Was 'Just Joking' When He Was Being Mean",
      "Mistake_Details": "He made hurtful comments then said 'I was just joking.' You accepted this excuse repeatedly.",
      "Mistake_Lesson": "Jokes at your expense aren't jokes. They're disguised cruelty.",
      "Mistake_Tag": "Respect"
    },
    "Mistake317": {
      "Mistake_Title": "Not Setting Standards Early in Dating",
      "Mistake_Details": "You didn't have standards on early dates. You tolerated poor behavior from the beginning.",
      "Mistake_Lesson": "Set standards from date one. You teach people how to treat you.",
      "Mistake_Tag": "Boundaries"
    },
    "Mistake318": {
      "Mistake_Title": "Believing That He'd Prioritize You Once You Were Official",
      "Mistake_Details": "While dating, he didn't prioritize you. You thought once you were official, this would change.",
      "Mistake_Lesson": "If he doesn't prioritize you early, he won't later.",
      "Mistake_Tag": "Reality"
    },
    "Mistake319": {
      "Mistake_Title": "Not Leaving When He Started Comparing You to His Exes",
      "Mistake_Details": "He compared you to exes — your looks, your abilities, your personality. You felt constantly inadequate.",
      "Mistake_Lesson": "A man who compares you to exes should be an ex.",
      "Mistake_Tag": "Respect"
    },
    "Mistake320": {
      "Mistake_Title": "Accepting His Lack of Effort in Planning Dates",
      "Mistake_Details": "He never planned dates. You always initiated. His lack of effort showed he wasn't invested.",
      "Mistake_Lesson": "A man interested in you makes effort to plan. If you plan everything, he's not interested.",
      "Mistake_Tag": "Effort"
    },
    "Mistake321": {
      "Mistake_Title": "Not Asking About His Views on Gender Roles",
      "Mistake_Details": "You never discussed how he felt about gender roles. Later, you realized he expected traditional roles that didn't align with you.",
      "Mistake_Lesson": "Know his views on gender roles. They predict how he'll treat you.",
      "Mistake_Tag": "Values"
    },
    "Mistake322": {
      "Mistake_Title": "Staying Because You Were Afraid of What He'd Do",
      "Mistake_Details": "You stayed because you feared his reaction if you left — anger, threats, or retaliation.",
      "Mistake_Lesson": "Fear of his reaction is abuse. Get help and leave safely.",
      "Mistake_Tag": "Safety"
    },
    "Mistake323": {
      "Mistake_Title": "Not Recognizing When He Started Blaming You for Everything",
      "Mistake_Details": "Anything that went wrong was your fault. He took no responsibility for his actions.",
      "Mistake_Lesson": "A man who blames you for everything is not taking responsibility.",
      "Mistake_Tag": "Accountability"
    },
    "Mistake324": {
      "Mistake_Title": "Believing That Your Love Would Overcome His Fears",
      "Mistake_Details": "He had fears about commitment, relationships, or intimacy. You thought your love would help him overcome them.",
      "Mistake_Lesson": "He has to overcome his own fears. Your love isn't therapy.",
      "Mistake_Tag": "Boundaries"
    },
    "Mistake325": {
      "Mistake_Title": "Not Leaving When Your Friends Stopped Including You",
      "Mistake_Details": "Your friends drifted away because you were always with him. You lost friendships trying to keep the relationship.",
      "Mistake_Lesson": "Maintain friendships. If they disappear due to a relationship, something is wrong.",
      "Mistake_Tag": "Warning"
    },
    "Mistake326": {
      "Mistake_Title": "Accepting That He 'Wasn't a Phone Person' but Was Always on His Phone",
      "Mistake_Details": "He said he wasn't a phone person, but he was constantly texting and scrolling. The lie was obvious.",
      "Mistake_Lesson": "If he's not responding to you but is on his phone constantly, he's just not into texting YOU.",
      "Mistake_Tag": "Truth"
    },
    "Mistake327": {
      "Mistake_Title": "Not Setting Boundaries Around His Time With Exes",
      "Mistake_Details": "He spent time with his ex, and you didn't voice discomfort. He became defensive when you finally brought it up.",
      "Mistake_Lesson": "Set boundaries around exes early. Your comfort matters.",
      "Mistake_Tag": "Boundaries"
    },
    "Mistake328": {
      "Mistake_Title": "Believing That His Promises of a Future Were Real",
      "Mistake_Details": "He promised a future together — engagement, marriage, babies. But his actions didn't support these promises.",
      "Mistake_Lesson": "Watch his actions, not his promises.",
      "Mistake_Tag": "Reality"
    },
    "Mistake329": {
      "Mistake_Title": "Not Asking About His Relationship With Risk",
      "Mistake_Details": "He engaged in risky behaviors — reckless driving, risky finances, risky decisions. You didn't discuss this pattern.",
      "Mistake_Lesson": "Know his risk tolerance. Risky behavior often extends to the relationship.",
      "Mistake_Tag": "Character"
    },
    "Mistake330": {
      "Mistake_Title": "Staying Because Your Family Liked Him",
      "Mistake_Details": "Your family loved him, so you stayed even though you weren't happy. Their approval mattered more than your happiness.",
      "Mistake_Lesson": "Your happiness matters more than family approval.",
      "Mistake_Tag": "Independence"
    },
    "Mistake331": {
      "Mistake_Title": "Not Recognizing When He Stopped Making Effort",
      "Mistake_Details": "Early on, he tried. Later, he stopped. You carried the entire relationship.",
      "Mistake_Lesson": "Effort should increase over time, not decrease.",
      "Mistake_Tag": "Patterns"
    },
    "Mistake332": {
      "Mistake_Title": "Accepting That He Needed 'Freedom' to Be Himself",
      "Mistake_Details": "He wanted freedom — space, time apart, loose commitment. You accepted this in hopes he'd eventually settle.",
      "Mistake_Lesson": "A man wanting freedom from you is telling you he doesn't want commitment.",
      "Mistake_Tag": "Reality"
    },
    "Mistake333": {
      "Mistake_Title": "Not Asking About His Expectations for Household Duties",
      "Mistake_Details": "You never discussed who would do what household tasks. You ended up doing everything.",
      "Mistake_Lesson": "Discuss household responsibilities explicitly.",
      "Mistake_Tag": "Communication"
    },
    "Mistake334": {
      "Mistake_Title": "Believing That His Love for You Equaled Respect",
      "Mistake_Details": "He said he loved you, but his actions showed disrespect. Love without respect isn't enough.",
      "Mistake_Lesson": "Love and respect are separate. You need both.",
      "Mistake_Tag": "Requirements"
    },
    "Mistake335": {
      "Mistake_Title": "Not Leaving When He Made You Feel Unworthy",
      "Mistake_Details": "His words and actions made you feel like you weren't good enough. Your self-esteem plummeted.",
      "Mistake_Lesson": "A healthy relationship lifts you up, not tears you down.",
      "Mistake_Tag": "Self-Worth"
    },
    "Mistake336": {
      "Mistake_Title": "Accepting That He Needed 'Me Time' But Never Gave You Space",
      "Mistake_Details": "He needed time alone, but when you asked for space, he got upset. The boundary was one-sided.",
      "Mistake_Lesson": "Healthy boundaries work both ways.",
      "Mistake_Tag": "Equality"
    },
    "Mistake337": {
      "Mistake_Title": "Not Recognizing Selective Honesty as Dishonesty",
      "Mistake_Details": "He'd tell you part of the truth but leave out important details. Incomplete honesty is still dishonesty.",
      "Mistake_Lesson": "Honesty is complete, not selective.",
      "Mistake_Tag": "Trust"
    },
    "Mistake338": {
      "Mistake_Title": "Staying Because You Wanted to Prove Him Wrong",
      "Mistake_Details": "He said you couldn't make it work, and you stayed to prove him wrong. But proving him wrong cost you.",
      "Mistake_Lesson": "Don't stay in a relationship to prove something to him.",
      "Mistake_Tag": "Motivation"
    },
    "Mistake339": {
      "Mistake_Title": "Not Asking About His Relationship With His Siblings",
      "Mistake_Details": "He had poor relationships with his siblings. This was a sign of how he treated family.",
      "Mistake_Lesson": "Family relationships reveal character patterns.",
      "Mistake_Tag": "Character"
    },
    "Mistake340": {
      "Mistake_Title": "Believing That Living Together Would Improve Things",
      "Mistake_Details": "You moved in hoping proximity would improve the relationship. It just intensified the problems.",
      "Mistake_Lesson": "Living together doesn't fix relationship issues. It magnifies them.",
      "Mistake_Tag": "Reality"
    },
    "Mistake341": {
      "Mistake_Title": "Not Leaving When He Showed Disrespect to Your Profession",
      "Mistake_Details": "He didn't value your work, made fun of your career, or didn't support your professional goals.",
      "Mistake_Lesson": "A partner should respect your career and support your professional growth.",
      "Mistake_Tag": "Respect"
    },
    "Mistake342": {
      "Mistake_Title": "Accepting That He Was 'Bad at Communication' Permanently",
      "Mistake_Details": "He refused to communicate, said he was 'just bad at it,' and you accepted this as unchangeable.",
      "Mistake_Lesson": "Communication is a skill he can develop if he wants to. If he won't, he doesn't want to.",
      "Mistake_Tag": "Dealbreaker"
    },
    "Mistake343": {
      "Mistake_Title": "Not Recognizing When He Started Taking You for Granted",
      "Mistake_Details": "He stopped saying thank you, stopped appreciating what you did. You became invisible.",
      "Mistake_Lesson": "Notice when appreciation stops. It signals the relationship is dying.",
      "Mistake_Tag": "Signs"
    },
    "Mistake344": {
      "Mistake_Title": "Staying Because You Were Embarrassed About the Failed Relationship",
      "Mistake_Details": "You stayed because admitting the relationship was failing felt embarrassing. You prioritized pride over happiness.",
      "Mistake_Lesson": "Relationships fail. That's not a reflection on you.",
      "Mistake_Tag": "Pride"
    },
    "Mistake345": {
      "Mistake_Title": "Not Asking About His Relationship With Conflict",
      "Mistake_Details": "You never discussed how he handled conflict. He turned out to be avoidant or aggressive.",
      "Mistake_Lesson": "Know how he handles conflict early. It predicts relationship health.",
      "Mistake_Tag": "Communication"
    },
    "Mistake346": {
      "Mistake_Title": "Believing That Sex Would Deepen the Connection",
      "Mistake_Details": "You thought sleeping together would make him commit or deepen the connection. It didn't.",
      "Mistake_Lesson": "Sex doesn't create commitment. Commitment creates sex within a committed relationship.",
      "Mistake_Tag": "Reality"
    },
    "Mistake347": {
      "Mistake_Title": "Not Leaving When He Stopped Laughing at Your Jokes",
      "Mistake_Details": "He used to laugh at your jokes and find you funny. He stopped finding you funny and started being critical.",
      "Mistake_Lesson": "When he stops enjoying who you are, the relationship is over.",
      "Mistake_Tag": "Signs"
    },
    "Mistake348": {
      "Mistake_Title": "Accepting His Excuse That He Was 'Stressed'",
      "Mistake_Details": "Whenever he was stressed, he was mean, distant, or angry. You accepted this as an excuse.",
      "Mistake_Lesson": "Stress is no excuse for poor treatment.",
      "Mistake_Tag": "Accountability"
    },
    "Mistake349": {
      "Mistake_Title": "Not Setting Boundaries Around His Family Involvement",
      "Mistake_Details": "His family was overly involved or he was overly involved with them. You didn't discuss healthy boundaries.",
      "Mistake_Lesson": "Discuss family boundaries before they become a problem.",
      "Mistake_Tag": "Boundaries"
    },
    "Mistake350": {
      "Mistake_Title": "Staying Until Your Self-Esteem Was Completely Shattered",
      "Mistake_Details": "You stayed until you believed you were worthless. It took years to rebuild who you were.",
      "Mistake_Lesson": "Leave before he destroys your sense of self.",
      "Mistake_Tag": "Self-Preservation"
    },
    "Mistake351": {
      "Mistake_Title": "Not Recognizing Love as a Choice, Not Just a Feeling",
      "Mistake_Details": "You thought love was automatic. You didn't realize that choosing to stay and invest is what matters.",
      "Mistake_Lesson": "Love is a feeling and a choice. Both matter.",
      "Mistake_Tag": "Love"
    },
    "Mistake352": {
      "Mistake_Title": "Accepting That He Had 'Commitment Phobia'",
      "Mistake_Details": "He said he had commitment phobia but wanted to be with you. His phobia kept you in limbo for years.",
      "Mistake_Lesson": "His commitment phobia is his responsibility to work on, not yours to tolerate.",
      "Mistake_Tag": "Boundaries"
    },
    "Mistake353": {
      "Mistake_Title": "Not Leaving When He Became Verbally Abusive",
      "Mistake_Details": "His words became harsh, cutting, and designed to hurt. You didn't recognize this as abuse.",
      "Mistake_Lesson": "Verbal abuse is abuse. Leave immediately.",
      "Mistake_Tag": "Abuse"
    },
    "Mistake354": {
      "Mistake_Title": "Believing That Counseling Would Fix Him",
      "Mistake_Details": "You suggested couples counseling, but he refused or didn't engage. You stayed hoping he'd eventually change.",
      "Mistake_Lesson": "Counseling helps only if both people want to improve.",
      "Mistake_Tag": "Reality"
    },
    "Mistake355": {
      "Mistake_Title": "Not Asking About His Financial Status Early",
      "Mistake_Details": "You never asked about his financial situation, debt, or financial health. You discovered problems too late.",
      "Mistake_Lesson": "Know his financial status before committing.",
      "Mistake_Tag": "Planning"
    },
    "Mistake356": {
      "Mistake_Title": "Staying Because You Didn't Want to Hurt His Feelings",
      "Mistake_Details": "You stayed in an unhappy relationship because you didn't want to hurt him. Your pain was less important.",
      "Mistake_Lesson": "Your feelings matter as much as his.",
      "Mistake_Tag": "Self-Worth"
    },
    "Mistake357": {
      "Mistake_Title": "Not Recognizing When He Started Making Decisions Without You",
      "Mistake_Details": "He made major decisions without consulting you — job changes, moves, commitments. You were excluded.",
      "Mistake_Lesson": "In a partnership, major decisions are made together.",
      "Mistake_Tag": "Partnership"
    },
    "Mistake358": {
      "Mistake_Title": "Accepting That He 'Wasn't Into Feelings'",
      "Mistake_Details": "He claimed he wasn't into expressing or discussing feelings. You accepted emotional distance.",
      "Mistake_Lesson": "Emotional intimacy is essential. If he won't do it, you're incompatible.",
      "Mistake_Tag": "Dealbreaker"
    },
    "Mistake359": {
      "Mistake_Title": "Not Leaving When You Felt Like You Needed His Permission",
      "Mistake_Details": "You started asking his permission for things — what to wear, where to go, who to see. He'd made you feel you needed approval.",
      "Mistake_Lesson": "You're an adult. You never need his permission for anything.",
      "Mistake_Tag": "Control"
    },
    "Mistake360": {
      "Mistake_Title": "Staying Until the Cost of Leaving Was Less Than the Cost of Staying",
      "Mistake_Details": "You finally left when being in the relationship was so painful that leaving became the lesser evil.",
      "Mistake_Lesson": "Don't wait until you're desperate to leave. Leave when you recognize the relationship is wrong.",
      "Mistake_Tag": "Wisdom"
    },
    "Mistake361": {
      "Mistake_Title": "Not Asking About His Expectations for Your Role",
      "Mistake_Details": "You never discussed what role he expected you to play. He expected traditional roles; you wanted partnership.",
      "Mistake_Lesson": "Know his expectations for your role early. Align or leave.",
      "Mistake_Tag": "Compatibility"
    },
    "Mistake362": {
      "Mistake_Title": "Believing That Your Presence Would Prevent Him From Straying",
      "Mistake_Details": "You thought if you were attentive enough, he wouldn't look elsewhere. But he strayed anyway.",
      "Mistake_Lesson": "You can't prevent infidelity. His character determines his choices.",
      "Mistake_Tag": "Reality"
    },
    "Mistake363": {
      "Mistake_Title": "Not Recognizing When He Started Keeping Secrets",
      "Mistake_Details": "He became secretive — guarding his phone, hiding messages, being vague about his whereabouts.",
      "Mistake_Lesson": "Secrecy is a red flag. Transparency is essential in relationships.",
      "Mistake_Tag": "Warning"
    },
    "Mistake364": {
      "Mistake_Title": "Staying Because You Believed Breaking Up Would Destroy Him",
      "Mistake_Details": "He said he'd hurt himself if you left, or that breaking up would ruin him. You stayed out of fear.",
      "Mistake_Lesson": "His wellbeing is not your responsibility. This is manipulation.",
      "Mistake_Tag": "Manipulation"
    },
    "Mistake365": {
      "Mistake_Title": "Not Asking About His Reaction to Being Told 'No'",
      "Mistake_Details": "You never saw how he reacted to being told no until it was too late. He reacted with anger or manipulation.",
      "Mistake_Lesson": "Notice how he reacts to boundaries. It reveals his character.",
      "Mistake_Tag": "Character"
    },
    "Mistake366": {
      "Mistake_Title": "Accepting His Excuse That His Past 'Made Him This Way'",
      "Mistake_Details": "His childhood trauma, his ex, his difficult upbringing — he used these as excuses for bad behavior.",
      "Mistake_Lesson": "Past pain explains behavior but doesn't excuse it.",
      "Mistake_Tag": "Accountability"
    },
    "Mistake367": {
      "Mistake_Title": "Not Recognizing Quiet Rage as Still Rage",
      "Mistake_Details": "He didn't yell or get loud, but he withdrew, became cold, and punished you silently. This is still abuse.",
      "Mistake_Lesson": "Silent anger is still rage. It's still harmful.",
      "Mistake_Tag": "Abuse"
    },
    "Mistake368": {
      "Mistake_Title": "Believing That Loyalty Would Earn His Commitment",
      "Mistake_Details": "You were loyal, devoted, and faithful. But he still didn't commit or appreciate your loyalty.",
      "Mistake_Lesson": "Your loyalty is valuable. Don't waste it on someone who doesn't value it.",
      "Mistake_Tag": "Self-Worth"
    },
    "Mistake369": {
      "Mistake_Title": "Not Leaving When He Stopped Defending You",
      "Mistake_Details": "When others criticized you or spoke badly about you, he didn't defend you. He agreed or stayed silent.",
      "Mistake_Lesson": "A partner defends you. If he doesn't, he doesn't respect you.",
      "Mistake_Tag": "Respect"
    },
    "Mistake370": {
      "Mistake_Title": "Staying Because the Breakup Would Be 'Too Complicated'",
      "Mistake_Details": "Breaking up seemed complicated — shared lease, shared friends, shared history. You stayed for convenience.",
      "Mistake_Lesson": "Complicated is temporary. Staying miserable is permanent.",
      "Mistake_Tag": "Courage"
    },
    "Mistake371": {
      "Mistake_Title": "Not Asking About His Biggest Fear in a Relationship",
      "Mistake_Details": "You never asked what scared him most in a relationship. Understanding fears could have revealed incompatibility.",
      "Mistake_Lesson": "Know his fears. They predict his behavior in relationships.",
      "Mistake_Tag": "Communication"
    },
    "Mistake372": {
      "Mistake_Title": "Accepting His Excuse That He Was 'Busy' All the Time",
      "Mistake_Details": "He was always busy — too busy for you, too busy to plan, too busy to be present.",
      "Mistake_Lesson": "If he's too busy for you now, he'll always be too busy.",
      "Mistake_Tag": "Reality"
    },
    "Mistake373": {
      "Mistake_Title": "Not Recognizing When He Started Criticizing Your Appearance",
      "Mistake_Details": "He made comments about your weight, your clothes, your hair. These comments were designed to control you.",
      "Mistake_Lesson": "Criticism of appearance is a form of control. Leave.",
      "Mistake_Tag": "Control"
    },
    "Mistake374": {
      "Mistake_Title": "Believing That Pregnancy Would Make Him Step Up",
      "Mistake_Details": "You thought if you got pregnant, he'd become a better man and commit. He didn't.",
      "Mistake_Lesson": "Pregnancy doesn't fix a broken man. It complicates things.",
      "Mistake_Tag": "Reality"
    },
    "Mistake375": {
      "Mistake_Title": "Not Setting Boundaries Around His Drinking Early",
      "Mistake_Details": "You noticed he drank heavily but didn't address it early. By then, it was a major addiction.",
      "Mistake_Lesson": "Address concerning behavior early. Don't ignore it.",
      "Mistake_Tag": "Boundaries"
    },
    "Mistake376": {
      "Mistake_Title": "Staying Because You Thought You Could Control the Outcome",
      "Mistake_Details": "You believed if you did everything right, the relationship would work out. You couldn't control it.",
      "Mistake_Lesson": "You can't control outcomes. Accept what you can't change.",
      "Mistake_Tag": "Reality"
    },
    "Mistake377": {
      "Mistake_Title": "Not Recognizing When He Started Testing Your Boundaries",
      "Mistake_Details": "He'd test small boundaries to see if you'd enforce them. When you didn't, he pushed further.",
      "Mistake_Lesson": "Enforce boundaries consistently. Don't let him test them.",
      "Mistake_Tag": "Boundaries"
    },
    "Mistake378": {
      "Mistake_Title": "Believing That His Promises of Change Meant Change Was Coming",
      "Mistake_Details": "He promised change repeatedly. You believed each promise. He never changed.",
      "Mistake_Lesson": "Promises of change are empty without action.",
      "Mistake_Tag": "Reality"
    },
    "Mistake379": {
      "Mistake_Title": "Not Asking About His Expectations for Sex",
      "Mistake_Details": "You never discussed sexual expectations, frequency, or preferences early on.",
      "Mistake_Lesson": "Discuss sexual expectations before they become a problem.",
      "Mistake_Tag": "Communication"
    },
    "Mistake380": {
      "Mistake_Title": "Staying Because You Felt Obligated to 'Fix' Him",
      "Mistake_Details": "He was broken, and you felt like it was your mission to fix him. But he didn't want fixing.",
      "Mistake_Lesson": "You can't fix anyone. He has to want to fix himself.",
      "Mistake_Tag": "Boundaries"
    },
    "Mistake381": {
      "Mistake_Title": "Not Recognizing When He Started Lying About Big Things",
      "Mistake_Details": "The lies escalated from small to big. You didn't notice the pattern because you wanted to believe him.",
      "Mistake_Lesson": "Notice patterns of dishonesty. They only escalate.",
      "Mistake_Tag": "Patterns"
    },
    "Mistake382": {
      "Mistake_Title": "Accepting That He Had 'Standards' for How You Should Look",
      "Mistake_Details": "He had requirements for your appearance — how thin you should be, how you should dress, how you should look.",
      "Mistake_Lesson": "Your appearance is your choice. His standards are his problem.",
      "Mistake_Tag": "Independence"
    },
    "Mistake383": {
      "Mistake_Title": "Not Leaving When He Stopped Putting in Any Effort",
      "Mistake_Details": "The effort he put in at the beginning completely stopped. You were carrying the entire relationship.",
      "Mistake_Lesson": "If he's not putting in effort, he's not invested.",
      "Mistake_Tag": "Reality"
    },
    "Mistake384": {
      "Mistake_Title": "Believing That Understanding His Trauma Would Help",
      "Mistake_Details": "You learned about his trauma, tried to understand it, and thought understanding would help. It didn't fix his behavior.",
      "Mistake_Lesson": "Understanding his trauma is compassionate, but it doesn't excuse his behavior.",
      "Mistake_Tag": "Boundaries"
    },
    "Mistake385": {
      "Mistake_Title": "Not Recognizing When He Started Dismissing Your Feelings",
      "Mistake_Details": "When you expressed feelings, he dismissed them as invalid, dramatic, or ridiculous.",
      "Mistake_Lesson": "A partner validates your feelings. If he dismisses them, he doesn't respect you.",
      "Mistake_Tag": "Respect"
    },
    "Mistake386": {
      "Mistake_Title": "Staying Because You Didn't Want to Admit You Made a Mistake",
      "Mistake_Details": "You chose him; admitting the relationship was wrong meant admitting you made a mistake.",
      "Mistake_Lesson": "Everyone makes mistakes. Leaving is how you fix this one.",
      "Mistake_Tag": "Pride"
    },
    "Mistake387": {
      "Mistake_Title": "Not Asking About His Relationship With Money Early",
      "Mistake_Details": "You never discussed how he earned, saved, or spent money. Financial incompatibility emerged later.",
      "Mistake_Lesson": "Financial values matter. Discuss them early.",
      "Mistake_Tag": "Planning"
    },
    "Mistake388": {
      "Mistake_Title": "Believing That Your Sacrifice Would Be Appreciated",
      "Mistake_Details": "You sacrificed your goals, your time, your needs. He never appreciated any of it.",
      "Mistake_Lesson": "Sacrifice without appreciation breeds resentment.",
      "Mistake_Tag": "Self-Worth"
    },
    "Mistake389": {
      "Mistake_Title": "Not Recognizing When He Started Excluding You From His Life",
      "Mistake_Details": "He had a whole life — friends, interests, activities — that didn't include you. You were never integrated.",
      "Mistake_Lesson": "A partner integrates you into their life. If you're excluded, you're not important.",
      "Mistake_Tag": "Integration"
    },
    "Mistake390": {
      "Mistake_Title": "Staying Because You Were Afraid of Being Alone With Your Thoughts",
      "Mistake_Details": "Being alone with yourself was scary, so you stayed in a bad relationship as distraction.",
      "Mistake_Lesson": "Being alone is an opportunity for growth, not something to fear.",
      "Mistake_Tag": "Self-Discovery"
    },
    "Mistake391": {
      "Mistake_Title": "Not Asking About His Views on Loyalty",
      "Mistake_Details": "You never discussed what loyalty meant to him or what he would and wouldn't tolerate.",
      "Mistake_Lesson": "Know his definition of loyalty. It reveals his values.",
      "Mistake_Tag": "Values"
    },
    "Mistake392": {
      "Mistake_Title": "Accepting That He Couldn't Apologize Properly",
      "Mistake_Details": "His apologies were shallow — 'sorry you feel that way' instead of 'sorry I hurt you.'",
      "Mistake_Lesson": "Real apologies take responsibility. Anything less isn't an apology.",
      "Mistake_Tag": "Accountability"
    },
    "Mistake393": {
      "Mistake_Title": "Not Leaving When He Started Talking Negatively About Women",
      "Mistake_Details": "He made derogatory comments about women, called them names, or expressed misogynistic views.",
      "Mistake_Lesson": "His views of women predict how he'll treat you.",
      "Mistake_Tag": "Character"
    },
    "Mistake394": {
      "Mistake_Title": "Believing That Marriage Would Finally Give You Security",
      "Mistake_Details": "You thought marriage would make him secure and committed. It just complicated the break up.",
      "Mistake_Lesson": "Marriage doesn't create security. Trust and consistency do.",
      "Mistake_Tag": "Reality"
    },
    "Mistake395": {
      "Mistake_Title": "Not Recognizing When He Started Making You Feel Crazy",
      "Mistake_Details": "His inconsistencies, lies, and manipulations made you question your reality.",
      "Mistake_Lesson": "If he consistently makes you feel crazy, he's gaslighting you.",
      "Mistake_Tag": "Abuse"
    },
    "Mistake396": {
      "Mistake_Title": "Staying Because Everyone Else Thought You Were Perfect Together",
      "Mistake_Details": "Everyone thought you were the perfect couple. You couldn't leave because it would disappoint them.",
      "Mistake_Lesson": "Your happiness is more important than perception.",
      "Mistake_Tag": "Independence"
    },
    "Mistake397": {
      "Mistake_Title": "Not Asking About His Relationship With Accountability",
      "Mistake_Details": "You never saw him take real accountability for mistakes. He always had excuses.",
      "Mistake_Lesson": "Notice if he takes accountability. If he doesn't, he won't change.",
      "Mistake_Tag": "Character"
    },
    "Mistake398": {
      "Mistake_Title": "Believing That Your Unconditional Love Would Change Him",
      "Mistake_Details": "You gave unconditional love, thinking it would transform him. It just enabled his behavior.",
      "Mistake_Lesson": "Unconditional love for a flawed person enables them to keep being flawed.",
      "Mistake_Tag": "Reality"
    },
    "Mistake399": {
      "Mistake_Title": "Not Leaving When You Realized You Were Happier Without Him",
      "Mistake_Details": "You noticed you felt better, lighter, happier when he wasn't around. But you still stayed.",
      "Mistake_Lesson": "Happiness without him is a sign you should leave.",
      "Mistake_Tag": "Signs"
    },
    "Mistake400": {
      "Mistake_Title": "Staying Until You Forgave Yourself for Staying So Long",
      "Mistake_Details": "You finally left, but it took years to forgive yourself for wasting time on him.",
      "Mistake_Lesson": "Learn from the relationship. Forgive yourself for staying, and don't repeat it.",
      "Mistake_Tag": "Self-Compassion"
    },
"Mistake401": {
      "Mistake_Title": "Not Discussing His Relationship With Vulnerability",
      "Mistake_Details": "He couldn't be vulnerable with you. He kept everything bottled up and expected you to guess his feelings.",
      "Mistake_Lesson": "Vulnerability is essential for intimacy. If he won't be vulnerable, you can't truly connect.",
      "Mistake_Tag": "Intimacy"
    },
    "Mistake402": {
      "Mistake_Title": "Accepting That His Family Was 'Toxic' Excuse for Behavior",
      "Mistake_Details": "He had a toxic family and used that to excuse his own toxic behavior toward you.",
      "Mistake_Lesson": "Family trauma explains but doesn't excuse poor treatment of you.",
      "Mistake_Tag": "Accountability"
    },
    "Mistake403": {
      "Mistake_Title": "Not Recognizing When He Started Keeping Score",
      "Mistake_Details": "He remembered every favor, every sacrifice, and used them as leverage in arguments.",
      "Mistake_Lesson": "Healthy relationships don't keep score.",
      "Mistake_Tag": "Generosity"
    },
    "Mistake404": {
      "Mistake_Title": "Believing That Shared Struggles Would Bond You",
      "Mistake_Details": "You thought difficult times would bring you closer. Instead, they revealed his true character.",
      "Mistake_Lesson": "Hard times reveal character. If his character is flawed, hard times divide you.",
      "Mistake_Tag": "Reality"
    },
    "Mistake405": {
      "Mistake_Title": "Not Asking About His Attitude Toward Authority",
      "Mistake_Details": "He had issues with authority figures — bosses, parents, police. This predicted issues with boundaries.",
      "Mistake_Lesson": "His relationship with authority reveals his character.",
      "Mistake_Tag": "Character"
    },
    "Mistake406": {
      "Mistake_Title": "Staying Because You Thought Time Would Heal Things",
      "Mistake_Details": "You believed 'time heals all wounds,' so staying longer would fix relationship problems.",
      "Mistake_Lesson": "Time alone doesn't heal anything. Action and effort do.",
      "Mistake_Tag": "Reality"
    },
    "Mistake407": {
      "Mistake_Title": "Not Recognizing When He Started Making You Feel Guilty",
      "Mistake_Details": "He made you feel guilty for having needs, for leaving, for doing anything that wasn't about him.",
      "Mistake_Lesson": "Guilt is a manipulation tool. Don't let him weaponize it.",
      "Mistake_Tag": "Manipulation"
    },
    "Mistake408": {
      "Mistake_Title": "Accepting His Excuse That He 'Didn't Know' How to Handle Something",
      "Mistake_Details": "He handled something poorly and claimed he 'didn't know how' to handle it correctly.",
      "Mistake_Lesson": "Not knowing how is an excuse. He could have asked or learned.",
      "Mistake_Tag": "Accountability"
    },
    "Mistake409": {
      "Mistake_Title": "Not Leaving When He Started Treating Your Illness as Inconvenience",
      "Mistake_Details": "When you were sick, he resented caring for you or being affected by your illness.",
      "Mistake_Lesson": "A partner supports you in sickness. If he resents it, that's telling.",
      "Mistake_Tag": "Support"
    },
    "Mistake410": {
      "Mistake_Title": "Believing That Moving In Together Would Deepen the Connection",
      "Mistake_Details": "You thought living together would bring you closer. It just intensified existing problems.",
      "Mistake_Lesson": "Living together reveals incompatibility. It doesn't create compatibility.",
      "Mistake_Tag": "Reality"
    },
    "Mistake411": {
      "Mistake_Title": "Not Asking About His Stance on Parenting Styles Early",
      "Mistake_Details": "You never discussed parenting philosophies. He had completely different ideas about raising children.",
      "Mistake_Lesson": "Parenting values are crucial. Discuss them before commitment.",
      "Mistake_Tag": "Planning"
    },
    "Mistake412": {
      "Mistake_Title": "Accepting His Excuse That He Forgot to Tell You Something Important",
      "Mistake_Details": "He forgot to mention something significant — past relationships, children, legal issues. The 'forgetting' was intentional.",
      "Mistake_Lesson": "Convenient forgetting is dishonesty.",
      "Mistake_Tag": "Trust"
    },
    "Mistake413": {
      "Mistake_Title": "Not Recognizing When He Started Making You Feel Responsible for His Happiness",
      "Mistake_Details": "He made it clear that your job was to keep him happy. Your happiness was secondary.",
      "Mistake_Lesson": "You're not responsible for his happiness. He is.",
      "Mistake_Tag": "Boundaries"
    },
    "Mistake414": {
      "Mistake_Title": "Staying Because You Didn't Want to Be Right",
      "Mistake_Details": "You knew the relationship was wrong, but you stayed because being right meant being alone.",
      "Mistake_Lesson": "Being right is better than being miserable.",
      "Mistake_Tag": "Wisdom"
    },
    "Mistake415": {
      "Mistake_Title": "Not Asking About His Spending Habits Early",
      "Mistake_Details": "He had poor spending habits and debt you didn't know about. Financial stress ruined the relationship.",
      "Mistake_Lesson": "Know his financial habits. They affect your future.",
      "Mistake_Tag": "Planning"
    },
    "Mistake416": {
      "Mistake_Title": "Believing That His Children Would Make Him More Responsible",
      "Mistake_Details": "He had children from a previous relationship but was irresponsible with them. You thought more responsibility would change him.",
      "Mistake_Lesson": "If he's irresponsible with his existing children, he won't change.",
      "Mistake_Tag": "Character"
    },
    "Mistake417": {
      "Mistake_Title": "Not Leaving When He Started Punishing You With Silence",
      "Mistake_Details": "When he was upset, he wouldn't talk to you for days. This silent treatment was psychological punishment.",
      "Mistake_Lesson": "Silent treatment is a form of abuse. Leave.",
      "Mistake_Tag": "Abuse"
    },
    "Mistake418": {
      "Mistake_Title": "Accepting That He Had 'Bad Days' That Meant He Could Treat You Badly",
      "Mistake_Details": "His bad moods gave him permission to be mean to you. You accepted this as inevitable.",
      "Mistake_Lesson": "Bad moods don't excuse bad behavior.",
      "Mistake_Tag": "Accountability"
    },
    "Mistake419": {
      "Mistake_Title": "Not Asking About His Relationship With Honesty in General",
      "Mistake_Details": "You never asked how he felt about lying. He turned out to be comfortable with dishonesty.",
      "Mistake_Lesson": "Know his relationship with honesty. It predicts his behavior.",
      "Mistake_Tag": "Values"
    },
    "Mistake420": {
      "Mistake_Title": "Staying Despite Knowing His Family Didn't Accept You",
      "Mistake_Details": "His family made it clear they didn't like you or approve of you. He didn't defend you.",
      "Mistake_Lesson": "If his family rejects you and he doesn't defend you, reconsider the relationship.",
      "Mistake_Tag": "Family"
    },
    "Mistake421": {
      "Mistake_Title": "Not Recognizing When He Started Viewing Your Accomplishments as Threats",
      "Mistake_Details": "You succeeded at something, and he became competitive or jealous instead of supportive.",
      "Mistake_Lesson": "A secure man celebrates your wins. An insecure man competes.",
      "Mistake_Tag": "Support"
    },
    "Mistake422": {
      "Mistake_Title": "Believing That His Apology Meant He Wouldn't Repeat the Behavior",
      "Mistake_Details": "He apologized but then repeated the exact same behavior. His apologies meant nothing.",
      "Mistake_Lesson": "Real apology comes with changed behavior.",
      "Mistake_Tag": "Patterns"
    },
    "Mistake423": {
      "Mistake_Title": "Not Leaving When You Realized You Deserved Better",
      "Mistake_Details": "Deep down, you knew you deserved better. You just didn't believe it enough to leave.",
      "Mistake_Lesson": "You do deserve better. Believe it and act on it.",
      "Mistake_Tag": "Self-Worth"
    },
    "Mistake424": {
      "Mistake_Title": "Accepting His Narrative That You Were Overreacting",
      "Mistake_Details": "When you reacted to his poor behavior, he called you dramatic or overreacting. You internalized this.",
      "Mistake_Lesson": "Your reactions are valid. Don't let him minimize them.",
      "Mistake_Tag": "Gaslighting"
    },
    "Mistake425": {
      "Mistake_Title": "Not Asking About His Longest Relationship and Why It Ended",
      "Mistake_Details": "You never asked about his longest relationship or what went wrong. His explanations were lies.",
      "Mistake_Lesson": "His past relationships reveal patterns.",
      "Mistake_Tag": "History"
    },
    "Mistake426": {
      "Mistake_Title": "Staying Because You Feared the Unknown",
      "Mistake_Details": "Leaving meant starting over, uncertainty, and the unknown. Staying was familiar, even if miserable.",
      "Mistake_Lesson": "The unknown is opportunity, not danger.",
      "Mistake_Tag": "Courage"
    },
    "Mistake427": {
      "Mistake_Title": "Not Recognizing When His 'Jokes' Became Permanent Criticism",
      "Mistake_Details": "He started with jokes at your expense. Over time, the jokes turned into constant criticism.",
      "Mistake_Lesson": "Jokes that hurt aren't jokes. They're disguised cruelty.",
      "Mistake_Tag": "Patterns"
    },
    "Mistake428": {
      "Mistake_Title": "Accepting That He Had 'Different Love Language'",
      "Mistake_Details": "He never showed affection, never said kind words, never acted loving. But his 'love language' was apparently actions only.",
      "Mistake_Lesson": "If he's not showing love in any language, he's not showing love.",
      "Mistake_Tag": "Reality"
    },
    "Mistake429": {
      "Mistake_Title": "Not Leaving When Your Intuition Screamed He Was Cheating",
      "Mistake_Details": "You had strong intuition that he was cheating. He denied it, and you believed him against your gut.",
      "Mistake_Lesson": "Intuition is often right. Trust it.",
      "Mistake_Tag": "Intuition"
    },
    "Mistake430": {
      "Mistake_Title": "Staying Because You Thought Love Conquered All",
      "Mistake_Details": "You believed love would overcome incompatibility, differing values, and poor treatment.",
      "Mistake_Lesson": "Love is necessary but not sufficient.",
      "Mistake_Tag": "Reality"
    },
    "Mistake431": {
      "Mistake_Title": "Not Asking About His Previous Relationship Violence",
      "Mistake_Details": "You never asked if he'd been violent in past relationships. Later, you discovered he had been.",
      "Mistake_Lesson": "Ask about past violence. It predicts future violence.",
      "Mistake_Tag": "Safety"
    },
    "Mistake432": {
      "Mistake_Title": "Accepting His Excuse That He Was 'Going Through a Phase'",
      "Mistake_Details": "His bad behavior was temporary, he said. It wasn't a phase. It was who he was.",
      "Mistake_Lesson": "Behavior that lasts months isn't a phase.",
      "Mistake_Tag": "Reality"
    },
    "Mistake433": {
      "Mistake_Title": "Not Recognizing His Excessive Need for Control as a Red Flag",
      "Mistake_Details": "He controlled where you went, who you saw, what you wore. You didn't recognize this as abuse.",
      "Mistake_Lesson": "Control is abuse. Leave immediately.",
      "Mistake_Tag": "Abuse"
    },
    "Mistake434": {
      "Mistake_Title": "Believing That His Financial Dependence on You Meant He'd Stay",
      "Mistake_Details": "He relied on you financially, so you thought he'd never leave. He left anyway.",
      "Mistake_Lesson": "Financial dependence doesn't create loyalty.",
      "Mistake_Tag": "Reality"
    },
    "Mistake435": {
      "Mistake_Title": "Not Leaving When He Started Dismissing Your Career",
      "Mistake_Details": "He made comments about your job being less important than his. He didn't support your career growth.",
      "Mistake_Lesson": "A partner supports your career, not competes with it.",
      "Mistake_Tag": "Support"
    },
    "Mistake436": {
      "Mistake_Title": "Accepting His Claim That He Was 'Just Being Honest' When He Was Being Cruel",
      "Mistake_Details": "He made hurtful comments and claimed he was 'just being honest.' Honesty doesn't require cruelty.",
      "Mistake_Lesson": "Truth can be delivered kindly. If it's cruel, it's not just honesty.",
      "Mistake_Tag": "Respect"
    },
    "Mistake437": {
      "Mistake_Title": "Not Asking About His Relationship With Anger Management",
      "Mistake_Details": "You never asked how he handled anger. He had serious anger management issues.",
      "Mistake_Lesson": "Know how he handles anger. Uncontrolled anger is dangerous.",
      "Mistake_Tag": "Safety"
    },
    "Mistake438": {
      "Mistake_Title": "Staying Because You Were Invested in the 'Idea' of the Relationship",
      "Mistake_Details": "You loved the idea of being in a relationship more than you loved him or the actual relationship.",
      "Mistake_Lesson": "Be in love with the real person and real relationship, not the idea.",
      "Mistake_Tag": "Reality"
    },
    "Mistake439": {
      "Mistake_Title": "Not Recognizing When Your Health Started Deteriorating",
      "Mistake_Details": "You developed anxiety, insomnia, or physical ailments from the stress of the relationship.",
      "Mistake_Lesson": "Your health is more important than any relationship.",
      "Mistake_Tag": "Health"
    },
    "Mistake440": {
      "Mistake_Title": "Accepting That He 'Needed Time' But Never Gave You Commitment",
      "Mistake_Details": "He said he needed time to figure things out. Years passed with no progress toward commitment.",
      "Mistake_Lesson": "Time should bring clarity. If it doesn't, you have your answer.",
      "Mistake_Tag": "Reality"
    },
    "Mistake441": {
      "Mistake_Title": "Not Leaving When Your Core Values Conflicted",
      "Mistake_Details": "Your core values — about money, religion, family, life goals — were incompatible.",
      "Mistake_Lesson": "Core value incompatibility is a dealbreaker.",
      "Mistake_Tag": "Dealbreaker"
    },
    "Mistake442": {
      "Mistake_Title": "Believing That His Promises to 'Do Better' Meant Change",
      "Mistake_Details": "He promised to do better repeatedly. He never actually changed anything.",
      "Mistake_Lesson": "Promises without action are just words.",
      "Mistake_Tag": "Reality"
    },
    "Mistake443": {
      "Mistake_Title": "Not Asking About His Views on Infidelity",
      "Mistake_Details": "You never discussed what infidelity meant to him or how he'd handle temptation.",
      "Mistake_Lesson": "Know his views on fidelity. They predict his behavior.",
      "Mistake_Tag": "Values"
    },
    "Mistake444": {
      "Mistake_Title": "Staying Because You Felt Responsible for Fixing the Relationship",
      "Mistake_Details": "You took responsibility for the relationship's problems. You tried to fix what wasn't yours to fix.",
      "Mistake_Lesson": "Both people have to want to fix a relationship. You can't do it alone.",
      "Mistake_Tag": "Responsibility"
    },
    "Mistake445": {
      "Mistake_Title": "Not Recognizing His Narcissism Until It Was Too Late",
      "Mistake_Details": "He showed signs of narcissism — lack of empathy, need for admiration, lack of accountability.",
      "Mistake_Lesson": "Narcissistic traits don't improve. If you see them, leave.",
      "Mistake_Tag": "Character"
    },
    "Mistake446": {
      "Mistake_Title": "Accepting His Excuse That He 'Came From Money' So He Had No Responsibility",
      "Mistake_Details": "He came from wealth and felt entitled. His family money made him irresponsible.",
      "Mistake_Lesson": "Entitlement is character flaw, not excusable.",
      "Mistake_Tag": "Character"
    },
    "Mistake447": {
      "Mistake_Title": "Not Leaving When He Started Comparing You Unfavorably to His Exes",
      "Mistake_Details": "He talked about his exes positively and compared you unfavorably. You felt constantly inadequate.",
      "Mistake_Lesson": "A man who praises his exes should be an ex.",
      "Mistake_Tag": "Respect"
    },
    "Mistake448": {
      "Mistake_Title": "Believing That Staying Would Eventually Result in the Commitment You Wanted",
      "Mistake_Details": "You thought if you stayed long enough, he'd eventually commit. He never did.",
      "Mistake_Lesson": "Staying longer doesn't create commitment. He either wants it or doesn't.",
      "Mistake_Tag": "Reality"
    },
    "Mistake449": {
      "Mistake_Title": "Not Asking About His Relationship With Personal Growth",
      "Mistake_Details": "He wasn't interested in growth or self-improvement. He was stagnant.",
      "Mistake_Lesson": "A partner who doesn't grow can't help you grow.",
      "Mistake_Tag": "Compatibility"
    },
    "Mistake450": {
      "Mistake_Title": "Staying Until You Didn't Recognize Yourself Anymore",
      "Mistake_Details": "By the end, you'd changed so much trying to please him that you didn't know who you were.",
      "Mistake_Lesson": "Leave before you lose yourself completely.",
      "Mistake_Tag": "Identity"
    },
    "Mistake451": {
      "Mistake_Title": "Not Recognizing When He Started Rewriting History",
      "Mistake_Details": "He would recount events differently than how they happened. You couldn't trust your memory.",
      "Mistake_Lesson": "History rewriting is gaslighting. Don't tolerate it.",
      "Mistake_Tag": "Gaslighting"
    },
    "Mistake452": {
      "Mistake_Title": "Accepting His Excuse That He Was 'Too Tired' to Show Affection",
      "Mistake_Details": "He was always too tired for intimacy, affection, or attention. Conveniently, he had energy for other things.",
      "Mistake_Lesson": "If he's too tired for you but has energy for others, you're not a priority.",
      "Mistake_Tag": "Reality"
    },
    "Mistake453": {
      "Mistake_Title": "Not Leaving When You Realized He Brought Out Your Worst Self",
      "Mistake_Details": "He made you jealous, insecure, anxious, and angry. You became someone you didn't like.",
      "Mistake_Lesson": "A good partner brings out your best self. If he brings out your worst, leave.",
      "Mistake_Tag": "Self-Discovery"
    },
    "Mistake454": {
      "Mistake_Title": "Believing That Forgiving His Cheating Would Make Things Better",
      "Mistake_Details": "He cheated, you forgave him, but the trust was shattered. Things never recovered.",
      "Mistake_Lesson": "Forgiveness doesn't restore broken trust.",
      "Mistake_Tag": "Reality"
    },
    "Mistake455": {
      "Mistake_Title": "Not Asking About His Expectations for Your Appearance Maintenance",
      "Mistake_Details": "He expected you to maintain certain appearance standards. He judged you if you didn't.",
      "Mistake_Lesson": "Your appearance is your choice. His standards are controlling.",
      "Mistake_Tag": "Control"
    },
    "Mistake456": {
      "Mistake_Title": "Staying Because Everyone Expected You To",
      "Mistake_Details": "Your friends thought he was great, your family approved. You stayed despite being unhappy.",
      "Mistake_Lesson": "Your happiness is your responsibility, not their approval.",
      "Mistake_Tag": "Independence"
    },
    "Mistake457": {
      "Mistake_Title": "Not Recognizing When He Started Talking to You Like You Were a Child",
      "Mistake_Details": "He condescended to you, explained things slowly like you were stupid, belittled your intelligence.",
      "Mistake_Lesson": "Condescension is disrespect. Don't tolerate it.",
      "Mistake_Tag": "Respect"
    },
    "Mistake458": {
      "Mistake_Title": "Accepting His Excuse That He Was 'Just Joking' When He Was Being Hurtful",
      "Mistake_Details": "His jokes consistently hurt you. He claimed they were harmless jokes when you expressed hurt.",
      "Mistake_Lesson": "If it hurts you, it's not a joke.",
      "Mistake_Tag": "Kindness"
    },
    "Mistake459": {
      "Mistake_Title": "Not Leaving When You Realized You'd Rather Be Alone",
      "Mistake_Details": "You genuinely preferred being alone to being with him. But you stayed anyway.",
      "Mistake_Lesson": "Preferring alone time to his company is a sign to leave.",
      "Mistake_Tag": "Signs"
    },
    "Mistake460": {
      "Mistake_Title": "Staying Until You Finally Loved Yourself Enough to Leave",
      "Mistake_Details": "You finally left when you realized you deserved better. It took years to get there.",
      "Mistake_Lesson": "Self-love is your superpower. Cultivate it and use it to leave bad situations.",
      "Mistake_Tag": "Self-Love"
    },

    "Mistake461": {
      "Mistake_Title": "Not Asking About His Relationship With Jealousy",
      "Mistake_Details": "You never discussed whether he experienced jealousy or how he handled it. He turned out to be excessively jealous.",
      "Mistake_Lesson": "Jealousy that's out of control is possessiveness, not love.",
      "Mistake_Tag": "Character"
    },
    "Mistake462": {
      "Mistake_Title": "Accepting His Excuses for Not Planning Anything",
      "Mistake_Details": "He never planned dates, trips, or special moments. Everything was spontaneous or you organized it.",
      "Mistake_Lesson": "Effort in planning shows he cares enough to think about you.",
      "Mistake_Tag": "Effort"
    },
    "Mistake463": {
      "Mistake_Title": "Not Recognizing When He Started Isolating You",
      "Mistake_Details": "Over time, you saw your friends less, saw family less. He made subtle criticisms that kept you away.",
      "Mistake_Lesson": "Isolation is a tactic of control and abuse. Notice it early.",
      "Mistake_Tag": "Abuse"
    },
    "Mistake464": {
      "Mistake_Title": "Staying Because You Thought Breaking Up Would Hurt Him",
      "Mistake_Details": "You stayed because you thought he'd be devastated. His feelings mattered more than your happiness.",
      "Mistake_Lesson": "His feelings are his responsibility, not yours.",
      "Mistake_Tag": "Boundaries"
    },
    "Mistake465": {
      "Mistake_Title": "Not Asking About His Experience With Rejection",
      "Mistake_Details": "You never discussed how he handled rejection. When you set boundaries, he reacted with anger or manipulation.",
      "Mistake_Lesson": "How he handles 'no' reveals his character.",
      "Mistake_Tag": "Character"
    },
    "Mistake466": {
      "Mistake_Title": "Believing That His Attention Meant He Cared",
      "Mistake_Details": "He was attentive early on. But attention without respect, honesty, or genuine care means nothing.",
      "Mistake_Lesson": "Attention can be performative. Look for consistency.",
      "Mistake_Tag": "Reality"
    },
    "Mistake467": {
      "Mistake_Title": "Not Leaving When He Started Referring to You as 'Needy'",
      "Mistake_Details": "Your basic needs for attention, affection, and communication were labeled 'needy' by him.",
      "Mistake_Lesson": "Having needs is human, not needy. Don't accept this label.",
      "Mistake_Tag": "Gaslighting"
    },
    "Mistake468": {
      "Mistake_Title": "Accepting That His Career Was More Important Than the Relationship",
      "Mistake_Details": "He prioritized his career over spending time with you, planning together, or building a future.",
      "Mistake_Lesson": "A partner should balance career with relationship.",
      "Mistake_Tag": "Priorities"
    },
    "Mistake469": {
      "Mistake_Title": "Not Asking About His Relationship With His Father",
      "Mistake_Details": "His father was absent or abusive. This affected how he related to women and commitment.",
      "Mistake_Lesson": "His relationship with his father often predicts his behavior in relationships.",
      "Mistake_Tag": "Family"
    },
    "Mistake470": {
      "Mistake_Title": "Staying Because You Wanted to Prove Everyone Wrong",
      "Mistake_Details": "People said he wasn't right for you. You stayed to prove them wrong.",
      "Mistake_Lesson": "Don't stay in a bad relationship to prove people wrong.",
      "Mistake_Tag": "Pride"
    },
    "Mistake471": {
      "Mistake_Title": "Not Recognizing When He Started Competing With Your Friends",
      "Mistake_Details": "He made you choose between him and your friends. He didn't like you having other close relationships.",
      "Mistake_Lesson": "A secure partner doesn't compete with your friendships.",
      "Mistake_Tag": "Insecurity"
    },
    "Mistake472": {
      "Mistake_Title": "Accepting His Excuse That He 'Forgot' to Tell You About Exes",
      "Mistake_Details": "He 'forgot' to mention he had kids, or was engaged, or had serious relationships.",
      "Mistake_Lesson": "Convenient forgetting is dishonesty.",
      "Mistake_Tag": "Trust"
    },
    "Mistake473": {
      "Mistake_Title": "Not Leaving When Your Therapist Suggested It",
      "Mistake_Details": "Your therapist advised you to leave. You ignored professional guidance.",
      "Mistake_Lesson": "Listen to your therapist. They see patterns you miss.",
      "Mistake_Tag": "Wisdom"
    },
    "Mistake474": {
      "Mistake_Title": "Believing That Time Spent Together Would Create Love",
      "Mistake_Details": "You thought if you spent enough time with him, love would grow. It didn't.",
      "Mistake_Lesson": "Time alone doesn't create love. Compatibility and mutual effort do.",
      "Mistake_Tag": "Reality"
    },
    "Mistake475": {
      "Mistake_Title": "Not Asking About His Expectations for Financial Transparency",
      "Mistake_Details": "You never discussed if finances should be transparent. He hid spending and income.",
      "Mistake_Lesson": "Financial transparency is essential in committed relationships.",
      "Mistake_Tag": "Communication"
    },
    "Mistake476": {
      "Mistake_Title": "Accepting His Excuse That He Was 'Too Young' to Commit",
      "Mistake_Details": "He used age as an excuse for not committing, even though you were the same age.",
      "Mistake_Lesson": "Age is an excuse. Willingness is the real issue.",
      "Mistake_Tag": "Reality"
    },
    "Mistake477": {
      "Mistake_Title": "Not Recognizing When He Started Belittling Your Dreams",
      "Mistake_Details": "Your goals and dreams were mocked or dismissed. He made you feel stupid for having ambitions.",
      "Mistake_Lesson": "A partner lifts up your dreams, not tears them down.",
      "Mistake_Tag": "Support"
    },
    "Mistake478": {
      "Mistake_Title": "Staying Because You Believed in 'Soulmates'",
      "Mistake_Details": "You believed he was your soulmate, so you endured mistreatment thinking it was meant to be.",
      "Mistake_Lesson": "Soulmates don't exist. Compatibility and effort do.",
      "Mistake_Tag": "Reality"
    },
    "Mistake479": {
      "Mistake_Title": "Not Asking About His Experience With Breakups",
      "Mistake_Details": "You never discussed how he'd handled previous breakups. He handled the final breakup poorly.",
      "Mistake_Lesson": "How he's handled breakups predicts how he'll handle yours.",
      "Mistake_Tag": "History"
    },
    "Mistake480": {
      "Mistake_Title": "Accepting His Narrative That You Were 'Too Demanding'",
      "Mistake_Details": "You had basic relationship needs. He labeled them as demanding to avoid meeting them.",
      "Mistake_Lesson": "Having standards and needs isn't demanding. It's healthy.",
      "Mistake_Tag": "Self-Worth"
    },
    "Mistake481": {
      "Mistake_Title": "Not Leaving When You Started Feeling Guilty Just Existing",
      "Mistake_Details": "Your presence, your needs, your existence became something you felt guilty about.",
      "Mistake_Lesson": "You shouldn't feel guilty for existing. That's abuse.",
      "Mistake_Tag": "Abuse"
    },
    "Mistake482": {
      "Mistake_Title": "Believing That His Potential for Growth Was Enough",
      "Mistake_Details": "He had potential to become better, kinder, more committed. Potential isn't reality.",
      "Mistake_Lesson": "Potential is not a substitute for actual behavior.",
      "Mistake_Tag": "Reality"
    },
    "Mistake483": {
      "Mistake_Title": "Not Asking About His Relationship With Competition",
      "Mistake_Details": "Everything was a competition to him — your success, your friendships, your attention.",
      "Mistake_Lesson": "A healthy man celebrates your wins, not competes.",
      "Mistake_Tag": "Character"
    },
    "Mistake484": {
      "Mistake_Title": "Accepting His Excuse That He Was 'Bad at Relationships'",
      "Mistake_Details": "He claimed he was just bad at relationships, using it as justification for poor behavior.",
      "Mistake_Lesson": "Being bad at something is an excuse to learn, not to continue being bad.",
      "Mistake_Tag": "Accountability"
    },
    "Mistake485": {
      "Mistake_Title": "Not Recognizing When He Started Invalidating Your Emotions",
      "Mistake_Details": "Your feelings were constantly dismissed as invalid, irrational, or emotional.",
      "Mistake_Lesson": "Your emotions are valid. Don't let anyone tell you otherwise.",
      "Mistake_Tag": "Validation"
    },
    "Mistake486": {
      "Mistake_Title": "Staying Because You Didn't Want to Disappoint His Family",
      "Mistake_Details": "His family liked you, so you stayed even though you were unhappy. Their feelings mattered more.",
      "Mistake_Lesson": "Your happiness matters more than not disappointing others.",
      "Mistake_Tag": "Independence"
    },
    "Mistake487": {
      "Mistake_Title": "Not Asking About His Relationship With Vulnerability",
      "Mistake_Details": "He couldn't be vulnerable with you, couldn't cry, couldn't admit fear. Emotional walls were high.",
      "Mistake_Lesson": "Vulnerability is essential for emotional intimacy.",
      "Mistake_Tag": "Intimacy"
    },
    "Mistake488": {
      "Mistake_Title": "Accepting That He 'Didn't Mean to' Hurt You",
      "Mistake_Details": "He repeated hurtful behaviors and used 'I didn't mean to' as an excuse.",
      "Mistake_Lesson": "Intention matters less than impact. He could change his behavior.",
      "Mistake_Tag": "Accountability"
    },
    "Mistake489": {
      "Mistake_Title": "Not Leaving When You Realized You Were Afraid of Him",
      "Mistake_Details": "You became afraid of his reactions, his anger, his moods. Fear became normal.",
      "Mistake_Lesson": "If you're afraid of your partner, that's abuse. Leave.",
      "Mistake_Tag": "Safety"
    },
    "Mistake490": {
      "Mistake_Title": "Believing That Fixing Yourself Would Fix the Relationship",
      "Mistake_Details": "You thought if you were less sensitive, less needy, less emotional, he'd be happier.",
      "Mistake_Lesson": "You don't need fixing. The relationship needs fixing.",
      "Mistake_Tag": "Self-Worth"
    },
    "Mistake491": {
      "Mistake_Title": "Not Asking About His Relationship With Respect",
      "Mistake_Details": "You never discussed what respect looked like to him. He didn't respect your boundaries.",
      "Mistake_Lesson": "Know what respect means to him. It predicts his behavior.",
      "Mistake_Tag": "Values"
    },
    "Mistake492": {
      "Mistake_Title": "Accepting His Excuse That He Was 'Going Through Stuff'",
      "Mistake_Details": "He was going through tough times, so you accepted poor treatment as temporary.",
      "Mistake_Lesson": "Going through tough times doesn't excuse ongoing poor treatment.",
      "Mistake_Tag": "Accountability"
    },
    "Mistake493": {
      "Mistake_Title": "Not Recognizing When He Started Erasing You From His Life",
      "Mistake_Details": "He removed pictures of you, stopped mentioning you, acted like you didn't exist.",
      "Mistake_Lesson": "If he's erasing you, he's mentally checked out.",
      "Mistake_Tag": "Signs"
    },
    "Mistake494": {
      "Mistake_Title": "Staying Because You Thought You Could Handle the Pain",
      "Mistake_Details": "You convinced yourself you were strong enough to bear his mistreatment.",
      "Mistake_Lesson": "Strength is knowing when to leave, not bearing pain.",
      "Mistake_Tag": "Wisdom"
    },
    "Mistake495": {
      "Mistake_Title": "Not Asking About His Relationship With Boundaries",
      "Mistake_Details": "He didn't respect his own boundaries or yours. He was okay with crossing lines.",
      "Mistake_Lesson": "Respect for boundaries indicates respect for people.",
      "Mistake_Tag": "Character"
    },
    "Mistake496": {
      "Mistake_Title": "Accepting That He 'Forgot' Important Information About Himself",
      "Mistake_Details": "He 'forgot' to mention significant aspects of his life — criminal history, addiction, mental illness.",
      "Mistake_Lesson": "Convenient forgetting is dishonesty masquerading as forgetfulness.",
      "Mistake_Tag": "Trust"
    },
    "Mistake497": {
      "Mistake_Title": "Not Leaving When You Realized Life Was Better Without Him",
      "Mistake_Details": "You genuinely felt happier, freer, lighter when he wasn't around. Yet you stayed.",
      "Mistake_Lesson": "Happiness without him is a clear sign to leave.",
      "Mistake_Tag": "Signs"
    },
    "Mistake498": {
      "Mistake_Title": "Believing That Love Was Enough",
      "Mistake_Details": "You loved him deeply, and thought that would be enough to make it work. It wasn't.",
      "Mistake_Lesson": "Love is necessary but not sufficient for a healthy relationship.",
      "Mistake_Tag": "Reality"
    },
    "Mistake499": {
      "Mistake_Title": "Not Asking About His Relationship With Truth",
      "Mistake_Details": "You never discussed his relationship with honesty. He was comfortable with lying.",
      "Mistake_Lesson": "Know where he stands on honesty. It's fundamental.",
      "Mistake_Tag": "Values"
    },
    "Mistake500": {
      "Mistake_Title": "Finally Leaving When You Realized You Were Choosing Yourself",
      "Mistake_Details": "You left when self-preservation kicked in and you chose yourself over him. That was wisdom.",
      "Mistake_Lesson": "Choosing yourself is the most important choice you'll ever make.",
      "Mistake_Tag": "Self-Love"
    }

  }
}
